var addr_hash = {
    "北京市": {
        "alias": ["北京"],
        "id": 1,
        "cities": ["北京市"],
        "北京市": {
            "id": 1,
            "alias": ["北京"],
            "东城区": {
                "id": 1,
                "alias": ["东城"]
            },
            "districts": ["东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云区", "延庆区"],
            "西城区": {
                "id": 2,
                "alias": ["西城"]
            },
            "朝阳区": {
                "id": 5,
                "alias": ["朝阳"]
            },
            "丰台区": {
                "id": 6,
                "alias": ["丰台"]
            },
            "石景山区": {
                "id": 7,
                "alias": ["石景山"]
            },
            "海淀区": {
                "id": 8,
                "alias": ["海淀"]
            },
            "门头沟区": {
                "id": 9,
                "alias": ["门头沟"]
            },
            "房山区": {
                "id": 10,
                "alias": ["房山"]
            },
            "通州区": {
                "id": 11,
                "alias": ["通州"]
            },
            "顺义区": {
                "id": 12,
                "alias": ["顺义"]
            },
            "昌平区": {
                "id": 13,
                "alias": ["昌平"]
            },
            "大兴区": {
                "id": 14,
                "alias": ["大兴"]
            },
            "怀柔区": {
                "id": 15,
                "alias": ["怀柔"]
            },
            "平谷区": {
                "id": 16,
                "alias": ["平谷"]
            },
            "密云区": {
                "id": 17,
                "alias": ["密云"]
            },
            "延庆区": {
                "id": 18,
                "alias": ["延庆"]
            }
        }
    },
    "provinces": ["北京市", "天津市", "河北省", "山西省", "内蒙古自治区", "辽宁省", "吉林省", "黑龙江省", "上海市", "江苏省", "浙江省", "安徽省", "福建省", "江西省", "山东省", "河南省", "湖北省", "湖南省", "广东省", "广西壮族自治区", "海南省", "重庆市", "四川省", "贵州省", "云南省", "西藏自治区", "陕西省", "甘肃省", "青海省", "宁夏回族自治区", "新疆维吾尔自治区", "香港特别行政区", "澳门特别行政区", "台湾"],
    "天津市": {
        "alias": ["天津"],
        "id": 2,
        "cities": ["天津市"],
        "天津市": {
            "id": 2,
            "alias": ["天津"],
            "和平区": {
                "id": 19,
                "alias": ["和平"]
            },
            "districts": ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河区", "静海区", "滨海新区", "蓟州区"],
            "河东区": {
                "id": 20,
                "alias": ["河东"]
            },
            "河西区": {
                "id": 21,
                "alias": ["河西"]
            },
            "南开区": {
                "id": 22,
                "alias": ["南开"]
            },
            "河北区": {
                "id": 23,
                "alias": ["河北"]
            },
            "红桥区": {
                "id": 24,
                "alias": ["红桥"]
            },
            "塘沽区": {
                "id": 25,
                "alias": ["塘沽"]
            },
            "东丽区": {
                "id": 28,
                "alias": ["东丽"]
            },
            "西青区": {
                "id": 29,
                "alias": ["西青"]
            },
            "津南区": {
                "id": 30,
                "alias": ["津南"]
            },
            "北辰区": {
                "id": 31,
                "alias": ["北辰"]
            },
            "武清区": {
                "id": 32,
                "alias": ["武清"]
            },
            "宝坻区": {
                "id": 33,
                "alias": ["宝坻"]
            },
            "宁河区": {
                "id": 34,
                "alias": ["宁河"]
            },
            "静海区": {
                "id": 35,
                "alias": ["静海"]
            },
            "滨海新区": {
                "id": 3272,
                "alias": ["滨海"]
            },
            "蓟州区": {
                "id": 3273,
                "alias": ["蓟州"]
            }
        }
    },
    "河北省": {
        "alias": ["河北"],
        "id": 3,
        "cities": ["石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市"],
        "石家庄市": {
            "id": 3,
            "alias": ["石家庄"],
            "长安区": {
                "id": 37,
                "alias": ["长安"]
            },
            "districts": ["长安区", "桥东区", "桥西区", "新华区", "井陉矿区", "裕华区", "井陉县", "正定县", "栾城区", "行唐县", "灵寿县", "高邑县", "深泽县", "赞皇县", "无极县", "平山县", "元氏县", "赵县", "辛集市", "藁城区", "晋州市", "新乐市", "鹿泉区", "石家庄高新技术产业开发区", "石家庄循环化工园区"],
            "桥东区": {
                "id": 38,
                "alias": ["桥东"]
            },
            "桥西区": {
                "id": 39,
                "alias": ["桥西"]
            },
            "新华区": {
                "id": 40,
                "alias": ["新华"]
            },
            "井陉矿区": {
                "id": 41,
                "alias": ["井陉"]
            },
            "裕华区": {
                "id": 42,
                "alias": ["裕华"]
            },
            "井陉县": {
                "id": 43,
                "alias": ["井陉"]
            },
            "正定县": {
                "id": 44,
                "alias": ["正定"]
            },
            "栾城区": {
                "id": 45,
                "alias": ["栾城"]
            },
            "行唐县": {
                "id": 46,
                "alias": ["行唐"]
            },
            "灵寿县": {
                "id": 47,
                "alias": ["灵寿"]
            },
            "高邑县": {
                "id": 48,
                "alias": ["高邑"]
            },
            "深泽县": {
                "id": 49,
                "alias": ["深泽"]
            },
            "赞皇县": {
                "id": 50,
                "alias": ["赞皇"]
            },
            "无极县": {
                "id": 51,
                "alias": ["无极"]
            },
            "平山县": {
                "id": 52,
                "alias": ["平山"]
            },
            "元氏县": {
                "id": 53,
                "alias": ["元氏"]
            },
            "赵县": {
                "id": 54,
                "alias": []
            },
            "辛集市": {
                "id": 55,
                "alias": ["辛集"]
            },
            "藁城区": {
                "id": 56,
                "alias": ["藁城"]
            },
            "晋州市": {
                "id": 57,
                "alias": ["晋州"]
            },
            "新乐市": {
                "id": 58,
                "alias": ["新乐"]
            },
            "鹿泉区": {
                "id": 59,
                "alias": ["鹿泉"]
            },
            "石家庄高新技术产业开发区": {
                "id": 3421,
                "alias": ["石家庄高新技术产业开发"]
            },
            "石家庄循环化工园区": {
                "id": 3422,
                "alias": ["石家庄循环化工园"]
            }
        },
        "唐山市": {
            "id": 4,
            "alias": ["唐山"],
            "路南区": {
                "id": 60,
                "alias": ["路南"]
            },
            "districts": ["路南区", "路北区", "古冶区", "开平区", "丰南区", "丰润区", "滦县", "滦南县", "乐亭县", "迁西县", "玉田县", "遵化市", "迁安市", "曹妃甸区", "唐山市芦台经济技术开发区", "唐山市汉沽管理区", "唐山高新技术产业开发区", "河北唐山海港经济开发区"],
            "路北区": {
                "id": 61,
                "alias": ["路北"]
            },
            "古冶区": {
                "id": 62,
                "alias": ["古冶"]
            },
            "开平区": {
                "id": 63,
                "alias": ["开平"]
            },
            "丰南区": {
                "id": 64,
                "alias": ["丰南"]
            },
            "丰润区": {
                "id": 65,
                "alias": ["丰润"]
            },
            "滦县": {
                "id": 66,
                "alias": []
            },
            "滦南县": {
                "id": 67,
                "alias": ["滦南"]
            },
            "乐亭县": {
                "id": 68,
                "alias": ["乐亭"]
            },
            "迁西县": {
                "id": 69,
                "alias": ["迁西"]
            },
            "玉田县": {
                "id": 70,
                "alias": ["玉田"]
            },
            "遵化市": {
                "id": 72,
                "alias": ["遵化"]
            },
            "迁安市": {
                "id": 73,
                "alias": ["迁安"]
            },
            "曹妃甸区": {
                "id": 3423,
                "alias": ["曹妃甸"]
            },
            "唐山市芦台经济技术开发区": {
                "id": 3424,
                "alias": ["唐山市芦台经济技术开发"]
            },
            "唐山市汉沽管理区": {
                "id": 3425,
                "alias": ["唐山市汉沽管理"]
            },
            "唐山高新技术产业开发区": {
                "id": 3426,
                "alias": ["唐山高新技术产业开发"]
            },
            "河北唐山海港经济开发区": {
                "id": 3427,
                "alias": ["河北唐山海港经济开发"]
            }
        },
        "秦皇岛市": {
            "id": 5,
            "alias": ["秦皇岛"],
            "海港区": {
                "id": 74,
                "alias": ["海港"]
            },
            "districts": ["海港区", "山海关区", "北戴河区", "青龙满族自治县", "昌黎县", "抚宁区", "卢龙县", "秦皇岛市经济技术开发区", "北戴河新区"],
            "山海关区": {
                "id": 75,
                "alias": ["山海关"]
            },
            "北戴河区": {
                "id": 76,
                "alias": ["北戴河"]
            },
            "青龙满族自治县": {
                "id": 77,
                "alias": ["青龙"]
            },
            "昌黎县": {
                "id": 78,
                "alias": ["昌黎"]
            },
            "抚宁区": {
                "id": 79,
                "alias": ["抚宁"]
            },
            "卢龙县": {
                "id": 80,
                "alias": ["卢龙"]
            },
            "秦皇岛市经济技术开发区": {
                "id": 3428,
                "alias": ["秦皇岛市经济技术开发"]
            },
            "北戴河新区": {
                "id": 3429,
                "alias": ["北戴河"]
            }
        },
        "邯郸市": {
            "id": 6,
            "alias": ["邯郸"],
            "邯山区": {
                "id": 81,
                "alias": ["邯山"]
            },
            "districts": ["邯山区", "丛台区", "复兴区", "峰峰矿区", "邯郸冀南新区", "临漳县", "成安县", "大名县", "涉县", "磁县", "肥乡区", "永年区", "邱县", "鸡泽县", "广平县", "馆陶县", "魏县", "曲周县", "武安市", "邯郸经济技术开发区"],
            "丛台区": {
                "id": 82,
                "alias": ["丛台"]
            },
            "复兴区": {
                "id": 83,
                "alias": ["复兴"]
            },
            "峰峰矿区": {
                "id": 84,
                "alias": ["峰峰"]
            },
            "邯郸冀南新区": {
                "id": 85,
                "alias": ["邯郸冀南"]
            },
            "临漳县": {
                "id": 86,
                "alias": ["临漳"]
            },
            "成安县": {
                "id": 87,
                "alias": ["成安"]
            },
            "大名县": {
                "id": 88,
                "alias": ["大名"]
            },
            "涉县": {
                "id": 89,
                "alias": []
            },
            "磁县": {
                "id": 90,
                "alias": []
            },
            "肥乡区": {
                "id": 91,
                "alias": ["肥乡"]
            },
            "永年区": {
                "id": 92,
                "alias": ["永年"]
            },
            "邱县": {
                "id": 93,
                "alias": []
            },
            "鸡泽县": {
                "id": 94,
                "alias": ["鸡泽"]
            },
            "广平县": {
                "id": 95,
                "alias": ["广平"]
            },
            "馆陶县": {
                "id": 96,
                "alias": ["馆陶"]
            },
            "魏县": {
                "id": 97,
                "alias": []
            },
            "曲周县": {
                "id": 98,
                "alias": ["曲周"]
            },
            "武安市": {
                "id": 99,
                "alias": ["武安"]
            },
            "邯郸经济技术开发区": {
                "id": 3430,
                "alias": ["邯郸经济技术开发"]
            }
        },
        "邢台市": {
            "id": 7,
            "alias": ["邢台"],
            "桥东区": {
                "id": 100,
                "alias": ["桥东"]
            },
            "districts": ["桥东区", "桥西区", "邢台县", "临城县", "内丘县", "柏乡县", "隆尧县", "任县", "南和县", "宁晋县", "巨鹿县", "新河县", "广宗县", "平乡县", "威县", "清河县", "临西县", "南宫市", "沙河市", "河北邢台经济开发区"],
            "桥西区": {
                "id": 101,
                "alias": ["桥西"]
            },
            "邢台县": {
                "id": 102,
                "alias": ["邢台"]
            },
            "临城县": {
                "id": 103,
                "alias": ["临城"]
            },
            "内丘县": {
                "id": 104,
                "alias": ["内丘"]
            },
            "柏乡县": {
                "id": 105,
                "alias": ["柏乡"]
            },
            "隆尧县": {
                "id": 106,
                "alias": ["隆尧"]
            },
            "任县": {
                "id": 107,
                "alias": []
            },
            "南和县": {
                "id": 108,
                "alias": ["南和"]
            },
            "宁晋县": {
                "id": 109,
                "alias": ["宁晋"]
            },
            "巨鹿县": {
                "id": 110,
                "alias": ["巨鹿"]
            },
            "新河县": {
                "id": 111,
                "alias": ["新河"]
            },
            "广宗县": {
                "id": 112,
                "alias": ["广宗"]
            },
            "平乡县": {
                "id": 113,
                "alias": ["平乡"]
            },
            "威县": {
                "id": 114,
                "alias": []
            },
            "清河县": {
                "id": 115,
                "alias": ["清河"]
            },
            "临西县": {
                "id": 116,
                "alias": ["临西"]
            },
            "南宫市": {
                "id": 117,
                "alias": ["南宫"]
            },
            "沙河市": {
                "id": 118,
                "alias": ["沙河"]
            },
            "河北邢台经济开发区": {
                "id": 3431,
                "alias": ["河北邢台经济开发"]
            }
        },
        "保定市": {
            "id": 8,
            "alias": ["保定"],
            "南市区": {
                "id": 121,
                "alias": ["南市"]
            },
            "districts": ["南市区", "满城区", "清苑区", "涞水县", "阜平县", "徐水区", "定兴县", "唐县", "高阳县", "容城县", "涞源县", "望都县", "安新县", "易县", "曲阳县", "蠡县", "顺平县", "博野县", "雄县", "涿州市", "定州市", "安国市", "高碑店市", "竞秀区", "莲池区", "保定高新技术产业开发区", "保定白沟新城"],
            "满城区": {
                "id": 122,
                "alias": ["满城"]
            },
            "清苑区": {
                "id": 123,
                "alias": ["清苑"]
            },
            "涞水县": {
                "id": 124,
                "alias": ["涞水"]
            },
            "阜平县": {
                "id": 125,
                "alias": ["阜平"]
            },
            "徐水区": {
                "id": 126,
                "alias": ["徐水"]
            },
            "定兴县": {
                "id": 127,
                "alias": ["定兴"]
            },
            "唐县": {
                "id": 128,
                "alias": []
            },
            "高阳县": {
                "id": 129,
                "alias": ["高阳"]
            },
            "容城县": {
                "id": 130,
                "alias": ["容城"]
            },
            "涞源县": {
                "id": 131,
                "alias": ["涞源"]
            },
            "望都县": {
                "id": 132,
                "alias": ["望都"]
            },
            "安新县": {
                "id": 133,
                "alias": ["安新"]
            },
            "易县": {
                "id": 134,
                "alias": []
            },
            "曲阳县": {
                "id": 135,
                "alias": ["曲阳"]
            },
            "蠡县": {
                "id": 136,
                "alias": []
            },
            "顺平县": {
                "id": 137,
                "alias": ["顺平"]
            },
            "博野县": {
                "id": 138,
                "alias": ["博野"]
            },
            "雄县": {
                "id": 139,
                "alias": []
            },
            "涿州市": {
                "id": 140,
                "alias": ["涿州"]
            },
            "定州市": {
                "id": 141,
                "alias": ["定州"]
            },
            "安国市": {
                "id": 142,
                "alias": ["安国"]
            },
            "高碑店市": {
                "id": 143,
                "alias": ["高碑店"]
            },
            "竞秀区": {
                "id": 3432,
                "alias": ["竞秀"]
            },
            "莲池区": {
                "id": 3433,
                "alias": ["莲池"]
            },
            "保定高新技术产业开发区": {
                "id": 3434,
                "alias": ["保定高新技术产业开发"]
            },
            "保定白沟新城": {
                "id": 3435,
                "alias": []
            }
        },
        "张家口市": {
            "id": 9,
            "alias": ["张家口"],
            "桥东区": {
                "id": 144,
                "alias": ["桥东"]
            },
            "districts": ["桥东区", "桥西区", "宣化区", "下花园区", "张北县", "康保县", "沽源县", "尚义县", "蔚县", "阳原县", "怀安县", "万全区", "怀来县", "涿鹿县", "赤城县", "崇礼区", "张家口市高新技术产业开发区", "张家口市察北管理区", "张家口市塞北管理区"],
            "桥西区": {
                "id": 145,
                "alias": ["桥西"]
            },
            "宣化区": {
                "id": 146,
                "alias": ["宣化"]
            },
            "下花园区": {
                "id": 147,
                "alias": ["下花园"]
            },
            "张北县": {
                "id": 149,
                "alias": ["张北"]
            },
            "康保县": {
                "id": 150,
                "alias": ["康保"]
            },
            "沽源县": {
                "id": 151,
                "alias": ["沽源"]
            },
            "尚义县": {
                "id": 152,
                "alias": ["尚义"]
            },
            "蔚县": {
                "id": 153,
                "alias": []
            },
            "阳原县": {
                "id": 154,
                "alias": ["阳原"]
            },
            "怀安县": {
                "id": 155,
                "alias": ["怀安"]
            },
            "万全区": {
                "id": 156,
                "alias": ["万全"]
            },
            "怀来县": {
                "id": 157,
                "alias": ["怀来"]
            },
            "涿鹿县": {
                "id": 158,
                "alias": ["涿鹿"]
            },
            "赤城县": {
                "id": 159,
                "alias": ["赤城"]
            },
            "崇礼区": {
                "id": 160,
                "alias": ["崇礼"]
            },
            "张家口市高新技术产业开发区": {
                "id": 3436,
                "alias": ["张家口市高新技术产业开发"]
            },
            "张家口市察北管理区": {
                "id": 3437,
                "alias": ["张家口市察北管理"]
            },
            "张家口市塞北管理区": {
                "id": 3438,
                "alias": ["张家口市塞北管理"]
            }
        },
        "承德市": {
            "id": 10,
            "alias": ["承德"],
            "双桥区": {
                "id": 161,
                "alias": ["双桥"]
            },
            "districts": ["双桥区", "双滦区", "鹰手营子矿区", "承德县", "兴隆县", "平泉市", "滦平县", "隆化县", "丰宁满族自治县", "宽城满族自治县", "围场满族蒙古族自治县", "承德高新技术产业开发区"],
            "双滦区": {
                "id": 162,
                "alias": ["双滦"]
            },
            "鹰手营子矿区": {
                "id": 163,
                "alias": ["鹰手营子"]
            },
            "承德县": {
                "id": 164,
                "alias": ["承德"]
            },
            "兴隆县": {
                "id": 165,
                "alias": ["兴隆"]
            },
            "平泉市": {
                "id": 166,
                "alias": ["平泉"]
            },
            "滦平县": {
                "id": 167,
                "alias": ["滦平"]
            },
            "隆化县": {
                "id": 168,
                "alias": ["隆化"]
            },
            "丰宁满族自治县": {
                "id": 169,
                "alias": ["丰宁"]
            },
            "宽城满族自治县": {
                "id": 170,
                "alias": ["宽城"]
            },
            "围场满族蒙古族自治县": {
                "id": 171,
                "alias": ["围场"]
            },
            "承德高新技术产业开发区": {
                "id": 3439,
                "alias": ["承德高新技术产业开发"]
            }
        },
        "沧州市": {
            "id": 11,
            "alias": ["沧州"],
            "新华区": {
                "id": 172,
                "alias": ["新华"]
            },
            "districts": ["新华区", "运河区", "沧县", "青县", "东光县", "海兴县", "盐山县", "肃宁县", "南皮县", "吴桥县", "献县", "孟村回族自治县", "泊头市", "任丘市", "黄骅市", "河间市", "河北沧州经济开发区", "沧州高新技术产业开发区", "沧州渤海新区"],
            "运河区": {
                "id": 173,
                "alias": ["运河"]
            },
            "沧县": {
                "id": 174,
                "alias": []
            },
            "青县": {
                "id": 175,
                "alias": []
            },
            "东光县": {
                "id": 176,
                "alias": ["东光"]
            },
            "海兴县": {
                "id": 177,
                "alias": ["海兴"]
            },
            "盐山县": {
                "id": 178,
                "alias": ["盐山"]
            },
            "肃宁县": {
                "id": 179,
                "alias": ["肃宁"]
            },
            "南皮县": {
                "id": 180,
                "alias": ["南皮"]
            },
            "吴桥县": {
                "id": 181,
                "alias": ["吴桥"]
            },
            "献县": {
                "id": 182,
                "alias": []
            },
            "孟村回族自治县": {
                "id": 183,
                "alias": ["孟村"]
            },
            "泊头市": {
                "id": 184,
                "alias": ["泊头"]
            },
            "任丘市": {
                "id": 185,
                "alias": ["任丘"]
            },
            "黄骅市": {
                "id": 186,
                "alias": ["黄骅"]
            },
            "河间市": {
                "id": 187,
                "alias": ["河间"]
            },
            "河北沧州经济开发区": {
                "id": 3440,
                "alias": ["河北沧州经济开发"]
            },
            "沧州高新技术产业开发区": {
                "id": 3441,
                "alias": ["沧州高新技术产业开发"]
            },
            "沧州渤海新区": {
                "id": 3442,
                "alias": ["沧州渤海"]
            }
        },
        "廊坊市": {
            "id": 12,
            "alias": ["廊坊"],
            "安次区": {
                "id": 188,
                "alias": ["安次"]
            },
            "districts": ["安次区", "广阳区", "固安县", "永清县", "香河县", "大城县", "文安县", "大厂回族自治县", "霸州市", "三河市", "廊坊经济技术开发区"],
            "广阳区": {
                "id": 189,
                "alias": ["广阳"]
            },
            "固安县": {
                "id": 190,
                "alias": ["固安"]
            },
            "永清县": {
                "id": 191,
                "alias": ["永清"]
            },
            "香河县": {
                "id": 192,
                "alias": ["香河"]
            },
            "大城县": {
                "id": 193,
                "alias": ["大城"]
            },
            "文安县": {
                "id": 194,
                "alias": ["文安"]
            },
            "大厂回族自治县": {
                "id": 195,
                "alias": ["大厂"]
            },
            "霸州市": {
                "id": 196,
                "alias": ["霸州"]
            },
            "三河市": {
                "id": 197,
                "alias": ["三河"]
            },
            "廊坊经济技术开发区": {
                "id": 3443,
                "alias": ["廊坊经济技术开发"]
            }
        },
        "衡水市": {
            "id": 13,
            "alias": ["衡水"],
            "桃城区": {
                "id": 198,
                "alias": ["桃城"]
            },
            "districts": ["桃城区", "枣强县", "武邑县", "武强县", "饶阳县", "安平县", "故城县", "景县", "阜城县", "冀州区", "深州市", "河北衡水经济开发区", "衡水滨湖新区"],
            "枣强县": {
                "id": 199,
                "alias": ["枣强"]
            },
            "武邑县": {
                "id": 200,
                "alias": ["武邑"]
            },
            "武强县": {
                "id": 201,
                "alias": ["武强"]
            },
            "饶阳县": {
                "id": 202,
                "alias": ["饶阳"]
            },
            "安平县": {
                "id": 203,
                "alias": ["安平"]
            },
            "故城县": {
                "id": 204,
                "alias": ["故城"]
            },
            "景县": {
                "id": 205,
                "alias": []
            },
            "阜城县": {
                "id": 206,
                "alias": ["阜城"]
            },
            "冀州区": {
                "id": 207,
                "alias": ["冀州"]
            },
            "深州市": {
                "id": 208,
                "alias": ["深州"]
            },
            "河北衡水经济开发区": {
                "id": 3444,
                "alias": ["河北衡水经济开发"]
            },
            "衡水滨湖新区": {
                "id": 3445,
                "alias": ["衡水滨湖"]
            }
        }
    },
    "山西省": {
        "alias": ["山西"],
        "id": 4,
        "cities": ["太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"],
        "太原市": {
            "id": 14,
            "alias": ["太原"],
            "小店区": {
                "id": 209,
                "alias": ["小店"]
            },
            "districts": ["小店区", "迎泽区", "杏花岭区", "尖草坪区", "万柏林区", "晋源区", "清徐县", "阳曲县", "娄烦县", "古交市", "山西转型综合改革示范区"],
            "迎泽区": {
                "id": 210,
                "alias": ["迎泽"]
            },
            "杏花岭区": {
                "id": 211,
                "alias": ["杏花岭"]
            },
            "尖草坪区": {
                "id": 212,
                "alias": ["尖草坪"]
            },
            "万柏林区": {
                "id": 213,
                "alias": ["万柏"]
            },
            "晋源区": {
                "id": 214,
                "alias": ["晋源"]
            },
            "清徐县": {
                "id": 215,
                "alias": ["清徐"]
            },
            "阳曲县": {
                "id": 216,
                "alias": ["阳曲"]
            },
            "娄烦县": {
                "id": 217,
                "alias": ["娄烦"]
            },
            "古交市": {
                "id": 218,
                "alias": ["古交"]
            },
            "山西转型综合改革示范区": {
                "id": 3321,
                "alias": ["山西转型综合改革示范"]
            }
        },
        "大同市": {
            "id": 15,
            "alias": ["大同"],
            "城区": {
                "id": 219,
                "alias": []
            },
            "districts": ["城区", "矿区", "南郊区", "新荣区", "阳高县", "天镇县", "广灵县", "灵丘县", "浑源县", "左云县", "大同县", "山西大同经济开发区"],
            "矿区": {
                "id": 220,
                "alias": []
            },
            "南郊区": {
                "id": 221,
                "alias": ["南郊"]
            },
            "新荣区": {
                "id": 222,
                "alias": ["新荣"]
            },
            "阳高县": {
                "id": 223,
                "alias": ["阳高"]
            },
            "天镇县": {
                "id": 224,
                "alias": ["天镇"]
            },
            "广灵县": {
                "id": 225,
                "alias": ["广灵"]
            },
            "灵丘县": {
                "id": 226,
                "alias": ["灵丘"]
            },
            "浑源县": {
                "id": 227,
                "alias": ["浑源"]
            },
            "左云县": {
                "id": 228,
                "alias": ["左云"]
            },
            "大同县": {
                "id": 229,
                "alias": ["大同"]
            },
            "山西大同经济开发区": {
                "id": 3322,
                "alias": ["山西大同经济开发"]
            }
        },
        "阳泉市": {
            "id": 16,
            "alias": ["阳泉"],
            "城区": {
                "id": 230,
                "alias": []
            },
            "districts": ["城区", "矿区", "郊区", "平定县", "盂县", "山西阳泉经济开发区"],
            "矿区": {
                "id": 231,
                "alias": []
            },
            "郊区": {
                "id": 232,
                "alias": []
            },
            "平定县": {
                "id": 233,
                "alias": ["平定"]
            },
            "盂县": {
                "id": 234,
                "alias": []
            },
            "山西阳泉经济开发区": {
                "id": 3323,
                "alias": ["山西阳泉经济开发"]
            }
        },
        "长治市": {
            "id": 17,
            "alias": ["长治"],
            "城区": {
                "id": 235,
                "alias": []
            },
            "districts": ["城区", "郊区", "长治县", "襄垣县", "屯留县", "平顺县", "黎城县", "壶关县", "长子县", "武乡县", "沁县", "沁源县", "潞城市", "山西长治高新技术产业园区"],
            "郊区": {
                "id": 236,
                "alias": []
            },
            "长治县": {
                "id": 237,
                "alias": ["长治"]
            },
            "襄垣县": {
                "id": 238,
                "alias": ["襄垣"]
            },
            "屯留县": {
                "id": 239,
                "alias": ["屯留"]
            },
            "平顺县": {
                "id": 240,
                "alias": ["平顺"]
            },
            "黎城县": {
                "id": 241,
                "alias": ["黎城"]
            },
            "壶关县": {
                "id": 242,
                "alias": ["壶关"]
            },
            "长子县": {
                "id": 243,
                "alias": ["长子"]
            },
            "武乡县": {
                "id": 244,
                "alias": ["武乡"]
            },
            "沁县": {
                "id": 245,
                "alias": []
            },
            "沁源县": {
                "id": 246,
                "alias": ["沁源"]
            },
            "潞城市": {
                "id": 247,
                "alias": ["潞城"]
            },
            "山西长治高新技术产业园区": {
                "id": 3324,
                "alias": ["山西长治高新技术产业园"]
            }
        },
        "晋城市": {
            "id": 18,
            "alias": ["晋城"],
            "城区": {
                "id": 248,
                "alias": []
            },
            "districts": ["城区", "沁水县", "阳城县", "陵川县", "泽州县", "高平市"],
            "沁水县": {
                "id": 249,
                "alias": ["沁水"]
            },
            "阳城县": {
                "id": 250,
                "alias": ["阳城"]
            },
            "陵川县": {
                "id": 251,
                "alias": ["陵川"]
            },
            "泽州县": {
                "id": 252,
                "alias": ["泽州"]
            },
            "高平市": {
                "id": 253,
                "alias": ["高平"]
            }
        },
        "朔州市": {
            "id": 19,
            "alias": ["朔州"],
            "朔城区": {
                "id": 254,
                "alias": ["朔城"]
            },
            "districts": ["朔城区", "平鲁区", "山阴县", "应县", "右玉县", "怀仁县", "山西朔州经济开发区"],
            "平鲁区": {
                "id": 255,
                "alias": ["平鲁"]
            },
            "山阴县": {
                "id": 256,
                "alias": ["山阴"]
            },
            "应县": {
                "id": 257,
                "alias": []
            },
            "右玉县": {
                "id": 258,
                "alias": ["右玉"]
            },
            "怀仁县": {
                "id": 259,
                "alias": ["怀仁"]
            },
            "山西朔州经济开发区": {
                "id": 3325,
                "alias": ["山西朔州经济开发"]
            }
        },
        "晋中市": {
            "id": 20,
            "alias": ["晋中"],
            "榆次区": {
                "id": 260,
                "alias": ["榆次"]
            },
            "districts": ["榆次区", "榆社县", "左权县", "和顺县", "昔阳县", "寿阳县", "太谷县", "祁县", "平遥县", "灵石县", "介休市"],
            "榆社县": {
                "id": 261,
                "alias": ["榆社"]
            },
            "左权县": {
                "id": 262,
                "alias": ["左权"]
            },
            "和顺县": {
                "id": 263,
                "alias": ["和顺"]
            },
            "昔阳县": {
                "id": 264,
                "alias": ["昔阳"]
            },
            "寿阳县": {
                "id": 265,
                "alias": ["寿阳"]
            },
            "太谷县": {
                "id": 266,
                "alias": ["太谷"]
            },
            "祁县": {
                "id": 267,
                "alias": []
            },
            "平遥县": {
                "id": 268,
                "alias": ["平遥"]
            },
            "灵石县": {
                "id": 269,
                "alias": ["灵石"]
            },
            "介休市": {
                "id": 270,
                "alias": ["介休"]
            }
        },
        "运城市": {
            "id": 21,
            "alias": ["运城"],
            "盐湖区": {
                "id": 271,
                "alias": ["盐湖"]
            },
            "districts": ["盐湖区", "临猗县", "万荣县", "闻喜县", "稷山县", "新绛县", "绛县", "垣曲县", "夏县", "平陆县", "芮城县", "永济市", "河津市"],
            "临猗县": {
                "id": 272,
                "alias": ["临猗"]
            },
            "万荣县": {
                "id": 273,
                "alias": ["万荣"]
            },
            "闻喜县": {
                "id": 274,
                "alias": ["闻喜"]
            },
            "稷山县": {
                "id": 275,
                "alias": ["稷山"]
            },
            "新绛县": {
                "id": 276,
                "alias": ["新绛"]
            },
            "绛县": {
                "id": 277,
                "alias": []
            },
            "垣曲县": {
                "id": 278,
                "alias": ["垣曲"]
            },
            "夏县": {
                "id": 279,
                "alias": []
            },
            "平陆县": {
                "id": 280,
                "alias": ["平陆"]
            },
            "芮城县": {
                "id": 281,
                "alias": ["芮城"]
            },
            "永济市": {
                "id": 282,
                "alias": ["永济"]
            },
            "河津市": {
                "id": 283,
                "alias": ["河津"]
            }
        },
        "忻州市": {
            "id": 22,
            "alias": ["忻州"],
            "忻府区": {
                "id": 284,
                "alias": ["忻府"]
            },
            "districts": ["忻府区", "定襄县", "五台县", "代县", "繁峙县", "宁武县", "静乐县", "神池县", "五寨县", "岢岚县", "河曲县", "保德县", "偏关县", "原平市", "五台山风景名胜区"],
            "定襄县": {
                "id": 285,
                "alias": ["定襄"]
            },
            "五台县": {
                "id": 286,
                "alias": ["五台"]
            },
            "代县": {
                "id": 287,
                "alias": []
            },
            "繁峙县": {
                "id": 288,
                "alias": ["繁峙"]
            },
            "宁武县": {
                "id": 289,
                "alias": ["宁武"]
            },
            "静乐县": {
                "id": 290,
                "alias": ["静乐"]
            },
            "神池县": {
                "id": 291,
                "alias": ["神池"]
            },
            "五寨县": {
                "id": 292,
                "alias": ["五寨"]
            },
            "岢岚县": {
                "id": 293,
                "alias": ["岢岚"]
            },
            "河曲县": {
                "id": 294,
                "alias": ["河曲"]
            },
            "保德县": {
                "id": 295,
                "alias": ["保德"]
            },
            "偏关县": {
                "id": 296,
                "alias": ["偏关"]
            },
            "原平市": {
                "id": 297,
                "alias": ["原平"]
            },
            "五台山风景名胜区": {
                "id": 3326,
                "alias": ["五台山风景名胜"]
            }
        },
        "临汾市": {
            "id": 23,
            "alias": ["临汾"],
            "尧都区": {
                "id": 298,
                "alias": ["尧都"]
            },
            "districts": ["尧都区", "曲沃县", "翼城县", "襄汾县", "洪洞县", "古县", "安泽县", "浮山县", "吉县", "乡宁县", "大宁县", "隰县", "永和县", "蒲县", "汾西县", "侯马市", "霍州市"],
            "曲沃县": {
                "id": 299,
                "alias": ["曲沃"]
            },
            "翼城县": {
                "id": 300,
                "alias": ["翼城"]
            },
            "襄汾县": {
                "id": 301,
                "alias": ["襄汾"]
            },
            "洪洞县": {
                "id": 302,
                "alias": ["洪洞"]
            },
            "古县": {
                "id": 303,
                "alias": []
            },
            "安泽县": {
                "id": 304,
                "alias": ["安泽"]
            },
            "浮山县": {
                "id": 305,
                "alias": ["浮山"]
            },
            "吉县": {
                "id": 306,
                "alias": []
            },
            "乡宁县": {
                "id": 307,
                "alias": ["乡宁"]
            },
            "大宁县": {
                "id": 308,
                "alias": ["大宁"]
            },
            "隰县": {
                "id": 309,
                "alias": []
            },
            "永和县": {
                "id": 310,
                "alias": ["永和"]
            },
            "蒲县": {
                "id": 311,
                "alias": []
            },
            "汾西县": {
                "id": 312,
                "alias": ["汾西"]
            },
            "侯马市": {
                "id": 313,
                "alias": ["侯马"]
            },
            "霍州市": {
                "id": 314,
                "alias": ["霍州"]
            }
        },
        "吕梁市": {
            "id": 24,
            "alias": ["吕梁"],
            "离石区": {
                "id": 315,
                "alias": ["离石"]
            },
            "districts": ["离石区", "文水县", "交城县", "兴县", "临县", "柳林县", "石楼县", "岚县", "方山县", "中阳县", "交口县", "孝义市", "汾阳市"],
            "文水县": {
                "id": 316,
                "alias": ["文水"]
            },
            "交城县": {
                "id": 317,
                "alias": ["交城"]
            },
            "兴县": {
                "id": 318,
                "alias": []
            },
            "临县": {
                "id": 319,
                "alias": []
            },
            "柳林县": {
                "id": 320,
                "alias": ["柳林"]
            },
            "石楼县": {
                "id": 321,
                "alias": ["石楼"]
            },
            "岚县": {
                "id": 322,
                "alias": []
            },
            "方山县": {
                "id": 323,
                "alias": ["方山"]
            },
            "中阳县": {
                "id": 324,
                "alias": ["中阳"]
            },
            "交口县": {
                "id": 325,
                "alias": ["交口"]
            },
            "孝义市": {
                "id": 326,
                "alias": ["孝义"]
            },
            "汾阳市": {
                "id": 327,
                "alias": ["汾阳"]
            }
        }
    },
    "内蒙古自治区": {
        "alias": ["内蒙古"],
        "id": 5,
        "cities": ["呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "兴安盟", "锡林郭勒盟", "阿拉善盟"],
        "呼和浩特市": {
            "id": 25,
            "alias": ["呼和浩特"],
            "新城区": {
                "id": 328,
                "alias": ["新城"]
            },
            "districts": ["新城区", "回民区", "玉泉区", "赛罕区", "土默特左旗", "托克托县", "和林格尔县", "清水河县", "武川县", "呼和浩特金海工业园区", "呼和浩特经济技术开发区"],
            "回民区": {
                "id": 329,
                "alias": ["回民"]
            },
            "玉泉区": {
                "id": 330,
                "alias": ["玉泉"]
            },
            "赛罕区": {
                "id": 331,
                "alias": ["赛罕"]
            },
            "土默特左旗": {
                "id": 332,
                "alias": ["土默特"]
            },
            "托克托县": {
                "id": 333,
                "alias": ["托克托"]
            },
            "和林格尔县": {
                "id": 334,
                "alias": ["和林格尔"]
            },
            "清水河县": {
                "id": 335,
                "alias": ["清水河"]
            },
            "武川县": {
                "id": 336,
                "alias": ["武川"]
            },
            "呼和浩特金海工业园区": {
                "id": 2873,
                "alias": ["呼和浩特金海工业园"]
            },
            "呼和浩特经济技术开发区": {
                "id": 2874,
                "alias": ["呼和浩特经济技术开发"]
            }
        },
        "包头市": {
            "id": 26,
            "alias": ["包头"],
            "东河区": {
                "id": 337,
                "alias": ["东河"]
            },
            "districts": ["东河区", "昆都仑区", "青山区", "石拐区", "白云鄂博矿区", "九原区", "土默特右旗", "固阳县", "达尔罕茂明安联合旗", "包头稀土高新技术产业开发区"],
            "昆都仑区": {
                "id": 338,
                "alias": ["昆都仑"]
            },
            "青山区": {
                "id": 339,
                "alias": ["青山"]
            },
            "石拐区": {
                "id": 340,
                "alias": ["石拐"]
            },
            "白云鄂博矿区": {
                "id": 341,
                "alias": ["白云鄂博"]
            },
            "九原区": {
                "id": 342,
                "alias": ["九原"]
            },
            "土默特右旗": {
                "id": 343,
                "alias": ["土默特"]
            },
            "固阳县": {
                "id": 344,
                "alias": ["固阳"]
            },
            "达尔罕茂明安联合旗": {
                "id": 345,
                "alias": ["达尔罕茂明安联合"]
            },
            "包头稀土高新技术产业开发区": {
                "id": 2875,
                "alias": ["包头稀土高新技术产业开发"]
            }
        },
        "乌海市": {
            "id": 27,
            "alias": ["乌海"],
            "海勃湾区": {
                "id": 346,
                "alias": ["海勃湾"]
            },
            "districts": ["海勃湾区", "海南区", "乌达区"],
            "海南区": {
                "id": 347,
                "alias": ["海南"]
            },
            "乌达区": {
                "id": 348,
                "alias": ["乌达"]
            }
        },
        "赤峰市": {
            "id": 28,
            "alias": ["赤峰"],
            "红山区": {
                "id": 349,
                "alias": ["红山"]
            },
            "districts": ["红山区", "元宝山区", "松山区", "阿鲁科尔沁旗", "巴林左旗", "巴林右旗", "林西县", "克什克腾旗", "翁牛特旗", "喀喇沁旗", "宁城县", "敖汉旗"],
            "元宝山区": {
                "id": 350,
                "alias": ["元宝山"]
            },
            "松山区": {
                "id": 351,
                "alias": ["松山"]
            },
            "阿鲁科尔沁旗": {
                "id": 352,
                "alias": ["阿鲁科尔沁"]
            },
            "巴林左旗": {
                "id": 353,
                "alias": ["巴林"]
            },
            "巴林右旗": {
                "id": 354,
                "alias": ["巴林"]
            },
            "林西县": {
                "id": 355,
                "alias": ["林西"]
            },
            "克什克腾旗": {
                "id": 356,
                "alias": ["克什克腾"]
            },
            "翁牛特旗": {
                "id": 357,
                "alias": ["翁牛特"]
            },
            "喀喇沁旗": {
                "id": 358,
                "alias": ["喀喇沁"]
            },
            "宁城县": {
                "id": 359,
                "alias": ["宁城"]
            },
            "敖汉旗": {
                "id": 360,
                "alias": ["敖汉"]
            }
        },
        "通辽市": {
            "id": 29,
            "alias": ["通辽"],
            "科尔沁区": {
                "id": 361,
                "alias": ["科尔沁"]
            },
            "districts": ["科尔沁区", "科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁县", "库伦旗", "奈曼旗", "扎鲁特旗", "霍林郭勒市", "通辽经济技术开发区"],
            "科尔沁左翼中旗": {
                "id": 362,
                "alias": ["科尔沁"]
            },
            "科尔沁左翼后旗": {
                "id": 363,
                "alias": ["科尔沁"]
            },
            "开鲁县": {
                "id": 364,
                "alias": ["开鲁"]
            },
            "库伦旗": {
                "id": 365,
                "alias": ["库伦"]
            },
            "奈曼旗": {
                "id": 366,
                "alias": ["奈曼"]
            },
            "扎鲁特旗": {
                "id": 367,
                "alias": ["扎鲁特"]
            },
            "霍林郭勒市": {
                "id": 368,
                "alias": ["霍林郭勒"]
            },
            "通辽经济技术开发区": {
                "id": 2876,
                "alias": ["通辽经济技术开发"]
            }
        },
        "鄂尔多斯市": {
            "id": 30,
            "alias": ["鄂尔多斯"],
            "东胜区": {
                "id": 369,
                "alias": ["东胜"]
            },
            "districts": ["东胜区", "达拉特旗", "准格尔旗", "鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗", "伊金霍洛旗", "康巴什区"],
            "达拉特旗": {
                "id": 370,
                "alias": ["达拉特"]
            },
            "准格尔旗": {
                "id": 371,
                "alias": ["准格尔"]
            },
            "鄂托克前旗": {
                "id": 372,
                "alias": ["鄂托克"]
            },
            "鄂托克旗": {
                "id": 373,
                "alias": ["鄂托克"]
            },
            "杭锦旗": {
                "id": 374,
                "alias": ["杭锦"]
            },
            "乌审旗": {
                "id": 375,
                "alias": ["乌审"]
            },
            "伊金霍洛旗": {
                "id": 376,
                "alias": ["伊金霍洛"]
            },
            "康巴什区": {
                "id": 2877,
                "alias": ["康巴什"]
            }
        },
        "呼伦贝尔市": {
            "id": 31,
            "alias": ["呼伦贝尔"],
            "海拉尔区": {
                "id": 377,
                "alias": ["海拉尔"]
            },
            "districts": ["海拉尔区", "阿荣旗", "莫力达瓦达斡尔族自治旗", "鄂伦春自治旗", "鄂温克族自治旗", "陈巴尔虎旗", "新巴尔虎左旗", "新巴尔虎右旗", "满洲里市", "牙克石市", "扎兰屯市", "额尔古纳市", "根河市", "扎赉诺尔区"],
            "阿荣旗": {
                "id": 378,
                "alias": ["阿荣"]
            },
            "莫力达瓦达斡尔族自治旗": {
                "id": 379,
                "alias": ["莫力达瓦达斡尔族"]
            },
            "鄂伦春自治旗": {
                "id": 380,
                "alias": ["鄂伦春"]
            },
            "鄂温克族自治旗": {
                "id": 381,
                "alias": ["鄂温克族"]
            },
            "陈巴尔虎旗": {
                "id": 382,
                "alias": ["陈巴尔虎"]
            },
            "新巴尔虎左旗": {
                "id": 383,
                "alias": ["新巴尔虎"]
            },
            "新巴尔虎右旗": {
                "id": 384,
                "alias": ["新巴尔虎"]
            },
            "满洲里市": {
                "id": 385,
                "alias": ["满洲里"]
            },
            "牙克石市": {
                "id": 386,
                "alias": ["牙克石"]
            },
            "扎兰屯市": {
                "id": 387,
                "alias": ["扎兰屯"]
            },
            "额尔古纳市": {
                "id": 388,
                "alias": ["额尔古纳"]
            },
            "根河市": {
                "id": 389,
                "alias": ["根河"]
            },
            "扎赉诺尔区": {
                "id": 2878,
                "alias": ["扎赉诺尔"]
            }
        },
        "巴彦淖尔市": {
            "id": 32,
            "alias": ["巴彦淖尔"],
            "临河区": {
                "id": 390,
                "alias": ["临河"]
            },
            "districts": ["临河区", "五原县", "磴口县", "乌拉特前旗", "乌拉特中旗", "乌拉特后旗", "杭锦后旗"],
            "五原县": {
                "id": 391,
                "alias": ["五原"]
            },
            "磴口县": {
                "id": 392,
                "alias": ["磴口"]
            },
            "乌拉特前旗": {
                "id": 393,
                "alias": ["乌拉特"]
            },
            "乌拉特中旗": {
                "id": 394,
                "alias": ["乌拉特"]
            },
            "乌拉特后旗": {
                "id": 395,
                "alias": ["乌拉特"]
            },
            "杭锦后旗": {
                "id": 396,
                "alias": ["杭锦"]
            }
        },
        "乌兰察布市": {
            "id": 33,
            "alias": ["乌兰察布"],
            "集宁区": {
                "id": 397,
                "alias": ["集宁"]
            },
            "districts": ["集宁区", "卓资县", "化德县", "商都县", "兴和县", "凉城县", "察哈尔右翼前旗", "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗", "丰镇市"],
            "卓资县": {
                "id": 398,
                "alias": ["卓资"]
            },
            "化德县": {
                "id": 399,
                "alias": ["化德"]
            },
            "商都县": {
                "id": 400,
                "alias": ["商都"]
            },
            "兴和县": {
                "id": 401,
                "alias": ["兴和"]
            },
            "凉城县": {
                "id": 402,
                "alias": ["凉城"]
            },
            "察哈尔右翼前旗": {
                "id": 403,
                "alias": ["察哈尔"]
            },
            "察哈尔右翼中旗": {
                "id": 404,
                "alias": ["察哈尔"]
            },
            "察哈尔右翼后旗": {
                "id": 405,
                "alias": ["察哈尔"]
            },
            "四子王旗": {
                "id": 406,
                "alias": ["四子王"]
            },
            "丰镇市": {
                "id": 407,
                "alias": ["丰镇"]
            }
        },
        "兴安盟": {
            "id": 34,
            "alias": ["兴安"],
            "乌兰浩特市": {
                "id": 408,
                "alias": ["乌兰浩特"]
            },
            "districts": ["乌兰浩特市", "阿尔山市", "科尔沁右翼前旗", "科尔沁右翼中旗", "扎赉特旗", "突泉县"],
            "阿尔山市": {
                "id": 409,
                "alias": ["阿尔山"]
            },
            "科尔沁右翼前旗": {
                "id": 410,
                "alias": ["科尔沁"]
            },
            "科尔沁右翼中旗": {
                "id": 411,
                "alias": ["科尔沁"]
            },
            "扎赉特旗": {
                "id": 412,
                "alias": ["扎赉特"]
            },
            "突泉县": {
                "id": 413,
                "alias": ["突泉"]
            }
        },
        "锡林郭勒盟": {
            "id": 35,
            "alias": ["锡林郭勒"],
            "二连浩特市": {
                "id": 414,
                "alias": ["二连浩特"]
            },
            "districts": ["二连浩特市", "锡林浩特市", "阿巴嘎旗", "苏尼特左旗", "苏尼特右旗", "东乌珠穆沁旗", "西乌珠穆沁旗", "太仆寺旗", "镶黄旗", "正镶白旗", "正蓝旗", "多伦县", "乌拉盖管委会"],
            "锡林浩特市": {
                "id": 415,
                "alias": ["锡林浩特"]
            },
            "阿巴嘎旗": {
                "id": 416,
                "alias": ["阿巴嘎"]
            },
            "苏尼特左旗": {
                "id": 417,
                "alias": ["苏尼特"]
            },
            "苏尼特右旗": {
                "id": 418,
                "alias": ["苏尼特"]
            },
            "东乌珠穆沁旗": {
                "id": 419,
                "alias": ["东乌珠穆沁"]
            },
            "西乌珠穆沁旗": {
                "id": 420,
                "alias": ["西乌珠穆沁"]
            },
            "太仆寺旗": {
                "id": 421,
                "alias": ["太仆寺"]
            },
            "镶黄旗": {
                "id": 422,
                "alias": ["镶黄"]
            },
            "正镶白旗": {
                "id": 423,
                "alias": ["正镶白"]
            },
            "正蓝旗": {
                "id": 424,
                "alias": ["正蓝"]
            },
            "多伦县": {
                "id": 425,
                "alias": ["多伦"]
            },
            "乌拉盖管委会": {
                "id": 2879,
                "alias": []
            }
        },
        "阿拉善盟": {
            "id": 36,
            "alias": ["阿拉善"],
            "阿拉善左旗": {
                "id": 426,
                "alias": ["阿拉善"]
            },
            "districts": ["阿拉善左旗", "阿拉善右旗", "额济纳旗", "内蒙古阿拉善经济开发区"],
            "阿拉善右旗": {
                "id": 427,
                "alias": ["阿拉善"]
            },
            "额济纳旗": {
                "id": 428,
                "alias": ["额济纳"]
            },
            "内蒙古阿拉善经济开发区": {
                "id": 2880,
                "alias": ["内蒙古阿拉善经济开发"]
            }
        }
    },
    "辽宁省": {
        "alias": ["辽宁"],
        "id": 6,
        "cities": ["沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"],
        "沈阳市": {
            "id": 37,
            "alias": ["沈阳"],
            "和平区": {
                "id": 429,
                "alias": ["和平"]
            },
            "districts": ["和平区", "沈河区", "大东区", "皇姑区", "铁西区", "苏家屯区", "于洪区", "辽中区", "康平县", "法库县", "新民市", "浑南区", "沈北新区"],
            "沈河区": {
                "id": 430,
                "alias": ["沈河"]
            },
            "大东区": {
                "id": 431,
                "alias": ["大东"]
            },
            "皇姑区": {
                "id": 432,
                "alias": ["皇姑"]
            },
            "铁西区": {
                "id": 433,
                "alias": ["铁西"]
            },
            "苏家屯区": {
                "id": 434,
                "alias": ["苏家屯"]
            },
            "于洪区": {
                "id": 437,
                "alias": ["于洪"]
            },
            "辽中区": {
                "id": 438,
                "alias": ["辽中"]
            },
            "康平县": {
                "id": 439,
                "alias": ["康平"]
            },
            "法库县": {
                "id": 440,
                "alias": ["法库"]
            },
            "新民市": {
                "id": 441,
                "alias": ["新民"]
            },
            "浑南区": {
                "id": 3550,
                "alias": ["浑南"]
            },
            "沈北新区": {
                "id": 3551,
                "alias": ["沈北"]
            }
        },
        "大连市": {
            "id": 38,
            "alias": ["大连"],
            "中山区": {
                "id": 442,
                "alias": ["中山"]
            },
            "districts": ["中山区", "西岗区", "沙河口区", "甘井子区", "旅顺口区", "金州区", "长海县", "瓦房店市", "普兰店区", "庄河市"],
            "西岗区": {
                "id": 443,
                "alias": ["西岗"]
            },
            "沙河口区": {
                "id": 444,
                "alias": ["沙河口"]
            },
            "甘井子区": {
                "id": 445,
                "alias": ["甘井子"]
            },
            "旅顺口区": {
                "id": 446,
                "alias": ["旅顺口"]
            },
            "金州区": {
                "id": 447,
                "alias": ["金州"]
            },
            "长海县": {
                "id": 448,
                "alias": ["长海"]
            },
            "瓦房店市": {
                "id": 449,
                "alias": ["瓦房店"]
            },
            "普兰店区": {
                "id": 450,
                "alias": ["普兰店"]
            },
            "庄河市": {
                "id": 451,
                "alias": ["庄河"]
            }
        },
        "鞍山市": {
            "id": 39,
            "alias": ["鞍山"],
            "铁东区": {
                "id": 452,
                "alias": ["铁东"]
            },
            "districts": ["铁东区", "铁西区", "立山区", "千山区", "台安县", "岫岩满族自治县", "海城市"],
            "铁西区": {
                "id": 453,
                "alias": ["铁西"]
            },
            "立山区": {
                "id": 454,
                "alias": ["立山"]
            },
            "千山区": {
                "id": 455,
                "alias": ["千山"]
            },
            "台安县": {
                "id": 456,
                "alias": ["台安"]
            },
            "岫岩满族自治县": {
                "id": 457,
                "alias": ["岫岩"]
            },
            "海城市": {
                "id": 458,
                "alias": ["海城"]
            }
        },
        "抚顺市": {
            "id": 40,
            "alias": ["抚顺"],
            "新抚区": {
                "id": 459,
                "alias": ["新抚"]
            },
            "districts": ["新抚区", "东洲区", "望花区", "顺城区", "抚顺县", "新宾满族自治县", "清原满族自治县"],
            "东洲区": {
                "id": 460,
                "alias": ["东洲"]
            },
            "望花区": {
                "id": 461,
                "alias": ["望花"]
            },
            "顺城区": {
                "id": 462,
                "alias": ["顺城"]
            },
            "抚顺县": {
                "id": 463,
                "alias": ["抚顺"]
            },
            "新宾满族自治县": {
                "id": 464,
                "alias": ["新宾"]
            },
            "清原满族自治县": {
                "id": 465,
                "alias": ["清原"]
            }
        },
        "本溪市": {
            "id": 41,
            "alias": ["本溪"],
            "平山区": {
                "id": 466,
                "alias": ["平山"]
            },
            "districts": ["平山区", "溪湖区", "明山区", "南芬区", "本溪满族自治县", "桓仁满族自治县"],
            "溪湖区": {
                "id": 467,
                "alias": ["溪湖"]
            },
            "明山区": {
                "id": 468,
                "alias": ["明山"]
            },
            "南芬区": {
                "id": 469,
                "alias": ["南芬"]
            },
            "本溪满族自治县": {
                "id": 470,
                "alias": ["本溪"]
            },
            "桓仁满族自治县": {
                "id": 471,
                "alias": ["桓仁"]
            }
        },
        "丹东市": {
            "id": 42,
            "alias": ["丹东"],
            "元宝区": {
                "id": 472,
                "alias": ["元宝"]
            },
            "districts": ["元宝区", "振兴区", "振安区", "宽甸满族自治县", "东港市", "凤城市"],
            "振兴区": {
                "id": 473,
                "alias": ["振兴"]
            },
            "振安区": {
                "id": 474,
                "alias": ["振安"]
            },
            "宽甸满族自治县": {
                "id": 475,
                "alias": ["宽甸"]
            },
            "东港市": {
                "id": 476,
                "alias": ["东港"]
            },
            "凤城市": {
                "id": 477,
                "alias": ["凤城"]
            }
        },
        "锦州市": {
            "id": 43,
            "alias": ["锦州"],
            "古塔区": {
                "id": 478,
                "alias": ["古塔"]
            },
            "districts": ["古塔区", "凌河区", "太和区", "黑山县", "义县", "凌海市", "北镇市"],
            "凌河区": {
                "id": 479,
                "alias": ["凌河"]
            },
            "太和区": {
                "id": 480,
                "alias": ["太和"]
            },
            "黑山县": {
                "id": 481,
                "alias": ["黑山"]
            },
            "义县": {
                "id": 482,
                "alias": []
            },
            "凌海市": {
                "id": 483,
                "alias": ["凌海"]
            },
            "北镇市": {
                "id": 3552,
                "alias": ["北镇"]
            }
        },
        "营口市": {
            "id": 44,
            "alias": ["营口"],
            "站前区": {
                "id": 485,
                "alias": ["站前"]
            },
            "districts": ["站前区", "西市区", "鲅鱼圈区", "老边区", "盖州市", "大石桥市"],
            "西市区": {
                "id": 486,
                "alias": ["西市"]
            },
            "鲅鱼圈区": {
                "id": 487,
                "alias": ["鲅鱼圈"]
            },
            "老边区": {
                "id": 488,
                "alias": ["老边"]
            },
            "盖州市": {
                "id": 489,
                "alias": ["盖州"]
            },
            "大石桥市": {
                "id": 490,
                "alias": ["大石桥"]
            }
        },
        "阜新市": {
            "id": 45,
            "alias": ["阜新"],
            "海州区": {
                "id": 491,
                "alias": ["海州"]
            },
            "districts": ["海州区", "新邱区", "太平区", "清河门区", "细河区", "阜新蒙古族自治县", "彰武县"],
            "新邱区": {
                "id": 492,
                "alias": ["新邱"]
            },
            "太平区": {
                "id": 493,
                "alias": ["太平"]
            },
            "清河门区": {
                "id": 494,
                "alias": ["清河门"]
            },
            "细河区": {
                "id": 495,
                "alias": ["细河"]
            },
            "阜新蒙古族自治县": {
                "id": 496,
                "alias": ["阜新"]
            },
            "彰武县": {
                "id": 497,
                "alias": ["彰武"]
            }
        },
        "辽阳市": {
            "id": 46,
            "alias": ["辽阳"],
            "白塔区": {
                "id": 498,
                "alias": ["白塔"]
            },
            "districts": ["白塔区", "文圣区", "宏伟区", "弓长岭区", "太子河区", "辽阳县", "灯塔市"],
            "文圣区": {
                "id": 499,
                "alias": ["文圣"]
            },
            "宏伟区": {
                "id": 500,
                "alias": ["宏伟"]
            },
            "弓长岭区": {
                "id": 501,
                "alias": ["弓长岭"]
            },
            "太子河区": {
                "id": 502,
                "alias": ["太子河"]
            },
            "辽阳县": {
                "id": 503,
                "alias": ["辽阳"]
            },
            "灯塔市": {
                "id": 504,
                "alias": ["灯塔"]
            }
        },
        "盘锦市": {
            "id": 47,
            "alias": ["盘锦"],
            "双台子区": {
                "id": 505,
                "alias": ["双台子"]
            },
            "districts": ["双台子区", "兴隆台区", "大洼区", "盘山县"],
            "兴隆台区": {
                "id": 506,
                "alias": ["兴隆台"]
            },
            "大洼区": {
                "id": 507,
                "alias": ["大洼"]
            },
            "盘山县": {
                "id": 508,
                "alias": ["盘山"]
            }
        },
        "铁岭市": {
            "id": 48,
            "alias": ["铁岭"],
            "银州区": {
                "id": 509,
                "alias": ["银州"]
            },
            "districts": ["银州区", "清河区", "铁岭县", "西丰县", "昌图县", "调兵山市", "开原市"],
            "清河区": {
                "id": 510,
                "alias": ["清河"]
            },
            "铁岭县": {
                "id": 511,
                "alias": ["铁岭"]
            },
            "西丰县": {
                "id": 512,
                "alias": ["西丰"]
            },
            "昌图县": {
                "id": 513,
                "alias": ["昌图"]
            },
            "调兵山市": {
                "id": 514,
                "alias": ["调兵山"]
            },
            "开原市": {
                "id": 515,
                "alias": ["开原"]
            }
        },
        "朝阳市": {
            "id": 49,
            "alias": ["朝阳"],
            "双塔区": {
                "id": 516,
                "alias": ["双塔"]
            },
            "districts": ["双塔区", "龙城区", "朝阳县", "建平县", "喀喇沁左翼蒙古族自治县", "北票市", "凌源市"],
            "龙城区": {
                "id": 517,
                "alias": ["龙城"]
            },
            "朝阳县": {
                "id": 518,
                "alias": ["朝阳"]
            },
            "建平县": {
                "id": 519,
                "alias": ["建平"]
            },
            "喀喇沁左翼蒙古族自治县": {
                "id": 520,
                "alias": ["喀喇沁左翼"]
            },
            "北票市": {
                "id": 521,
                "alias": ["北票"]
            },
            "凌源市": {
                "id": 522,
                "alias": ["凌源"]
            }
        },
        "葫芦岛市": {
            "id": 50,
            "alias": ["葫芦岛"],
            "连山区": {
                "id": 523,
                "alias": ["连山"]
            },
            "districts": ["连山区", "龙港区", "南票区", "绥中县", "建昌县", "兴城市"],
            "龙港区": {
                "id": 524,
                "alias": ["龙港"]
            },
            "南票区": {
                "id": 525,
                "alias": ["南票"]
            },
            "绥中县": {
                "id": 526,
                "alias": ["绥中"]
            },
            "建昌县": {
                "id": 527,
                "alias": ["建昌"]
            },
            "兴城市": {
                "id": 528,
                "alias": ["兴城"]
            }
        }
    },
    "吉林省": {
        "alias": ["吉林"],
        "id": 7,
        "cities": ["长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "延边朝鲜族自治州"],
        "长春市": {
            "id": 51,
            "alias": ["长春"],
            "南关区": {
                "id": 529,
                "alias": ["南关"]
            },
            "districts": ["南关区", "宽城区", "朝阳区", "二道区", "绿园区", "双阳区", "农安县", "九台区", "榆树市", "德惠市", "长春经济技术开发区", "长春净月高新技术产业开发区", "长春高新技术产业开发区", "长春汽车经济技术开发区"],
            "宽城区": {
                "id": 530,
                "alias": ["宽城"]
            },
            "朝阳区": {
                "id": 531,
                "alias": ["朝阳"]
            },
            "二道区": {
                "id": 532,
                "alias": ["二道"]
            },
            "绿园区": {
                "id": 533,
                "alias": ["绿园"]
            },
            "双阳区": {
                "id": 534,
                "alias": ["双阳"]
            },
            "农安县": {
                "id": 535,
                "alias": ["农安"]
            },
            "九台区": {
                "id": 536,
                "alias": ["九台"]
            },
            "榆树市": {
                "id": 537,
                "alias": ["榆树"]
            },
            "德惠市": {
                "id": 538,
                "alias": ["德惠"]
            },
            "长春经济技术开发区": {
                "id": 3251,
                "alias": ["长春经济技术开发"]
            },
            "长春净月高新技术产业开发区": {
                "id": 3252,
                "alias": ["长春净月高新技术产业开发"]
            },
            "长春高新技术产业开发区": {
                "id": 3253,
                "alias": ["长春高新技术产业开发"]
            },
            "长春汽车经济技术开发区": {
                "id": 3254,
                "alias": ["长春汽车经济技术开发"]
            }
        },
        "吉林市": {
            "id": 52,
            "alias": ["吉林"],
            "昌邑区": {
                "id": 539,
                "alias": ["昌邑"]
            },
            "districts": ["昌邑区", "龙潭区", "船营区", "丰满区", "永吉县", "蛟河市", "桦甸市", "舒兰市", "磐石市", "吉林经济开发区", "吉林高新技术产业开发区", "吉林中国新加坡食品区"],
            "龙潭区": {
                "id": 540,
                "alias": ["龙潭"]
            },
            "船营区": {
                "id": 541,
                "alias": ["船营"]
            },
            "丰满区": {
                "id": 542,
                "alias": ["丰满"]
            },
            "永吉县": {
                "id": 543,
                "alias": ["永吉"]
            },
            "蛟河市": {
                "id": 544,
                "alias": ["蛟河"]
            },
            "桦甸市": {
                "id": 545,
                "alias": ["桦甸"]
            },
            "舒兰市": {
                "id": 546,
                "alias": ["舒兰"]
            },
            "磐石市": {
                "id": 547,
                "alias": ["磐石"]
            },
            "吉林经济开发区": {
                "id": 3255,
                "alias": ["吉林经济开发"]
            },
            "吉林高新技术产业开发区": {
                "id": 3256,
                "alias": ["吉林高新技术产业开发"]
            },
            "吉林中国新加坡食品区": {
                "id": 3257,
                "alias": ["吉林中国新加坡食品"]
            }
        },
        "四平市": {
            "id": 53,
            "alias": ["四平"],
            "铁西区": {
                "id": 548,
                "alias": ["铁西"]
            },
            "districts": ["铁西区", "铁东区", "梨树县", "伊通满族自治县", "公主岭市", "双辽市"],
            "铁东区": {
                "id": 549,
                "alias": ["铁东"]
            },
            "梨树县": {
                "id": 550,
                "alias": ["梨树"]
            },
            "伊通满族自治县": {
                "id": 551,
                "alias": ["伊通"]
            },
            "公主岭市": {
                "id": 552,
                "alias": ["公主岭"]
            },
            "双辽市": {
                "id": 553,
                "alias": ["双辽"]
            }
        },
        "辽源市": {
            "id": 54,
            "alias": ["辽源"],
            "龙山区": {
                "id": 554,
                "alias": ["龙山"]
            },
            "districts": ["龙山区", "西安区", "东丰县", "东辽县"],
            "西安区": {
                "id": 555,
                "alias": ["西安"]
            },
            "东丰县": {
                "id": 556,
                "alias": ["东丰"]
            },
            "东辽县": {
                "id": 557,
                "alias": ["东辽"]
            }
        },
        "通化市": {
            "id": 55,
            "alias": ["通化"],
            "东昌区": {
                "id": 558,
                "alias": ["东昌"]
            },
            "districts": ["东昌区", "二道江区", "通化县", "辉南县", "柳河县", "梅河口市", "集安市"],
            "二道江区": {
                "id": 559,
                "alias": ["二道江"]
            },
            "通化县": {
                "id": 560,
                "alias": ["通化"]
            },
            "辉南县": {
                "id": 561,
                "alias": ["辉南"]
            },
            "柳河县": {
                "id": 562,
                "alias": ["柳河"]
            },
            "梅河口市": {
                "id": 563,
                "alias": ["梅河口"]
            },
            "集安市": {
                "id": 564,
                "alias": ["集安"]
            }
        },
        "白山市": {
            "id": 56,
            "alias": ["白山"],
            "抚松县": {
                "id": 566,
                "alias": ["抚松"]
            },
            "districts": ["抚松县", "靖宇县", "长白朝鲜族自治县", "江源区", "临江市", "浑江区"],
            "靖宇县": {
                "id": 567,
                "alias": ["靖宇"]
            },
            "长白朝鲜族自治县": {
                "id": 568,
                "alias": ["长白"]
            },
            "江源区": {
                "id": 569,
                "alias": ["江源"]
            },
            "临江市": {
                "id": 570,
                "alias": ["临江"]
            },
            "浑江区": {
                "id": 3258,
                "alias": ["浑江"]
            }
        },
        "松原市": {
            "id": 57,
            "alias": ["松原"],
            "宁江区": {
                "id": 571,
                "alias": ["宁江"]
            },
            "districts": ["宁江区", "前郭尔罗斯蒙古族自治县", "长岭县", "乾安县", "扶余市", "吉林松原经济开发区"],
            "前郭尔罗斯蒙古族自治县": {
                "id": 572,
                "alias": ["前郭尔罗斯"]
            },
            "长岭县": {
                "id": 573,
                "alias": ["长岭"]
            },
            "乾安县": {
                "id": 574,
                "alias": ["乾安"]
            },
            "扶余市": {
                "id": 575,
                "alias": ["扶余"]
            },
            "吉林松原经济开发区": {
                "id": 3259,
                "alias": ["吉林松原经济开发"]
            }
        },
        "白城市": {
            "id": 58,
            "alias": ["白城"],
            "洮北区": {
                "id": 576,
                "alias": ["洮北"]
            },
            "districts": ["洮北区", "镇赉县", "通榆县", "洮南市", "大安市", "吉林白城经济开发区"],
            "镇赉县": {
                "id": 577,
                "alias": ["镇赉"]
            },
            "通榆县": {
                "id": 578,
                "alias": ["通榆"]
            },
            "洮南市": {
                "id": 579,
                "alias": ["洮南"]
            },
            "大安市": {
                "id": 580,
                "alias": ["大安"]
            },
            "吉林白城经济开发区": {
                "id": 3260,
                "alias": ["吉林白城经济开发"]
            }
        },
        "延边朝鲜族自治州": {
            "id": 59,
            "alias": ["延边"],
            "延吉市": {
                "id": 581,
                "alias": ["延吉"]
            },
            "districts": ["延吉市", "图们市", "敦化市", "珲春市", "龙井市", "和龙市", "汪清县", "安图县"],
            "图们市": {
                "id": 582,
                "alias": ["图们"]
            },
            "敦化市": {
                "id": 583,
                "alias": ["敦化"]
            },
            "珲春市": {
                "id": 584,
                "alias": ["珲春"]
            },
            "龙井市": {
                "id": 585,
                "alias": ["龙井"]
            },
            "和龙市": {
                "id": 586,
                "alias": ["和龙"]
            },
            "汪清县": {
                "id": 587,
                "alias": ["汪清"]
            },
            "安图县": {
                "id": 588,
                "alias": ["安图"]
            }
        }
    },
    "黑龙江省": {
        "alias": ["黑龙江"],
        "id": 8,
        "cities": ["哈尔滨市", "齐齐哈尔市", "鸡西市", "鹤岗市", "双鸭山市", "大庆市", "伊春市", "佳木斯市", "七台河市", "牡丹江市", "黑河市", "绥化市", "大兴安岭地区"],
        "哈尔滨市": {
            "id": 60,
            "alias": ["哈尔滨"],
            "道里区": {
                "id": 589,
                "alias": ["道里"]
            },
            "districts": ["道里区", "南岗区", "道外区", "香坊区", "平房区", "松北区", "呼兰区", "依兰县", "方正县", "宾县", "巴彦县", "木兰县", "通河县", "延寿县", "阿城区", "双城区", "尚志市", "五常市"],
            "南岗区": {
                "id": 590,
                "alias": ["南岗"]
            },
            "道外区": {
                "id": 591,
                "alias": ["道外"]
            },
            "香坊区": {
                "id": 592,
                "alias": ["香坊"]
            },
            "平房区": {
                "id": 594,
                "alias": ["平房"]
            },
            "松北区": {
                "id": 595,
                "alias": ["松北"]
            },
            "呼兰区": {
                "id": 596,
                "alias": ["呼兰"]
            },
            "依兰县": {
                "id": 597,
                "alias": ["依兰"]
            },
            "方正县": {
                "id": 598,
                "alias": ["方正"]
            },
            "宾县": {
                "id": 599,
                "alias": []
            },
            "巴彦县": {
                "id": 600,
                "alias": ["巴彦"]
            },
            "木兰县": {
                "id": 601,
                "alias": ["木兰"]
            },
            "通河县": {
                "id": 602,
                "alias": ["通河"]
            },
            "延寿县": {
                "id": 603,
                "alias": ["延寿"]
            },
            "阿城区": {
                "id": 604,
                "alias": ["阿城"]
            },
            "双城区": {
                "id": 605,
                "alias": ["双城"]
            },
            "尚志市": {
                "id": 606,
                "alias": ["尚志"]
            },
            "五常市": {
                "id": 607,
                "alias": ["五常"]
            }
        },
        "齐齐哈尔市": {
            "id": 61,
            "alias": ["齐齐哈尔"],
            "龙沙区": {
                "id": 608,
                "alias": ["龙沙"]
            },
            "districts": ["龙沙区", "建华区", "铁锋区", "昂昂溪区", "富拉尔基区", "碾子山区", "梅里斯达斡尔族区", "龙江县", "依安县", "泰来县", "甘南县", "富裕县", "克山县", "克东县", "拜泉县", "讷河市"],
            "建华区": {
                "id": 609,
                "alias": ["建华"]
            },
            "铁锋区": {
                "id": 610,
                "alias": ["铁锋"]
            },
            "昂昂溪区": {
                "id": 611,
                "alias": ["昂昂溪"]
            },
            "富拉尔基区": {
                "id": 612,
                "alias": ["富拉尔基"]
            },
            "碾子山区": {
                "id": 613,
                "alias": ["碾子山"]
            },
            "梅里斯达斡尔族区": {
                "id": 614,
                "alias": ["梅里斯达斡尔族"]
            },
            "龙江县": {
                "id": 615,
                "alias": ["龙江"]
            },
            "依安县": {
                "id": 616,
                "alias": ["依安"]
            },
            "泰来县": {
                "id": 617,
                "alias": ["泰来"]
            },
            "甘南县": {
                "id": 618,
                "alias": ["甘南"]
            },
            "富裕县": {
                "id": 619,
                "alias": ["富裕"]
            },
            "克山县": {
                "id": 620,
                "alias": ["克山"]
            },
            "克东县": {
                "id": 621,
                "alias": ["克东"]
            },
            "拜泉县": {
                "id": 622,
                "alias": ["拜泉"]
            },
            "讷河市": {
                "id": 623,
                "alias": ["讷河"]
            }
        },
        "鸡西市": {
            "id": 62,
            "alias": ["鸡西"],
            "鸡冠区": {
                "id": 624,
                "alias": ["鸡冠"]
            },
            "districts": ["鸡冠区", "恒山区", "滴道区", "梨树区", "城子河区", "麻山区", "鸡东县", "虎林市", "密山市"],
            "恒山区": {
                "id": 625,
                "alias": ["恒山"]
            },
            "滴道区": {
                "id": 626,
                "alias": ["滴道"]
            },
            "梨树区": {
                "id": 627,
                "alias": ["梨树"]
            },
            "城子河区": {
                "id": 628,
                "alias": ["城子河"]
            },
            "麻山区": {
                "id": 629,
                "alias": ["麻山"]
            },
            "鸡东县": {
                "id": 630,
                "alias": ["鸡东"]
            },
            "虎林市": {
                "id": 631,
                "alias": ["虎林"]
            },
            "密山市": {
                "id": 632,
                "alias": ["密山"]
            }
        },
        "鹤岗市": {
            "id": 63,
            "alias": ["鹤岗"],
            "向阳区": {
                "id": 633,
                "alias": ["向阳"]
            },
            "districts": ["向阳区", "工农区", "南山区", "兴安区", "东山区", "兴山区", "萝北县", "绥滨县"],
            "工农区": {
                "id": 634,
                "alias": ["工农"]
            },
            "南山区": {
                "id": 635,
                "alias": ["南山"]
            },
            "兴安区": {
                "id": 636,
                "alias": ["兴安"]
            },
            "东山区": {
                "id": 637,
                "alias": ["东山"]
            },
            "兴山区": {
                "id": 638,
                "alias": ["兴山"]
            },
            "萝北县": {
                "id": 639,
                "alias": ["萝北"]
            },
            "绥滨县": {
                "id": 640,
                "alias": ["绥滨"]
            }
        },
        "双鸭山市": {
            "id": 64,
            "alias": ["双鸭山"],
            "尖山区": {
                "id": 641,
                "alias": ["尖山"]
            },
            "districts": ["尖山区", "岭东区", "四方台区", "宝山区", "集贤县", "友谊县", "宝清县", "饶河县"],
            "岭东区": {
                "id": 642,
                "alias": ["岭东"]
            },
            "四方台区": {
                "id": 643,
                "alias": ["四方台"]
            },
            "宝山区": {
                "id": 644,
                "alias": ["宝山"]
            },
            "集贤县": {
                "id": 645,
                "alias": ["集贤"]
            },
            "友谊县": {
                "id": 646,
                "alias": ["友谊"]
            },
            "宝清县": {
                "id": 647,
                "alias": ["宝清"]
            },
            "饶河县": {
                "id": 648,
                "alias": ["饶河"]
            }
        },
        "大庆市": {
            "id": 65,
            "alias": ["大庆"],
            "萨尔图区": {
                "id": 649,
                "alias": ["萨尔图"]
            },
            "districts": ["萨尔图区", "龙凤区", "让胡路区", "红岗区", "大同区", "肇州县", "肇源县", "林甸县", "杜尔伯特蒙古族自治县", "大庆高新技术产业开发区"],
            "龙凤区": {
                "id": 650,
                "alias": ["龙凤"]
            },
            "让胡路区": {
                "id": 651,
                "alias": ["让胡路"]
            },
            "红岗区": {
                "id": 652,
                "alias": ["红岗"]
            },
            "大同区": {
                "id": 653,
                "alias": ["大同"]
            },
            "肇州县": {
                "id": 654,
                "alias": ["肇州"]
            },
            "肇源县": {
                "id": 655,
                "alias": ["肇源"]
            },
            "林甸县": {
                "id": 656,
                "alias": ["林甸"]
            },
            "杜尔伯特蒙古族自治县": {
                "id": 657,
                "alias": ["杜尔伯特"]
            },
            "大庆高新技术产业开发区": {
                "id": 3579,
                "alias": ["大庆高新技术产业开发"]
            }
        },
        "伊春市": {
            "id": 66,
            "alias": ["伊春"],
            "伊春区": {
                "id": 658,
                "alias": ["伊春"]
            },
            "districts": ["伊春区", "南岔区", "友好区", "西林区", "翠峦区", "新青区", "美溪区", "金山屯区", "五营区", "乌马河区", "汤旺河区", "带岭区", "乌伊岭区", "红星区", "上甘岭区", "嘉荫县", "铁力市"],
            "南岔区": {
                "id": 659,
                "alias": ["南岔"]
            },
            "友好区": {
                "id": 660,
                "alias": ["友好"]
            },
            "西林区": {
                "id": 661,
                "alias": ["西林"]
            },
            "翠峦区": {
                "id": 662,
                "alias": ["翠峦"]
            },
            "新青区": {
                "id": 663,
                "alias": ["新青"]
            },
            "美溪区": {
                "id": 664,
                "alias": ["美溪"]
            },
            "金山屯区": {
                "id": 665,
                "alias": ["金山屯"]
            },
            "五营区": {
                "id": 666,
                "alias": ["五营"]
            },
            "乌马河区": {
                "id": 667,
                "alias": ["乌马河"]
            },
            "汤旺河区": {
                "id": 668,
                "alias": ["汤旺河"]
            },
            "带岭区": {
                "id": 669,
                "alias": ["带岭"]
            },
            "乌伊岭区": {
                "id": 670,
                "alias": ["乌伊岭"]
            },
            "红星区": {
                "id": 671,
                "alias": ["红星"]
            },
            "上甘岭区": {
                "id": 672,
                "alias": ["上甘岭"]
            },
            "嘉荫县": {
                "id": 673,
                "alias": ["嘉荫"]
            },
            "铁力市": {
                "id": 674,
                "alias": ["铁力"]
            }
        },
        "佳木斯市": {
            "id": 67,
            "alias": ["佳木斯"],
            "向阳区": {
                "id": 676,
                "alias": ["向阳"]
            },
            "districts": ["向阳区", "前进区", "东风区", "郊区", "桦南县", "桦川县", "汤原县", "抚远市", "同江市", "富锦市"],
            "前进区": {
                "id": 677,
                "alias": ["前进"]
            },
            "东风区": {
                "id": 678,
                "alias": ["东风"]
            },
            "郊区": {
                "id": 679,
                "alias": []
            },
            "桦南县": {
                "id": 680,
                "alias": ["桦南"]
            },
            "桦川县": {
                "id": 681,
                "alias": ["桦川"]
            },
            "汤原县": {
                "id": 682,
                "alias": ["汤原"]
            },
            "抚远市": {
                "id": 683,
                "alias": ["抚远"]
            },
            "同江市": {
                "id": 684,
                "alias": ["同江"]
            },
            "富锦市": {
                "id": 685,
                "alias": ["富锦"]
            }
        },
        "七台河市": {
            "id": 68,
            "alias": ["七台河"],
            "新兴区": {
                "id": 686,
                "alias": ["新兴"]
            },
            "districts": ["新兴区", "桃山区", "茄子河区", "勃利县"],
            "桃山区": {
                "id": 687,
                "alias": ["桃山"]
            },
            "茄子河区": {
                "id": 688,
                "alias": ["茄子河"]
            },
            "勃利县": {
                "id": 689,
                "alias": ["勃利"]
            }
        },
        "牡丹江市": {
            "id": 69,
            "alias": ["牡丹江"],
            "东安区": {
                "id": 690,
                "alias": ["东安"]
            },
            "districts": ["东安区", "阳明区", "爱民区", "西安区", "东宁市", "林口县", "绥芬河市", "海林市", "宁安市", "穆棱市", "牡丹江经济技术开发区"],
            "阳明区": {
                "id": 691,
                "alias": ["阳明"]
            },
            "爱民区": {
                "id": 692,
                "alias": ["爱民"]
            },
            "西安区": {
                "id": 693,
                "alias": ["西安"]
            },
            "东宁市": {
                "id": 694,
                "alias": ["东宁"]
            },
            "林口县": {
                "id": 695,
                "alias": ["林口"]
            },
            "绥芬河市": {
                "id": 696,
                "alias": ["绥芬河"]
            },
            "海林市": {
                "id": 697,
                "alias": ["海林"]
            },
            "宁安市": {
                "id": 698,
                "alias": ["宁安"]
            },
            "穆棱市": {
                "id": 699,
                "alias": ["穆棱"]
            },
            "牡丹江经济技术开发区": {
                "id": 3580,
                "alias": ["牡丹江经济技术开发"]
            }
        },
        "黑河市": {
            "id": 70,
            "alias": ["黑河"],
            "爱辉区": {
                "id": 700,
                "alias": ["爱辉"]
            },
            "districts": ["爱辉区", "嫩江县", "逊克县", "孙吴县", "北安市", "五大连池市"],
            "嫩江县": {
                "id": 701,
                "alias": ["嫩江"]
            },
            "逊克县": {
                "id": 702,
                "alias": ["逊克"]
            },
            "孙吴县": {
                "id": 703,
                "alias": ["孙吴"]
            },
            "北安市": {
                "id": 704,
                "alias": ["北安"]
            },
            "五大连池市": {
                "id": 705,
                "alias": ["五大连池"]
            }
        },
        "绥化市": {
            "id": 71,
            "alias": ["绥化"],
            "北林区": {
                "id": 706,
                "alias": ["北林"]
            },
            "districts": ["北林区", "望奎县", "兰西县", "青冈县", "庆安县", "明水县", "绥棱县", "安达市", "肇东市", "海伦市"],
            "望奎县": {
                "id": 707,
                "alias": ["望奎"]
            },
            "兰西县": {
                "id": 708,
                "alias": ["兰西"]
            },
            "青冈县": {
                "id": 709,
                "alias": ["青冈"]
            },
            "庆安县": {
                "id": 710,
                "alias": ["庆安"]
            },
            "明水县": {
                "id": 711,
                "alias": ["明水"]
            },
            "绥棱县": {
                "id": 712,
                "alias": ["绥棱"]
            },
            "安达市": {
                "id": 713,
                "alias": ["安达"]
            },
            "肇东市": {
                "id": 714,
                "alias": ["肇东"]
            },
            "海伦市": {
                "id": 715,
                "alias": ["海伦"]
            }
        },
        "大兴安岭地区": {
            "id": 72,
            "alias": ["大兴安岭"],
            "呼玛县": {
                "id": 716,
                "alias": ["呼玛"]
            },
            "districts": ["呼玛县", "塔河县", "漠河县", "加格达奇区", "松岭区", "新林区", "呼中区"],
            "塔河县": {
                "id": 717,
                "alias": ["塔河"]
            },
            "漠河县": {
                "id": 718,
                "alias": ["漠河"]
            },
            "加格达奇区": {
                "id": 3581,
                "alias": ["加格达奇"]
            },
            "松岭区": {
                "id": 3582,
                "alias": ["松岭"]
            },
            "新林区": {
                "id": 3583,
                "alias": ["新林"]
            },
            "呼中区": {
                "id": 3584,
                "alias": ["呼中"]
            }
        }
    },
    "上海市": {
        "alias": ["上海"],
        "id": 9,
        "cities": ["上海市"],
        "上海市": {
            "id": 73,
            "alias": ["上海"],
            "黄浦区": {
                "id": 719,
                "alias": ["黄浦"]
            },
            "districts": ["黄浦区", "徐汇区", "长宁区", "静安区", "普陀区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "奉贤区", "崇明区"],
            "徐汇区": {
                "id": 721,
                "alias": ["徐汇"]
            },
            "长宁区": {
                "id": 722,
                "alias": ["长宁"]
            },
            "静安区": {
                "id": 723,
                "alias": ["静安"]
            },
            "普陀区": {
                "id": 724,
                "alias": ["普陀"]
            },
            "虹口区": {
                "id": 726,
                "alias": ["虹口"]
            },
            "杨浦区": {
                "id": 727,
                "alias": ["杨浦"]
            },
            "闵行区": {
                "id": 728,
                "alias": ["闵行"]
            },
            "宝山区": {
                "id": 729,
                "alias": ["宝山"]
            },
            "嘉定区": {
                "id": 730,
                "alias": ["嘉定"]
            },
            "浦东新区": {
                "id": 731,
                "alias": ["浦东"]
            },
            "金山区": {
                "id": 732,
                "alias": ["金山"]
            },
            "松江区": {
                "id": 733,
                "alias": ["松江"]
            },
            "青浦区": {
                "id": 734,
                "alias": ["青浦"]
            },
            "奉贤区": {
                "id": 736,
                "alias": ["奉贤"]
            },
            "崇明区": {
                "id": 737,
                "alias": ["崇明"]
            }
        }
    },
    "江苏省": {
        "alias": ["江苏"],
        "id": 10,
        "cities": ["南京市", "无锡市", "徐州市", "常州市", "苏州市", "南通市", "连云港市", "淮安市", "盐城市", "扬州市", "镇江市", "泰州市", "宿迁市"],
        "南京市": {
            "id": 74,
            "alias": ["南京"],
            "玄武区": {
                "id": 738,
                "alias": ["玄武"]
            },
            "districts": ["玄武区", "秦淮区", "建邺区", "鼓楼区", "浦口区", "栖霞区", "雨花台区", "江宁区", "六合区", "溧水区", "高淳区"],
            "秦淮区": {
                "id": 740,
                "alias": ["秦淮"]
            },
            "建邺区": {
                "id": 741,
                "alias": ["建邺"]
            },
            "鼓楼区": {
                "id": 742,
                "alias": ["鼓楼"]
            },
            "浦口区": {
                "id": 744,
                "alias": ["浦口"]
            },
            "栖霞区": {
                "id": 745,
                "alias": ["栖霞"]
            },
            "雨花台区": {
                "id": 746,
                "alias": ["雨花台"]
            },
            "江宁区": {
                "id": 747,
                "alias": ["江宁"]
            },
            "六合区": {
                "id": 748,
                "alias": ["六合"]
            },
            "溧水区": {
                "id": 749,
                "alias": ["溧水"]
            },
            "高淳区": {
                "id": 750,
                "alias": ["高淳"]
            }
        },
        "无锡市": {
            "id": 75,
            "alias": ["无锡"],
            "北塘区": {
                "id": 753,
                "alias": ["北塘"]
            },
            "districts": ["北塘区", "锡山区", "惠山区", "滨湖区", "江阴市", "宜兴市", "梁溪区", "新吴区"],
            "锡山区": {
                "id": 754,
                "alias": ["锡山"]
            },
            "惠山区": {
                "id": 755,
                "alias": ["惠山"]
            },
            "滨湖区": {
                "id": 756,
                "alias": ["滨湖"]
            },
            "江阴市": {
                "id": 757,
                "alias": ["江阴"]
            },
            "宜兴市": {
                "id": 758,
                "alias": ["宜兴"]
            },
            "梁溪区": {
                "id": 3402,
                "alias": ["梁溪"]
            },
            "新吴区": {
                "id": 3403,
                "alias": ["新吴"]
            }
        },
        "徐州市": {
            "id": 76,
            "alias": ["徐州"],
            "鼓楼区": {
                "id": 759,
                "alias": ["鼓楼"]
            },
            "districts": ["鼓楼区", "云龙区", "贾汪区", "泉山区", "丰县", "沛县", "铜山区", "睢宁县", "新沂市", "邳州市", "徐州经济技术开发区"],
            "云龙区": {
                "id": 760,
                "alias": ["云龙"]
            },
            "贾汪区": {
                "id": 762,
                "alias": ["贾汪"]
            },
            "泉山区": {
                "id": 763,
                "alias": ["泉山"]
            },
            "丰县": {
                "id": 764,
                "alias": []
            },
            "沛县": {
                "id": 765,
                "alias": []
            },
            "铜山区": {
                "id": 766,
                "alias": ["铜山"]
            },
            "睢宁县": {
                "id": 767,
                "alias": ["睢宁"]
            },
            "新沂市": {
                "id": 768,
                "alias": ["新沂"]
            },
            "邳州市": {
                "id": 769,
                "alias": ["邳州"]
            },
            "徐州经济技术开发区": {
                "id": 3404,
                "alias": ["徐州经济技术开发"]
            }
        },
        "常州市": {
            "id": 77,
            "alias": ["常州"],
            "天宁区": {
                "id": 770,
                "alias": ["天宁"]
            },
            "districts": ["天宁区", "钟楼区", "新北区", "武进区", "溧阳市", "金坛区"],
            "钟楼区": {
                "id": 771,
                "alias": ["钟楼"]
            },
            "新北区": {
                "id": 773,
                "alias": ["新北"]
            },
            "武进区": {
                "id": 774,
                "alias": ["武进"]
            },
            "溧阳市": {
                "id": 775,
                "alias": ["溧阳"]
            },
            "金坛区": {
                "id": 776,
                "alias": ["金坛"]
            }
        },
        "苏州市": {
            "id": 78,
            "alias": ["苏州"],
            "虎丘区": {
                "id": 780,
                "alias": ["虎丘"]
            },
            "districts": ["虎丘区", "吴中区", "相城区", "常熟市", "张家港市", "昆山市", "吴江区", "太仓市", "姑苏区", "苏州工业园区"],
            "吴中区": {
                "id": 781,
                "alias": ["吴中"]
            },
            "相城区": {
                "id": 782,
                "alias": ["相城"]
            },
            "常熟市": {
                "id": 783,
                "alias": ["常熟"]
            },
            "张家港市": {
                "id": 784,
                "alias": ["张家港"]
            },
            "昆山市": {
                "id": 785,
                "alias": ["昆山"]
            },
            "吴江区": {
                "id": 786,
                "alias": ["吴江"]
            },
            "太仓市": {
                "id": 787,
                "alias": ["太仓"]
            },
            "姑苏区": {
                "id": 3405,
                "alias": ["姑苏"]
            },
            "苏州工业园区": {
                "id": 3406,
                "alias": ["苏州工业园"]
            }
        },
        "南通市": {
            "id": 79,
            "alias": ["南通"],
            "崇川区": {
                "id": 788,
                "alias": ["崇川"]
            },
            "districts": ["崇川区", "港闸区", "海安县", "如东县", "启东市", "如皋市", "通州区", "海门市", "南通经济技术开发区"],
            "港闸区": {
                "id": 789,
                "alias": ["港闸"]
            },
            "海安县": {
                "id": 790,
                "alias": ["海安"]
            },
            "如东县": {
                "id": 791,
                "alias": ["如东"]
            },
            "启东市": {
                "id": 792,
                "alias": ["启东"]
            },
            "如皋市": {
                "id": 793,
                "alias": ["如皋"]
            },
            "通州区": {
                "id": 794,
                "alias": ["通州"]
            },
            "海门市": {
                "id": 795,
                "alias": ["海门"]
            },
            "南通经济技术开发区": {
                "id": 3407,
                "alias": ["南通经济技术开发"]
            }
        },
        "连云港市": {
            "id": 80,
            "alias": ["连云港"],
            "连云区": {
                "id": 796,
                "alias": ["连云"]
            },
            "districts": ["连云区", "海州区", "赣榆区", "东海县", "灌云县", "灌南县", "连云港经济技术开发区", "连云港高新技术产业开发区"],
            "海州区": {
                "id": 798,
                "alias": ["海州"]
            },
            "赣榆区": {
                "id": 799,
                "alias": ["赣榆"]
            },
            "东海县": {
                "id": 800,
                "alias": ["东海"]
            },
            "灌云县": {
                "id": 801,
                "alias": ["灌云"]
            },
            "灌南县": {
                "id": 802,
                "alias": ["灌南"]
            },
            "连云港经济技术开发区": {
                "id": 3408,
                "alias": ["连云港经济技术开发"]
            },
            "连云港高新技术产业开发区": {
                "id": 3409,
                "alias": ["连云港高新技术产业开发"]
            }
        },
        "淮安市": {
            "id": 81,
            "alias": ["淮安"],
            "淮阴区": {
                "id": 805,
                "alias": ["淮阴"]
            },
            "districts": ["淮阴区", "涟水县", "洪泽区", "盱眙县", "金湖县", "淮安区", "清江浦区", "淮安经济技术开发区"],
            "涟水县": {
                "id": 807,
                "alias": ["涟水"]
            },
            "洪泽区": {
                "id": 808,
                "alias": ["洪泽"]
            },
            "盱眙县": {
                "id": 809,
                "alias": ["盱眙"]
            },
            "金湖县": {
                "id": 810,
                "alias": ["金湖"]
            },
            "淮安区": {
                "id": 3410,
                "alias": ["淮安"]
            },
            "清江浦区": {
                "id": 3411,
                "alias": ["清江浦"]
            },
            "淮安经济技术开发区": {
                "id": 3412,
                "alias": ["淮安经济技术开发"]
            }
        },
        "盐城市": {
            "id": 82,
            "alias": ["盐城"],
            "亭湖区": {
                "id": 811,
                "alias": ["亭湖"]
            },
            "districts": ["亭湖区", "盐都区", "响水县", "滨海县", "阜宁县", "射阳县", "建湖县", "东台市", "大丰区", "盐城经济技术开发区"],
            "盐都区": {
                "id": 812,
                "alias": ["盐都"]
            },
            "响水县": {
                "id": 813,
                "alias": ["响水"]
            },
            "滨海县": {
                "id": 814,
                "alias": ["滨海"]
            },
            "阜宁县": {
                "id": 815,
                "alias": ["阜宁"]
            },
            "射阳县": {
                "id": 816,
                "alias": ["射阳"]
            },
            "建湖县": {
                "id": 817,
                "alias": ["建湖"]
            },
            "东台市": {
                "id": 818,
                "alias": ["东台"]
            },
            "大丰区": {
                "id": 819,
                "alias": ["大丰"]
            },
            "盐城经济技术开发区": {
                "id": 3413,
                "alias": ["盐城经济技术开发"]
            }
        },
        "扬州市": {
            "id": 83,
            "alias": ["扬州"],
            "广陵区": {
                "id": 820,
                "alias": ["广陵"]
            },
            "districts": ["广陵区", "邗江区", "宝应县", "仪征市", "高邮市", "江都区", "扬州经济技术开发区"],
            "邗江区": {
                "id": 821,
                "alias": ["邗江"]
            },
            "宝应县": {
                "id": 823,
                "alias": ["宝应"]
            },
            "仪征市": {
                "id": 824,
                "alias": ["仪征"]
            },
            "高邮市": {
                "id": 825,
                "alias": ["高邮"]
            },
            "江都区": {
                "id": 826,
                "alias": ["江都"]
            },
            "扬州经济技术开发区": {
                "id": 3414,
                "alias": ["扬州经济技术开发"]
            }
        },
        "镇江市": {
            "id": 84,
            "alias": ["镇江"],
            "京口区": {
                "id": 827,
                "alias": ["京口"]
            },
            "districts": ["京口区", "润州区", "丹徒区", "丹阳市", "扬中市", "句容市", "镇江新区"],
            "润州区": {
                "id": 828,
                "alias": ["润州"]
            },
            "丹徒区": {
                "id": 829,
                "alias": ["丹徒"]
            },
            "丹阳市": {
                "id": 830,
                "alias": ["丹阳"]
            },
            "扬中市": {
                "id": 831,
                "alias": ["扬中"]
            },
            "句容市": {
                "id": 832,
                "alias": ["句容"]
            },
            "镇江新区": {
                "id": 3415,
                "alias": ["镇江"]
            }
        },
        "泰州市": {
            "id": 85,
            "alias": ["泰州"],
            "海陵区": {
                "id": 833,
                "alias": ["海陵"]
            },
            "districts": ["海陵区", "高港区", "兴化市", "靖江市", "泰兴市", "姜堰区", "泰州医药高新技术产业开发区"],
            "高港区": {
                "id": 834,
                "alias": ["高港"]
            },
            "兴化市": {
                "id": 835,
                "alias": ["兴化"]
            },
            "靖江市": {
                "id": 836,
                "alias": ["靖江"]
            },
            "泰兴市": {
                "id": 837,
                "alias": ["泰兴"]
            },
            "姜堰区": {
                "id": 838,
                "alias": ["姜堰"]
            },
            "泰州医药高新技术产业开发区": {
                "id": 3416,
                "alias": ["泰州医药高新技术产业开发"]
            }
        },
        "宿迁市": {
            "id": 86,
            "alias": ["宿迁"],
            "宿城区": {
                "id": 839,
                "alias": ["宿城"]
            },
            "districts": ["宿城区", "宿豫区", "沭阳县", "泗阳县", "泗洪县", "宿迁经济技术开发区"],
            "宿豫区": {
                "id": 840,
                "alias": ["宿豫"]
            },
            "沭阳县": {
                "id": 841,
                "alias": ["沭阳"]
            },
            "泗阳县": {
                "id": 842,
                "alias": ["泗阳"]
            },
            "泗洪县": {
                "id": 843,
                "alias": ["泗洪"]
            },
            "宿迁经济技术开发区": {
                "id": 3417,
                "alias": ["宿迁经济技术开发"]
            }
        }
    },
    "浙江省": {
        "alias": ["浙江"],
        "id": 11,
        "cities": ["杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市", "衢州市", "舟山市", "台州市", "丽水市"],
        "杭州市": {
            "id": 87,
            "alias": ["杭州"],
            "上城区": {
                "id": 844,
                "alias": ["上城"]
            },
            "districts": ["上城区", "下城区", "江干区", "拱墅区", "西湖区", "滨江区", "萧山区", "余杭区", "桐庐县", "淳安县", "建德市", "富阳区", "临安区"],
            "下城区": {
                "id": 845,
                "alias": ["下城"]
            },
            "江干区": {
                "id": 846,
                "alias": ["江干"]
            },
            "拱墅区": {
                "id": 847,
                "alias": ["拱墅"]
            },
            "西湖区": {
                "id": 848,
                "alias": ["西湖"]
            },
            "滨江区": {
                "id": 849,
                "alias": ["滨江"]
            },
            "萧山区": {
                "id": 850,
                "alias": ["萧山"]
            },
            "余杭区": {
                "id": 851,
                "alias": ["余杭"]
            },
            "桐庐县": {
                "id": 852,
                "alias": ["桐庐"]
            },
            "淳安县": {
                "id": 853,
                "alias": ["淳安"]
            },
            "建德市": {
                "id": 854,
                "alias": ["建德"]
            },
            "富阳区": {
                "id": 855,
                "alias": ["富阳"]
            },
            "临安区": {
                "id": 856,
                "alias": ["临安"]
            }
        },
        "宁波市": {
            "id": 88,
            "alias": ["宁波"],
            "海曙区": {
                "id": 857,
                "alias": ["海曙"]
            },
            "districts": ["海曙区", "江北区", "北仑区", "镇海区", "鄞州区", "象山县", "宁海县", "余姚市", "慈溪市", "奉化区"],
            "江北区": {
                "id": 859,
                "alias": ["江北"]
            },
            "北仑区": {
                "id": 860,
                "alias": ["北仑"]
            },
            "镇海区": {
                "id": 861,
                "alias": ["镇海"]
            },
            "鄞州区": {
                "id": 862,
                "alias": ["鄞州"]
            },
            "象山县": {
                "id": 863,
                "alias": ["象山"]
            },
            "宁海县": {
                "id": 864,
                "alias": ["宁海"]
            },
            "余姚市": {
                "id": 865,
                "alias": ["余姚"]
            },
            "慈溪市": {
                "id": 866,
                "alias": ["慈溪"]
            },
            "奉化区": {
                "id": 867,
                "alias": ["奉化"]
            }
        },
        "温州市": {
            "id": 89,
            "alias": ["温州"],
            "鹿城区": {
                "id": 868,
                "alias": ["鹿城"]
            },
            "districts": ["鹿城区", "龙湾区", "瓯海区", "洞头区", "永嘉县", "平阳县", "苍南县", "文成县", "泰顺县", "瑞安市", "乐清市", "温州经济技术开发区"],
            "龙湾区": {
                "id": 869,
                "alias": ["龙湾"]
            },
            "瓯海区": {
                "id": 870,
                "alias": ["瓯海"]
            },
            "洞头区": {
                "id": 871,
                "alias": ["洞头"]
            },
            "永嘉县": {
                "id": 872,
                "alias": ["永嘉"]
            },
            "平阳县": {
                "id": 873,
                "alias": ["平阳"]
            },
            "苍南县": {
                "id": 874,
                "alias": ["苍南"]
            },
            "文成县": {
                "id": 875,
                "alias": ["文成"]
            },
            "泰顺县": {
                "id": 876,
                "alias": ["泰顺"]
            },
            "瑞安市": {
                "id": 877,
                "alias": ["瑞安"]
            },
            "乐清市": {
                "id": 878,
                "alias": ["乐清"]
            },
            "温州经济技术开发区": {
                "id": 3474,
                "alias": ["温州经济技术开发"]
            }
        },
        "嘉兴市": {
            "id": 90,
            "alias": ["嘉兴"],
            "秀洲区": {
                "id": 880,
                "alias": ["秀洲"]
            },
            "districts": ["秀洲区", "嘉善县", "海盐县", "海宁市", "平湖市", "桐乡市", "南湖区"],
            "嘉善县": {
                "id": 881,
                "alias": ["嘉善"]
            },
            "海盐县": {
                "id": 882,
                "alias": ["海盐"]
            },
            "海宁市": {
                "id": 883,
                "alias": ["海宁"]
            },
            "平湖市": {
                "id": 884,
                "alias": ["平湖"]
            },
            "桐乡市": {
                "id": 885,
                "alias": ["桐乡"]
            },
            "南湖区": {
                "id": 3475,
                "alias": ["南湖"]
            }
        },
        "湖州市": {
            "id": 91,
            "alias": ["湖州"],
            "吴兴区": {
                "id": 886,
                "alias": ["吴兴"]
            },
            "districts": ["吴兴区", "南浔区", "德清县", "长兴县", "安吉县"],
            "南浔区": {
                "id": 887,
                "alias": ["南浔"]
            },
            "德清县": {
                "id": 888,
                "alias": ["德清"]
            },
            "长兴县": {
                "id": 889,
                "alias": ["长兴"]
            },
            "安吉县": {
                "id": 890,
                "alias": ["安吉"]
            }
        },
        "绍兴市": {
            "id": 92,
            "alias": ["绍兴"],
            "越城区": {
                "id": 891,
                "alias": ["越城"]
            },
            "districts": ["越城区", "新昌县", "诸暨市", "上虞区", "嵊州市", "柯桥区"],
            "新昌县": {
                "id": 893,
                "alias": ["新昌"]
            },
            "诸暨市": {
                "id": 894,
                "alias": ["诸暨"]
            },
            "上虞区": {
                "id": 895,
                "alias": ["上虞"]
            },
            "嵊州市": {
                "id": 896,
                "alias": ["嵊州"]
            },
            "柯桥区": {
                "id": 3476,
                "alias": ["柯桥"]
            }
        },
        "金华市": {
            "id": 93,
            "alias": ["金华"],
            "婺城区": {
                "id": 897,
                "alias": ["婺城"]
            },
            "districts": ["婺城区", "金东区", "武义县", "浦江县", "磐安县", "兰溪市", "义乌市", "东阳市", "永康市"],
            "金东区": {
                "id": 898,
                "alias": ["金东"]
            },
            "武义县": {
                "id": 899,
                "alias": ["武义"]
            },
            "浦江县": {
                "id": 900,
                "alias": ["浦江"]
            },
            "磐安县": {
                "id": 901,
                "alias": ["磐安"]
            },
            "兰溪市": {
                "id": 902,
                "alias": ["兰溪"]
            },
            "义乌市": {
                "id": 903,
                "alias": ["义乌"]
            },
            "东阳市": {
                "id": 904,
                "alias": ["东阳"]
            },
            "永康市": {
                "id": 905,
                "alias": ["永康"]
            }
        },
        "衢州市": {
            "id": 94,
            "alias": ["衢州"],
            "柯城区": {
                "id": 906,
                "alias": ["柯城"]
            },
            "districts": ["柯城区", "衢江区", "常山县", "开化县", "龙游县", "江山市"],
            "衢江区": {
                "id": 907,
                "alias": ["衢江"]
            },
            "常山县": {
                "id": 908,
                "alias": ["常山"]
            },
            "开化县": {
                "id": 909,
                "alias": ["开化"]
            },
            "龙游县": {
                "id": 910,
                "alias": ["龙游"]
            },
            "江山市": {
                "id": 911,
                "alias": ["江山"]
            }
        },
        "舟山市": {
            "id": 95,
            "alias": ["舟山"],
            "定海区": {
                "id": 912,
                "alias": ["定海"]
            },
            "districts": ["定海区", "普陀区", "岱山县", "嵊泗县"],
            "普陀区": {
                "id": 913,
                "alias": ["普陀"]
            },
            "岱山县": {
                "id": 914,
                "alias": ["岱山"]
            },
            "嵊泗县": {
                "id": 915,
                "alias": ["嵊泗"]
            }
        },
        "台州市": {
            "id": 96,
            "alias": ["台州"],
            "椒江区": {
                "id": 916,
                "alias": ["椒江"]
            },
            "districts": ["椒江区", "黄岩区", "路桥区", "玉环市", "三门县", "天台县", "仙居县", "温岭市", "临海市"],
            "黄岩区": {
                "id": 917,
                "alias": ["黄岩"]
            },
            "路桥区": {
                "id": 918,
                "alias": ["路桥"]
            },
            "玉环市": {
                "id": 919,
                "alias": ["玉环"]
            },
            "三门县": {
                "id": 920,
                "alias": ["三门"]
            },
            "天台县": {
                "id": 921,
                "alias": ["天台"]
            },
            "仙居县": {
                "id": 922,
                "alias": ["仙居"]
            },
            "温岭市": {
                "id": 923,
                "alias": ["温岭"]
            },
            "临海市": {
                "id": 924,
                "alias": ["临海"]
            }
        },
        "丽水市": {
            "id": 97,
            "alias": ["丽水"],
            "莲都区": {
                "id": 925,
                "alias": ["莲都"]
            },
            "districts": ["莲都区", "青田县", "缙云县", "遂昌县", "松阳县", "云和县", "庆元县", "景宁畲族自治县", "龙泉市"],
            "青田县": {
                "id": 926,
                "alias": ["青田"]
            },
            "缙云县": {
                "id": 927,
                "alias": ["缙云"]
            },
            "遂昌县": {
                "id": 928,
                "alias": ["遂昌"]
            },
            "松阳县": {
                "id": 929,
                "alias": ["松阳"]
            },
            "云和县": {
                "id": 930,
                "alias": ["云和"]
            },
            "庆元县": {
                "id": 931,
                "alias": ["庆元"]
            },
            "景宁畲族自治县": {
                "id": 932,
                "alias": ["景宁"]
            },
            "龙泉市": {
                "id": 933,
                "alias": ["龙泉"]
            }
        }
    },
    "安徽省": {
        "alias": ["安徽"],
        "id": 12,
        "cities": ["合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "巢湖市", "六安市", "亳州市", "池州市", "宣城市"],
        "合肥市": {
            "id": 98,
            "alias": ["合肥"],
            "瑶海区": {
                "id": 934,
                "alias": ["瑶海"]
            },
            "districts": ["瑶海区", "庐阳区", "蜀山区", "包河区", "长丰县", "肥东县", "肥西县", "庐江县", "合肥高新技术产业开发区", "合肥经济技术开发区", "合肥新站高新技术产业开发区", "巢湖市"],
            "庐阳区": {
                "id": 935,
                "alias": ["庐阳"]
            },
            "蜀山区": {
                "id": 936,
                "alias": ["蜀山"]
            },
            "包河区": {
                "id": 937,
                "alias": ["包河"]
            },
            "长丰县": {
                "id": 938,
                "alias": ["长丰"]
            },
            "肥东县": {
                "id": 939,
                "alias": ["肥东"]
            },
            "肥西县": {
                "id": 940,
                "alias": ["肥西"]
            },
            "庐江县": {
                "id": 1013,
                "alias": ["庐江"]
            },
            "合肥高新技术产业开发区": {
                "id": 3275,
                "alias": ["合肥高新技术产业开发"]
            },
            "合肥经济技术开发区": {
                "id": 3276,
                "alias": ["合肥经济技术开发"]
            },
            "合肥新站高新技术产业开发区": {
                "id": 3277,
                "alias": ["合肥新站高新技术产业开发"]
            },
            "巢湖市": {
                "id": 3278,
                "alias": ["巢湖"]
            }
        },
        "芜湖市": {
            "id": 99,
            "alias": ["芜湖"],
            "镜湖区": {
                "id": 941,
                "alias": ["镜湖"]
            },
            "districts": ["镜湖区", "鸠江区", "芜湖县", "繁昌县", "南陵县", "无为县", "弋江区", "三山区", "芜湖经济技术开发区", "安徽芜湖长江大桥经济开发区"],
            "鸠江区": {
                "id": 944,
                "alias": ["鸠江"]
            },
            "芜湖县": {
                "id": 945,
                "alias": ["芜湖"]
            },
            "繁昌县": {
                "id": 946,
                "alias": ["繁昌"]
            },
            "南陵县": {
                "id": 947,
                "alias": ["南陵"]
            },
            "无为县": {
                "id": 1014,
                "alias": ["无为"]
            },
            "弋江区": {
                "id": 3279,
                "alias": ["弋江"]
            },
            "三山区": {
                "id": 3280,
                "alias": ["三山"]
            },
            "芜湖经济技术开发区": {
                "id": 3281,
                "alias": ["芜湖经济技术开发"]
            },
            "安徽芜湖长江大桥经济开发区": {
                "id": 3282,
                "alias": ["安徽芜湖长江大桥经济开发"]
            }
        },
        "蚌埠市": {
            "id": 100,
            "alias": ["蚌埠"],
            "龙子湖区": {
                "id": 948,
                "alias": ["龙子湖"]
            },
            "districts": ["龙子湖区", "蚌山区", "禹会区", "淮上区", "怀远县", "五河县", "固镇县", "蚌埠市高新技术开发区", "蚌埠市经济开发区"],
            "蚌山区": {
                "id": 949,
                "alias": ["蚌山"]
            },
            "禹会区": {
                "id": 950,
                "alias": ["禹会"]
            },
            "淮上区": {
                "id": 951,
                "alias": ["淮上"]
            },
            "怀远县": {
                "id": 952,
                "alias": ["怀远"]
            },
            "五河县": {
                "id": 953,
                "alias": ["五河"]
            },
            "固镇县": {
                "id": 954,
                "alias": ["固镇"]
            },
            "蚌埠市高新技术开发区": {
                "id": 3283,
                "alias": ["蚌埠市高新技术开发"]
            },
            "蚌埠市经济开发区": {
                "id": 3284,
                "alias": ["蚌埠市经济开发"]
            }
        },
        "淮南市": {
            "id": 101,
            "alias": ["淮南"],
            "大通区": {
                "id": 955,
                "alias": ["大通"]
            },
            "districts": ["大通区", "田家庵区", "谢家集区", "八公山区", "潘集区", "凤台县", "寿县"],
            "田家庵区": {
                "id": 956,
                "alias": ["田家庵"]
            },
            "谢家集区": {
                "id": 957,
                "alias": ["谢家集"]
            },
            "八公山区": {
                "id": 958,
                "alias": ["八公山"]
            },
            "潘集区": {
                "id": 959,
                "alias": ["潘集"]
            },
            "凤台县": {
                "id": 960,
                "alias": ["凤台"]
            },
            "寿县": {
                "id": 3285,
                "alias": []
            }
        },
        "马鞍山市": {
            "id": 102,
            "alias": ["马鞍山"],
            "花山区": {
                "id": 962,
                "alias": ["花山"]
            },
            "districts": ["花山区", "雨山区", "当涂县", "含山县", "和县", "博望区"],
            "雨山区": {
                "id": 963,
                "alias": ["雨山"]
            },
            "当涂县": {
                "id": 964,
                "alias": ["当涂"]
            },
            "含山县": {
                "id": 1015,
                "alias": ["含山"]
            },
            "和县": {
                "id": 1016,
                "alias": []
            },
            "博望区": {
                "id": 3286,
                "alias": ["博望"]
            }
        },
        "淮北市": {
            "id": 103,
            "alias": ["淮北"],
            "杜集区": {
                "id": 965,
                "alias": ["杜集"]
            },
            "districts": ["杜集区", "相山区", "烈山区", "濉溪县"],
            "相山区": {
                "id": 966,
                "alias": ["相山"]
            },
            "烈山区": {
                "id": 967,
                "alias": ["烈山"]
            },
            "濉溪县": {
                "id": 968,
                "alias": ["濉溪"]
            }
        },
        "铜陵市": {
            "id": 104,
            "alias": ["铜陵"],
            "铜官区": {
                "id": 969,
                "alias": ["铜官"]
            },
            "districts": ["铜官区", "郊区", "义安区", "枞阳县"],
            "郊区": {
                "id": 971,
                "alias": []
            },
            "义安区": {
                "id": 3287,
                "alias": ["义安"]
            },
            "枞阳县": {
                "id": 3288,
                "alias": ["枞阳"]
            }
        },
        "安庆市": {
            "id": 105,
            "alias": ["安庆"],
            "迎江区": {
                "id": 973,
                "alias": ["迎江"]
            },
            "districts": ["迎江区", "大观区", "怀宁县", "潜山县", "太湖县", "宿松县", "望江县", "岳西县", "桐城市", "宜秀区", "安徽安庆经济开发区"],
            "大观区": {
                "id": 974,
                "alias": ["大观"]
            },
            "怀宁县": {
                "id": 976,
                "alias": ["怀宁"]
            },
            "潜山县": {
                "id": 978,
                "alias": ["潜山"]
            },
            "太湖县": {
                "id": 979,
                "alias": ["太湖"]
            },
            "宿松县": {
                "id": 980,
                "alias": ["宿松"]
            },
            "望江县": {
                "id": 981,
                "alias": ["望江"]
            },
            "岳西县": {
                "id": 982,
                "alias": ["岳西"]
            },
            "桐城市": {
                "id": 983,
                "alias": ["桐城"]
            },
            "宜秀区": {
                "id": 3289,
                "alias": ["宜秀"]
            },
            "安徽安庆经济开发区": {
                "id": 3290,
                "alias": ["安徽安庆经济开发"]
            }
        },
        "黄山市": {
            "id": 106,
            "alias": ["黄山"],
            "屯溪区": {
                "id": 984,
                "alias": ["屯溪"]
            },
            "districts": ["屯溪区", "黄山区", "徽州区", "歙县", "休宁县", "黟县", "祁门县"],
            "黄山区": {
                "id": 985,
                "alias": ["黄山"]
            },
            "徽州区": {
                "id": 986,
                "alias": ["徽州"]
            },
            "歙县": {
                "id": 987,
                "alias": []
            },
            "休宁县": {
                "id": 988,
                "alias": ["休宁"]
            },
            "黟县": {
                "id": 989,
                "alias": []
            },
            "祁门县": {
                "id": 990,
                "alias": ["祁门"]
            }
        },
        "滁州市": {
            "id": 107,
            "alias": ["滁州"],
            "琅琊区": {
                "id": 991,
                "alias": ["琅琊"]
            },
            "districts": ["琅琊区", "南谯区", "来安县", "全椒县", "定远县", "凤阳县", "天长市", "明光市", "苏滁现代产业园", "滁州经济技术开发区"],
            "南谯区": {
                "id": 992,
                "alias": ["南谯"]
            },
            "来安县": {
                "id": 993,
                "alias": ["来安"]
            },
            "全椒县": {
                "id": 994,
                "alias": ["全椒"]
            },
            "定远县": {
                "id": 995,
                "alias": ["定远"]
            },
            "凤阳县": {
                "id": 996,
                "alias": ["凤阳"]
            },
            "天长市": {
                "id": 997,
                "alias": ["天长"]
            },
            "明光市": {
                "id": 998,
                "alias": ["明光"]
            },
            "苏滁现代产业园": {
                "id": 3291,
                "alias": []
            },
            "滁州经济技术开发区": {
                "id": 3292,
                "alias": ["滁州经济技术开发"]
            }
        },
        "阜阳市": {
            "id": 108,
            "alias": ["阜阳"],
            "颍州区": {
                "id": 999,
                "alias": ["颍州"]
            },
            "districts": ["颍州区", "颍东区", "颍泉区", "临泉县", "太和县", "阜南县", "颍上县", "界首市", "阜阳合肥现代产业园区", "阜阳经济技术开发区"],
            "颍东区": {
                "id": 1000,
                "alias": ["颍东"]
            },
            "颍泉区": {
                "id": 1001,
                "alias": ["颍泉"]
            },
            "临泉县": {
                "id": 1002,
                "alias": ["临泉"]
            },
            "太和县": {
                "id": 1003,
                "alias": ["太和"]
            },
            "阜南县": {
                "id": 1004,
                "alias": ["阜南"]
            },
            "颍上县": {
                "id": 1005,
                "alias": ["颍上"]
            },
            "界首市": {
                "id": 1006,
                "alias": ["界首"]
            },
            "阜阳合肥现代产业园区": {
                "id": 3293,
                "alias": ["阜阳合肥现代产业园"]
            },
            "阜阳经济技术开发区": {
                "id": 3294,
                "alias": ["阜阳经济技术开发"]
            }
        },
        "宿州市": {
            "id": 109,
            "alias": ["宿州"],
            "埇桥区": {
                "id": 1007,
                "alias": ["埇桥"]
            },
            "districts": ["埇桥区", "砀山县", "萧县", "灵璧县", "泗县", "宿州马鞍山现代产业园区", "宿州经济技术开发区"],
            "砀山县": {
                "id": 1008,
                "alias": ["砀山"]
            },
            "萧县": {
                "id": 1009,
                "alias": []
            },
            "灵璧县": {
                "id": 1010,
                "alias": ["灵璧"]
            },
            "泗县": {
                "id": 1011,
                "alias": []
            },
            "宿州马鞍山现代产业园区": {
                "id": 3295,
                "alias": ["宿州马鞍山现代产业园"]
            },
            "宿州经济技术开发区": {
                "id": 3296,
                "alias": ["宿州经济技术开发"]
            }
        },
        "巢湖市": {
            "id": 110,
            "alias": ["巢湖"]
        },
        "六安市": {
            "id": 111,
            "alias": ["六安"],
            "金安区": {
                "id": 1017,
                "alias": ["金安"]
            },
            "districts": ["金安区", "裕安区", "霍邱县", "舒城县", "金寨县", "霍山县", "叶集区"],
            "裕安区": {
                "id": 1018,
                "alias": ["裕安"]
            },
            "霍邱县": {
                "id": 1020,
                "alias": ["霍邱"]
            },
            "舒城县": {
                "id": 1021,
                "alias": ["舒城"]
            },
            "金寨县": {
                "id": 1022,
                "alias": ["金寨"]
            },
            "霍山县": {
                "id": 1023,
                "alias": ["霍山"]
            },
            "叶集区": {
                "id": 3297,
                "alias": ["叶集"]
            }
        },
        "亳州市": {
            "id": 112,
            "alias": ["亳州"],
            "谯城区": {
                "id": 1024,
                "alias": ["谯城"]
            },
            "districts": ["谯城区", "涡阳县", "蒙城县", "利辛县"],
            "涡阳县": {
                "id": 1025,
                "alias": ["涡阳"]
            },
            "蒙城县": {
                "id": 1026,
                "alias": ["蒙城"]
            },
            "利辛县": {
                "id": 1027,
                "alias": ["利辛"]
            }
        },
        "池州市": {
            "id": 113,
            "alias": ["池州"],
            "贵池区": {
                "id": 1028,
                "alias": ["贵池"]
            },
            "districts": ["贵池区", "东至县", "石台县", "青阳县"],
            "东至县": {
                "id": 1029,
                "alias": ["东至"]
            },
            "石台县": {
                "id": 1030,
                "alias": ["石台"]
            },
            "青阳县": {
                "id": 1031,
                "alias": ["青阳"]
            }
        },
        "宣城市": {
            "id": 114,
            "alias": ["宣城"],
            "宣州区": {
                "id": 1032,
                "alias": ["宣州"]
            },
            "districts": ["宣州区", "郎溪县", "广德县", "泾县", "绩溪县", "旌德县", "宁国市", "宣城市经济开发区"],
            "郎溪县": {
                "id": 1033,
                "alias": ["郎溪"]
            },
            "广德县": {
                "id": 1034,
                "alias": ["广德"]
            },
            "泾县": {
                "id": 1035,
                "alias": []
            },
            "绩溪县": {
                "id": 1036,
                "alias": ["绩溪"]
            },
            "旌德县": {
                "id": 1037,
                "alias": ["旌德"]
            },
            "宁国市": {
                "id": 1038,
                "alias": ["宁国"]
            },
            "宣城市经济开发区": {
                "id": 3298,
                "alias": ["宣城市经济开发"]
            }
        }
    },
    "福建省": {
        "alias": ["福建"],
        "id": 13,
        "cities": ["福州市", "厦门市", "莆田市", "三明市", "泉州市", "漳州市", "南平市", "龙岩市", "宁德市"],
        "福州市": {
            "id": 115,
            "alias": ["福州"],
            "鼓楼区": {
                "id": 1039,
                "alias": ["鼓楼"]
            },
            "districts": ["鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "闽侯县", "连江县", "罗源县", "闽清县", "永泰县", "平潭县", "福清市", "长乐市"],
            "台江区": {
                "id": 1040,
                "alias": ["台江"]
            },
            "仓山区": {
                "id": 1041,
                "alias": ["仓山"]
            },
            "马尾区": {
                "id": 1042,
                "alias": ["马尾"]
            },
            "晋安区": {
                "id": 1043,
                "alias": ["晋安"]
            },
            "闽侯县": {
                "id": 1044,
                "alias": ["闽侯"]
            },
            "连江县": {
                "id": 1045,
                "alias": ["连江"]
            },
            "罗源县": {
                "id": 1046,
                "alias": ["罗源"]
            },
            "闽清县": {
                "id": 1047,
                "alias": ["闽清"]
            },
            "永泰县": {
                "id": 1048,
                "alias": ["永泰"]
            },
            "平潭县": {
                "id": 1049,
                "alias": ["平潭"]
            },
            "福清市": {
                "id": 1050,
                "alias": ["福清"]
            },
            "长乐市": {
                "id": 1051,
                "alias": ["长乐"]
            }
        },
        "厦门市": {
            "id": 116,
            "alias": ["厦门"],
            "思明区": {
                "id": 1052,
                "alias": ["思明"]
            },
            "districts": ["思明区", "海沧区", "湖里区", "集美区", "同安区", "翔安区"],
            "海沧区": {
                "id": 1053,
                "alias": ["海沧"]
            },
            "湖里区": {
                "id": 1054,
                "alias": ["湖里"]
            },
            "集美区": {
                "id": 1055,
                "alias": ["集美"]
            },
            "同安区": {
                "id": 1056,
                "alias": ["同安"]
            },
            "翔安区": {
                "id": 1057,
                "alias": ["翔安"]
            }
        },
        "莆田市": {
            "id": 117,
            "alias": ["莆田"],
            "城厢区": {
                "id": 1058,
                "alias": ["城厢"]
            },
            "districts": ["城厢区", "涵江区", "荔城区", "秀屿区", "仙游县"],
            "涵江区": {
                "id": 1059,
                "alias": ["涵江"]
            },
            "荔城区": {
                "id": 1060,
                "alias": ["荔城"]
            },
            "秀屿区": {
                "id": 1061,
                "alias": ["秀屿"]
            },
            "仙游县": {
                "id": 1062,
                "alias": ["仙游"]
            }
        },
        "三明市": {
            "id": 118,
            "alias": ["三明"],
            "梅列区": {
                "id": 1063,
                "alias": ["梅列"]
            },
            "districts": ["梅列区", "三元区", "明溪县", "清流县", "宁化县", "大田县", "尤溪县", "沙县", "将乐县", "泰宁县", "建宁县", "永安市"],
            "三元区": {
                "id": 1064,
                "alias": ["三元"]
            },
            "明溪县": {
                "id": 1065,
                "alias": ["明溪"]
            },
            "清流县": {
                "id": 1066,
                "alias": ["清流"]
            },
            "宁化县": {
                "id": 1067,
                "alias": ["宁化"]
            },
            "大田县": {
                "id": 1068,
                "alias": ["大田"]
            },
            "尤溪县": {
                "id": 1069,
                "alias": ["尤溪"]
            },
            "沙县": {
                "id": 1070,
                "alias": []
            },
            "将乐县": {
                "id": 1071,
                "alias": ["将乐"]
            },
            "泰宁县": {
                "id": 1072,
                "alias": ["泰宁"]
            },
            "建宁县": {
                "id": 1073,
                "alias": ["建宁"]
            },
            "永安市": {
                "id": 1074,
                "alias": ["永安"]
            }
        },
        "泉州市": {
            "id": 119,
            "alias": ["泉州"],
            "鲤城区": {
                "id": 1075,
                "alias": ["鲤城"]
            },
            "districts": ["鲤城区", "丰泽区", "洛江区", "泉港区", "惠安县", "安溪县", "永春县", "德化县", "金门县", "石狮市", "晋江市", "南安市"],
            "丰泽区": {
                "id": 1076,
                "alias": ["丰泽"]
            },
            "洛江区": {
                "id": 1077,
                "alias": ["洛江"]
            },
            "泉港区": {
                "id": 1078,
                "alias": ["泉港"]
            },
            "惠安县": {
                "id": 1079,
                "alias": ["惠安"]
            },
            "安溪县": {
                "id": 1080,
                "alias": ["安溪"]
            },
            "永春县": {
                "id": 1081,
                "alias": ["永春"]
            },
            "德化县": {
                "id": 1082,
                "alias": ["德化"]
            },
            "金门县": {
                "id": 1083,
                "alias": ["金门"]
            },
            "石狮市": {
                "id": 1084,
                "alias": ["石狮"]
            },
            "晋江市": {
                "id": 1085,
                "alias": ["晋江"]
            },
            "南安市": {
                "id": 1086,
                "alias": ["南安"]
            }
        },
        "漳州市": {
            "id": 120,
            "alias": ["漳州"],
            "芗城区": {
                "id": 1087,
                "alias": ["芗城"]
            },
            "districts": ["芗城区", "龙文区", "云霄县", "漳浦县", "诏安县", "长泰县", "东山县", "南靖县", "平和县", "华安县", "龙海市"],
            "龙文区": {
                "id": 1088,
                "alias": ["龙文"]
            },
            "云霄县": {
                "id": 1089,
                "alias": ["云霄"]
            },
            "漳浦县": {
                "id": 1090,
                "alias": ["漳浦"]
            },
            "诏安县": {
                "id": 1091,
                "alias": ["诏安"]
            },
            "长泰县": {
                "id": 1092,
                "alias": ["长泰"]
            },
            "东山县": {
                "id": 1093,
                "alias": ["东山"]
            },
            "南靖县": {
                "id": 1094,
                "alias": ["南靖"]
            },
            "平和县": {
                "id": 1095,
                "alias": ["平和"]
            },
            "华安县": {
                "id": 1096,
                "alias": ["华安"]
            },
            "龙海市": {
                "id": 1097,
                "alias": ["龙海"]
            }
        },
        "南平市": {
            "id": 121,
            "alias": ["南平"],
            "延平区": {
                "id": 1098,
                "alias": ["延平"]
            },
            "districts": ["延平区", "顺昌县", "浦城县", "光泽县", "松溪县", "政和县", "邵武市", "武夷山市", "建瓯市", "建阳区"],
            "顺昌县": {
                "id": 1099,
                "alias": ["顺昌"]
            },
            "浦城县": {
                "id": 1100,
                "alias": ["浦城"]
            },
            "光泽县": {
                "id": 1101,
                "alias": ["光泽"]
            },
            "松溪县": {
                "id": 1102,
                "alias": ["松溪"]
            },
            "政和县": {
                "id": 1103,
                "alias": ["政和"]
            },
            "邵武市": {
                "id": 1104,
                "alias": ["邵武"]
            },
            "武夷山市": {
                "id": 1105,
                "alias": ["武夷山"]
            },
            "建瓯市": {
                "id": 1106,
                "alias": ["建瓯"]
            },
            "建阳区": {
                "id": 1107,
                "alias": ["建阳"]
            }
        },
        "龙岩市": {
            "id": 122,
            "alias": ["龙岩"],
            "新罗区": {
                "id": 1108,
                "alias": ["新罗"]
            },
            "districts": ["新罗区", "长汀县", "永定区", "上杭县", "武平县", "连城县", "漳平市"],
            "长汀县": {
                "id": 1109,
                "alias": ["长汀"]
            },
            "永定区": {
                "id": 1110,
                "alias": ["永定"]
            },
            "上杭县": {
                "id": 1111,
                "alias": ["上杭"]
            },
            "武平县": {
                "id": 1112,
                "alias": ["武平"]
            },
            "连城县": {
                "id": 1113,
                "alias": ["连城"]
            },
            "漳平市": {
                "id": 1114,
                "alias": ["漳平"]
            }
        },
        "宁德市": {
            "id": 123,
            "alias": ["宁德"],
            "蕉城区": {
                "id": 1115,
                "alias": ["蕉城"]
            },
            "districts": ["蕉城区", "霞浦县", "古田县", "屏南县", "寿宁县", "周宁县", "柘荣县", "福安市", "福鼎市"],
            "霞浦县": {
                "id": 1116,
                "alias": ["霞浦"]
            },
            "古田县": {
                "id": 1117,
                "alias": ["古田"]
            },
            "屏南县": {
                "id": 1118,
                "alias": ["屏南"]
            },
            "寿宁县": {
                "id": 1119,
                "alias": ["寿宁"]
            },
            "周宁县": {
                "id": 1120,
                "alias": ["周宁"]
            },
            "柘荣县": {
                "id": 1121,
                "alias": ["柘荣"]
            },
            "福安市": {
                "id": 1122,
                "alias": ["福安"]
            },
            "福鼎市": {
                "id": 1123,
                "alias": ["福鼎"]
            }
        }
    },
    "江西省": {
        "alias": ["江西"],
        "id": 14,
        "cities": ["南昌市", "景德镇市", "萍乡市", "九江市", "新余市", "鹰潭市", "赣州市", "吉安市", "宜春市", "抚州市", "上饶市"],
        "南昌市": {
            "id": 124,
            "alias": ["南昌"],
            "东湖区": {
                "id": 1124,
                "alias": ["东湖"]
            },
            "districts": ["东湖区", "西湖区", "青云谱区", "湾里区", "青山湖区", "南昌县", "新建区", "安义县", "进贤县"],
            "西湖区": {
                "id": 1125,
                "alias": ["西湖"]
            },
            "青云谱区": {
                "id": 1126,
                "alias": ["青云谱"]
            },
            "湾里区": {
                "id": 1127,
                "alias": ["湾里"]
            },
            "青山湖区": {
                "id": 1128,
                "alias": ["青山湖"]
            },
            "南昌县": {
                "id": 1129,
                "alias": ["南昌"]
            },
            "新建区": {
                "id": 1130,
                "alias": ["新建"]
            },
            "安义县": {
                "id": 1131,
                "alias": ["安义"]
            },
            "进贤县": {
                "id": 1132,
                "alias": ["进贤"]
            }
        },
        "景德镇市": {
            "id": 125,
            "alias": ["景德镇"],
            "昌江区": {
                "id": 1133,
                "alias": ["昌江"]
            },
            "districts": ["昌江区", "珠山区", "浮梁县", "乐平市"],
            "珠山区": {
                "id": 1134,
                "alias": ["珠山"]
            },
            "浮梁县": {
                "id": 1135,
                "alias": ["浮梁"]
            },
            "乐平市": {
                "id": 1136,
                "alias": ["乐平"]
            }
        },
        "萍乡市": {
            "id": 126,
            "alias": ["萍乡"],
            "安源区": {
                "id": 1137,
                "alias": ["安源"]
            },
            "districts": ["安源区", "湘东区", "莲花县", "上栗县", "芦溪县"],
            "湘东区": {
                "id": 1138,
                "alias": ["湘东"]
            },
            "莲花县": {
                "id": 1139,
                "alias": ["莲花"]
            },
            "上栗县": {
                "id": 1140,
                "alias": ["上栗"]
            },
            "芦溪县": {
                "id": 1141,
                "alias": ["芦溪"]
            }
        },
        "九江市": {
            "id": 127,
            "alias": ["九江"],
            "庐山市": {
                "id": 1142,
                "alias": ["庐山"]
            },
            "districts": ["庐山市", "浔阳区", "九江县", "武宁县", "修水县", "永修县", "德安县", "都昌县", "湖口县", "彭泽县", "瑞昌市", "濂溪区", "柴桑区", "共青城市"],
            "浔阳区": {
                "id": 1143,
                "alias": ["浔阳"]
            },
            "九江县": {
                "id": 1144,
                "alias": ["九江"]
            },
            "武宁县": {
                "id": 1145,
                "alias": ["武宁"]
            },
            "修水县": {
                "id": 1146,
                "alias": ["修水"]
            },
            "永修县": {
                "id": 1147,
                "alias": ["永修"]
            },
            "德安县": {
                "id": 1148,
                "alias": ["德安"]
            },
            "都昌县": {
                "id": 1150,
                "alias": ["都昌"]
            },
            "湖口县": {
                "id": 1151,
                "alias": ["湖口"]
            },
            "彭泽县": {
                "id": 1152,
                "alias": ["彭泽"]
            },
            "瑞昌市": {
                "id": 1153,
                "alias": ["瑞昌"]
            },
            "濂溪区": {
                "id": 3418,
                "alias": ["濂溪"]
            },
            "柴桑区": {
                "id": 3419,
                "alias": ["柴桑"]
            },
            "共青城市": {
                "id": 3420,
                "alias": ["共青城"]
            }
        },
        "新余市": {
            "id": 128,
            "alias": ["新余"],
            "渝水区": {
                "id": 1154,
                "alias": ["渝水"]
            },
            "districts": ["渝水区", "分宜县"],
            "分宜县": {
                "id": 1155,
                "alias": ["分宜"]
            }
        },
        "鹰潭市": {
            "id": 129,
            "alias": ["鹰潭"],
            "月湖区": {
                "id": 1156,
                "alias": ["月湖"]
            },
            "districts": ["月湖区", "余江县", "贵溪市"],
            "余江县": {
                "id": 1157,
                "alias": ["余江"]
            },
            "贵溪市": {
                "id": 1158,
                "alias": ["贵溪"]
            }
        },
        "赣州市": {
            "id": 130,
            "alias": ["赣州"],
            "章贡区": {
                "id": 1159,
                "alias": ["章贡"]
            },
            "districts": ["章贡区", "赣县区", "信丰县", "大余县", "上犹县", "崇义县", "安远县", "龙南县", "定南县", "全南县", "宁都县", "于都县", "兴国县", "会昌县", "寻乌县", "石城县", "瑞金市", "南康区"],
            "赣县区": {
                "id": 1160,
                "alias": ["赣县"]
            },
            "信丰县": {
                "id": 1161,
                "alias": ["信丰"]
            },
            "大余县": {
                "id": 1162,
                "alias": ["大余"]
            },
            "上犹县": {
                "id": 1163,
                "alias": ["上犹"]
            },
            "崇义县": {
                "id": 1164,
                "alias": ["崇义"]
            },
            "安远县": {
                "id": 1165,
                "alias": ["安远"]
            },
            "龙南县": {
                "id": 1166,
                "alias": ["龙南"]
            },
            "定南县": {
                "id": 1167,
                "alias": ["定南"]
            },
            "全南县": {
                "id": 1168,
                "alias": ["全南"]
            },
            "宁都县": {
                "id": 1169,
                "alias": ["宁都"]
            },
            "于都县": {
                "id": 1170,
                "alias": ["于都"]
            },
            "兴国县": {
                "id": 1171,
                "alias": ["兴国"]
            },
            "会昌县": {
                "id": 1172,
                "alias": ["会昌"]
            },
            "寻乌县": {
                "id": 1173,
                "alias": ["寻乌"]
            },
            "石城县": {
                "id": 1174,
                "alias": ["石城"]
            },
            "瑞金市": {
                "id": 1175,
                "alias": ["瑞金"]
            },
            "南康区": {
                "id": 1176,
                "alias": ["南康"]
            }
        },
        "吉安市": {
            "id": 131,
            "alias": ["吉安"],
            "吉州区": {
                "id": 1177,
                "alias": ["吉州"]
            },
            "districts": ["吉州区", "青原区", "吉安县", "吉水县", "峡江县", "新干县", "永丰县", "泰和县", "遂川县", "万安县", "安福县", "永新县", "井冈山市"],
            "青原区": {
                "id": 1178,
                "alias": ["青原"]
            },
            "吉安县": {
                "id": 1179,
                "alias": ["吉安"]
            },
            "吉水县": {
                "id": 1180,
                "alias": ["吉水"]
            },
            "峡江县": {
                "id": 1181,
                "alias": ["峡江"]
            },
            "新干县": {
                "id": 1182,
                "alias": ["新干"]
            },
            "永丰县": {
                "id": 1183,
                "alias": ["永丰"]
            },
            "泰和县": {
                "id": 1184,
                "alias": ["泰和"]
            },
            "遂川县": {
                "id": 1185,
                "alias": ["遂川"]
            },
            "万安县": {
                "id": 1186,
                "alias": ["万安"]
            },
            "安福县": {
                "id": 1187,
                "alias": ["安福"]
            },
            "永新县": {
                "id": 1188,
                "alias": ["永新"]
            },
            "井冈山市": {
                "id": 1189,
                "alias": ["井冈山"]
            }
        },
        "宜春市": {
            "id": 132,
            "alias": ["宜春"],
            "袁州区": {
                "id": 1190,
                "alias": ["袁州"]
            },
            "districts": ["袁州区", "奉新县", "万载县", "上高县", "宜丰县", "靖安县", "铜鼓县", "丰城市", "樟树市", "高安市"],
            "奉新县": {
                "id": 1191,
                "alias": ["奉新"]
            },
            "万载县": {
                "id": 1192,
                "alias": ["万载"]
            },
            "上高县": {
                "id": 1193,
                "alias": ["上高"]
            },
            "宜丰县": {
                "id": 1194,
                "alias": ["宜丰"]
            },
            "靖安县": {
                "id": 1195,
                "alias": ["靖安"]
            },
            "铜鼓县": {
                "id": 1196,
                "alias": ["铜鼓"]
            },
            "丰城市": {
                "id": 1197,
                "alias": ["丰城"]
            },
            "樟树市": {
                "id": 1198,
                "alias": ["樟树"]
            },
            "高安市": {
                "id": 1199,
                "alias": ["高安"]
            }
        },
        "抚州市": {
            "id": 133,
            "alias": ["抚州"],
            "临川区": {
                "id": 1200,
                "alias": ["临川"]
            },
            "districts": ["临川区", "南城县", "黎川县", "南丰县", "崇仁县", "乐安县", "宜黄县", "金溪县", "资溪县", "东乡区", "广昌县"],
            "南城县": {
                "id": 1201,
                "alias": ["南城"]
            },
            "黎川县": {
                "id": 1202,
                "alias": ["黎川"]
            },
            "南丰县": {
                "id": 1203,
                "alias": ["南丰"]
            },
            "崇仁县": {
                "id": 1204,
                "alias": ["崇仁"]
            },
            "乐安县": {
                "id": 1205,
                "alias": ["乐安"]
            },
            "宜黄县": {
                "id": 1206,
                "alias": ["宜黄"]
            },
            "金溪县": {
                "id": 1207,
                "alias": ["金溪"]
            },
            "资溪县": {
                "id": 1208,
                "alias": ["资溪"]
            },
            "东乡区": {
                "id": 1209,
                "alias": ["东乡"]
            },
            "广昌县": {
                "id": 1210,
                "alias": ["广昌"]
            }
        },
        "上饶市": {
            "id": 134,
            "alias": ["上饶"],
            "信州区": {
                "id": 1211,
                "alias": ["信州"]
            },
            "districts": ["信州区", "上饶县", "广丰区", "玉山县", "铅山县", "横峰县", "弋阳县", "余干县", "鄱阳县", "万年县", "婺源县", "德兴市"],
            "上饶县": {
                "id": 1212,
                "alias": ["上饶"]
            },
            "广丰区": {
                "id": 1213,
                "alias": ["广丰"]
            },
            "玉山县": {
                "id": 1214,
                "alias": ["玉山"]
            },
            "铅山县": {
                "id": 1215,
                "alias": ["铅山"]
            },
            "横峰县": {
                "id": 1216,
                "alias": ["横峰"]
            },
            "弋阳县": {
                "id": 1217,
                "alias": ["弋阳"]
            },
            "余干县": {
                "id": 1218,
                "alias": ["余干"]
            },
            "鄱阳县": {
                "id": 1219,
                "alias": ["鄱阳"]
            },
            "万年县": {
                "id": 1220,
                "alias": ["万年"]
            },
            "婺源县": {
                "id": 1221,
                "alias": ["婺源"]
            },
            "德兴市": {
                "id": 1222,
                "alias": ["德兴"]
            }
        }
    },
    "山东省": {
        "alias": ["山东"],
        "id": 15,
        "cities": ["济南市", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "莱芜市", "临沂市", "德州市", "聊城市", "滨州市", "菏泽市"],
        "济南市": {
            "id": 135,
            "alias": ["济南"],
            "历下区": {
                "id": 1223,
                "alias": ["历下"]
            },
            "districts": ["历下区", "市中区", "槐荫区", "天桥区", "历城区", "长清区", "平阴县", "济阳县", "商河县", "章丘区", "济南高新技术产业开发区"],
            "市中区": {
                "id": 1224,
                "alias": ["市中"]
            },
            "槐荫区": {
                "id": 1225,
                "alias": ["槐荫"]
            },
            "天桥区": {
                "id": 1226,
                "alias": ["天桥"]
            },
            "历城区": {
                "id": 1227,
                "alias": ["历城"]
            },
            "长清区": {
                "id": 1228,
                "alias": ["长清"]
            },
            "平阴县": {
                "id": 1229,
                "alias": ["平阴"]
            },
            "济阳县": {
                "id": 1230,
                "alias": ["济阳"]
            },
            "商河县": {
                "id": 1231,
                "alias": ["商河"]
            },
            "章丘区": {
                "id": 1232,
                "alias": ["章丘"]
            },
            "济南高新技术产业开发区": {
                "id": 3299,
                "alias": ["济南高新技术产业开发"]
            }
        },
        "青岛市": {
            "id": 136,
            "alias": ["青岛"],
            "市南区": {
                "id": 1233,
                "alias": ["市南"]
            },
            "districts": ["市南区", "市北区", "黄岛区", "崂山区", "李沧区", "城阳区", "胶州市", "即墨区", "平度市", "莱西市", "青岛高新技术产业开发区"],
            "市北区": {
                "id": 1234,
                "alias": ["市北"]
            },
            "黄岛区": {
                "id": 1236,
                "alias": ["黄岛"]
            },
            "崂山区": {
                "id": 1237,
                "alias": ["崂山"]
            },
            "李沧区": {
                "id": 1238,
                "alias": ["李沧"]
            },
            "城阳区": {
                "id": 1239,
                "alias": ["城阳"]
            },
            "胶州市": {
                "id": 1240,
                "alias": ["胶州"]
            },
            "即墨区": {
                "id": 1241,
                "alias": ["即墨"]
            },
            "平度市": {
                "id": 1242,
                "alias": ["平度"]
            },
            "莱西市": {
                "id": 1244,
                "alias": ["莱西"]
            },
            "青岛高新技术产业开发区": {
                "id": 3300,
                "alias": ["青岛高新技术产业开发"]
            }
        },
        "淄博市": {
            "id": 137,
            "alias": ["淄博"],
            "淄川区": {
                "id": 1245,
                "alias": ["淄川"]
            },
            "districts": ["淄川区", "张店区", "博山区", "临淄区", "周村区", "桓台县", "高青县", "沂源县"],
            "张店区": {
                "id": 1246,
                "alias": ["张店"]
            },
            "博山区": {
                "id": 1247,
                "alias": ["博山"]
            },
            "临淄区": {
                "id": 1248,
                "alias": ["临淄"]
            },
            "周村区": {
                "id": 1249,
                "alias": ["周村"]
            },
            "桓台县": {
                "id": 1250,
                "alias": ["桓台"]
            },
            "高青县": {
                "id": 1251,
                "alias": ["高青"]
            },
            "沂源县": {
                "id": 1252,
                "alias": ["沂源"]
            }
        },
        "枣庄市": {
            "id": 138,
            "alias": ["枣庄"],
            "市中区": {
                "id": 1253,
                "alias": ["市中"]
            },
            "districts": ["市中区", "薛城区", "峄城区", "台儿庄区", "山亭区", "滕州市"],
            "薛城区": {
                "id": 1254,
                "alias": ["薛城"]
            },
            "峄城区": {
                "id": 1255,
                "alias": ["峄城"]
            },
            "台儿庄区": {
                "id": 1256,
                "alias": ["台儿庄"]
            },
            "山亭区": {
                "id": 1257,
                "alias": ["山亭"]
            },
            "滕州市": {
                "id": 1258,
                "alias": ["滕州"]
            }
        },
        "东营市": {
            "id": 139,
            "alias": ["东营"],
            "东营区": {
                "id": 1259,
                "alias": ["东营"]
            },
            "districts": ["东营区", "河口区", "垦利区", "利津县", "广饶县", "东营经济技术开发区", "东营港经济开发区"],
            "河口区": {
                "id": 1260,
                "alias": ["河口"]
            },
            "垦利区": {
                "id": 1261,
                "alias": ["垦利"]
            },
            "利津县": {
                "id": 1262,
                "alias": ["利津"]
            },
            "广饶县": {
                "id": 1263,
                "alias": ["广饶"]
            },
            "东营经济技术开发区": {
                "id": 3301,
                "alias": ["东营经济技术开发"]
            },
            "东营港经济开发区": {
                "id": 3302,
                "alias": ["东营港经济开发"]
            }
        },
        "烟台市": {
            "id": 140,
            "alias": ["烟台"],
            "芝罘区": {
                "id": 1264,
                "alias": ["芝罘"]
            },
            "districts": ["芝罘区", "福山区", "牟平区", "莱山区", "长岛县", "龙口市", "莱阳市", "莱州市", "蓬莱市", "招远市", "栖霞市", "海阳市", "烟台高新技术产业开发区", "烟台经济技术开发区"],
            "福山区": {
                "id": 1265,
                "alias": ["福山"]
            },
            "牟平区": {
                "id": 1266,
                "alias": ["牟平"]
            },
            "莱山区": {
                "id": 1267,
                "alias": ["莱山"]
            },
            "长岛县": {
                "id": 1268,
                "alias": ["长岛"]
            },
            "龙口市": {
                "id": 1269,
                "alias": ["龙口"]
            },
            "莱阳市": {
                "id": 1270,
                "alias": ["莱阳"]
            },
            "莱州市": {
                "id": 1271,
                "alias": ["莱州"]
            },
            "蓬莱市": {
                "id": 1272,
                "alias": ["蓬莱"]
            },
            "招远市": {
                "id": 1273,
                "alias": ["招远"]
            },
            "栖霞市": {
                "id": 1274,
                "alias": ["栖霞"]
            },
            "海阳市": {
                "id": 1275,
                "alias": ["海阳"]
            },
            "烟台高新技术产业开发区": {
                "id": 3303,
                "alias": ["烟台高新技术产业开发"]
            },
            "烟台经济技术开发区": {
                "id": 3304,
                "alias": ["烟台经济技术开发"]
            }
        },
        "潍坊市": {
            "id": 141,
            "alias": ["潍坊"],
            "潍城区": {
                "id": 1276,
                "alias": ["潍城"]
            },
            "districts": ["潍城区", "寒亭区", "坊子区", "奎文区", "临朐县", "昌乐县", "青州市", "诸城市", "寿光市", "安丘市", "高密市", "昌邑市", "潍坊滨海经济技术开发区"],
            "寒亭区": {
                "id": 1277,
                "alias": ["寒亭"]
            },
            "坊子区": {
                "id": 1278,
                "alias": ["坊子"]
            },
            "奎文区": {
                "id": 1279,
                "alias": ["奎文"]
            },
            "临朐县": {
                "id": 1280,
                "alias": ["临朐"]
            },
            "昌乐县": {
                "id": 1281,
                "alias": ["昌乐"]
            },
            "青州市": {
                "id": 1282,
                "alias": ["青州"]
            },
            "诸城市": {
                "id": 1283,
                "alias": ["诸城"]
            },
            "寿光市": {
                "id": 1284,
                "alias": ["寿光"]
            },
            "安丘市": {
                "id": 1285,
                "alias": ["安丘"]
            },
            "高密市": {
                "id": 1286,
                "alias": ["高密"]
            },
            "昌邑市": {
                "id": 1287,
                "alias": ["昌邑"]
            },
            "潍坊滨海经济技术开发区": {
                "id": 3305,
                "alias": ["潍坊滨海经济技术开发"]
            }
        },
        "济宁市": {
            "id": 142,
            "alias": ["济宁"],
            "任城区": {
                "id": 1289,
                "alias": ["任城"]
            },
            "districts": ["任城区", "微山县", "鱼台县", "金乡县", "嘉祥县", "汶上县", "泗水县", "梁山县", "曲阜市", "兖州区", "邹城市", "济宁高新技术产业开发区"],
            "微山县": {
                "id": 1290,
                "alias": ["微山"]
            },
            "鱼台县": {
                "id": 1291,
                "alias": ["鱼台"]
            },
            "金乡县": {
                "id": 1292,
                "alias": ["金乡"]
            },
            "嘉祥县": {
                "id": 1293,
                "alias": ["嘉祥"]
            },
            "汶上县": {
                "id": 1294,
                "alias": ["汶上"]
            },
            "泗水县": {
                "id": 1295,
                "alias": ["泗水"]
            },
            "梁山县": {
                "id": 1296,
                "alias": ["梁山"]
            },
            "曲阜市": {
                "id": 1297,
                "alias": ["曲阜"]
            },
            "兖州区": {
                "id": 1298,
                "alias": ["兖州"]
            },
            "邹城市": {
                "id": 1299,
                "alias": ["邹城"]
            },
            "济宁高新技术产业开发区": {
                "id": 3306,
                "alias": ["济宁高新技术产业开发"]
            }
        },
        "泰安市": {
            "id": 143,
            "alias": ["泰安"],
            "泰山区": {
                "id": 1300,
                "alias": ["泰山"]
            },
            "districts": ["泰山区", "岱岳区", "宁阳县", "东平县", "新泰市", "肥城市"],
            "岱岳区": {
                "id": 1301,
                "alias": ["岱岳"]
            },
            "宁阳县": {
                "id": 1302,
                "alias": ["宁阳"]
            },
            "东平县": {
                "id": 1303,
                "alias": ["东平"]
            },
            "新泰市": {
                "id": 1304,
                "alias": ["新泰"]
            },
            "肥城市": {
                "id": 1305,
                "alias": ["肥城"]
            }
        },
        "威海市": {
            "id": 144,
            "alias": ["威海"],
            "环翠区": {
                "id": 1306,
                "alias": ["环翠"]
            },
            "districts": ["环翠区", "文登区", "荣成市", "乳山市", "威海火炬高技术产业开发区", "威海经济技术开发区", "威海临港经济技术开发区"],
            "文登区": {
                "id": 1307,
                "alias": ["文登"]
            },
            "荣成市": {
                "id": 1308,
                "alias": ["荣成"]
            },
            "乳山市": {
                "id": 1309,
                "alias": ["乳山"]
            },
            "威海火炬高技术产业开发区": {
                "id": 3307,
                "alias": ["威海火炬高技术产业开发"]
            },
            "威海经济技术开发区": {
                "id": 3308,
                "alias": ["威海经济技术开发"]
            },
            "威海临港经济技术开发区": {
                "id": 3309,
                "alias": ["威海临港经济技术开发"]
            }
        },
        "日照市": {
            "id": 145,
            "alias": ["日照"],
            "东港区": {
                "id": 1310,
                "alias": ["东港"]
            },
            "districts": ["东港区", "岚山区", "五莲县", "莒县", "日照经济技术开发区", "日照国际海洋城"],
            "岚山区": {
                "id": 1311,
                "alias": ["岚山"]
            },
            "五莲县": {
                "id": 1312,
                "alias": ["五莲"]
            },
            "莒县": {
                "id": 1313,
                "alias": []
            },
            "日照经济技术开发区": {
                "id": 3310,
                "alias": ["日照经济技术开发"]
            },
            "日照国际海洋城": {
                "id": 3311,
                "alias": []
            }
        },
        "莱芜市": {
            "id": 146,
            "alias": ["莱芜"],
            "莱城区": {
                "id": 1314,
                "alias": ["莱城"]
            },
            "districts": ["莱城区", "钢城区"],
            "钢城区": {
                "id": 1315,
                "alias": ["钢城"]
            }
        },
        "临沂市": {
            "id": 147,
            "alias": ["临沂"],
            "兰山区": {
                "id": 1316,
                "alias": ["兰山"]
            },
            "districts": ["兰山区", "罗庄区", "河东区", "沂南县", "郯城县", "沂水县", "费县", "平邑县", "莒南县", "蒙阴县", "临沭县", "兰陵县", "临沂高新技术产业开发区", "临沂经济技术开发区", "临沂临港经济开发区"],
            "罗庄区": {
                "id": 1317,
                "alias": ["罗庄"]
            },
            "河东区": {
                "id": 1318,
                "alias": ["河东"]
            },
            "沂南县": {
                "id": 1319,
                "alias": ["沂南"]
            },
            "郯城县": {
                "id": 1320,
                "alias": ["郯城"]
            },
            "沂水县": {
                "id": 1321,
                "alias": ["沂水"]
            },
            "费县": {
                "id": 1323,
                "alias": []
            },
            "平邑县": {
                "id": 1324,
                "alias": ["平邑"]
            },
            "莒南县": {
                "id": 1325,
                "alias": ["莒南"]
            },
            "蒙阴县": {
                "id": 1326,
                "alias": ["蒙阴"]
            },
            "临沭县": {
                "id": 1327,
                "alias": ["临沭"]
            },
            "兰陵县": {
                "id": 3312,
                "alias": ["兰陵"]
            },
            "临沂高新技术产业开发区": {
                "id": 3313,
                "alias": ["临沂高新技术产业开发"]
            },
            "临沂经济技术开发区": {
                "id": 3314,
                "alias": ["临沂经济技术开发"]
            },
            "临沂临港经济开发区": {
                "id": 3315,
                "alias": ["临沂临港经济开发"]
            }
        },
        "德州市": {
            "id": 148,
            "alias": ["德州"],
            "德城区": {
                "id": 1328,
                "alias": ["德城"]
            },
            "districts": ["德城区", "宁津县", "庆云县", "临邑县", "齐河县", "平原县", "夏津县", "武城县", "乐陵市", "禹城市", "陵城区", "德州经济技术开发区", "德州运河经济开发区"],
            "宁津县": {
                "id": 1330,
                "alias": ["宁津"]
            },
            "庆云县": {
                "id": 1331,
                "alias": ["庆云"]
            },
            "临邑县": {
                "id": 1332,
                "alias": ["临邑"]
            },
            "齐河县": {
                "id": 1333,
                "alias": ["齐河"]
            },
            "平原县": {
                "id": 1334,
                "alias": ["平原"]
            },
            "夏津县": {
                "id": 1335,
                "alias": ["夏津"]
            },
            "武城县": {
                "id": 1336,
                "alias": ["武城"]
            },
            "乐陵市": {
                "id": 1337,
                "alias": ["乐陵"]
            },
            "禹城市": {
                "id": 1338,
                "alias": ["禹城"]
            },
            "陵城区": {
                "id": 3316,
                "alias": ["陵城"]
            },
            "德州经济技术开发区": {
                "id": 3317,
                "alias": ["德州经济技术开发"]
            },
            "德州运河经济开发区": {
                "id": 3318,
                "alias": ["德州运河经济开发"]
            }
        },
        "聊城市": {
            "id": 149,
            "alias": ["聊城"],
            "东昌府区": {
                "id": 1339,
                "alias": ["东昌府"]
            },
            "districts": ["东昌府区", "阳谷县", "莘县", "茌平县", "东阿县", "冠县", "高唐县", "临清市"],
            "阳谷县": {
                "id": 1340,
                "alias": ["阳谷"]
            },
            "莘县": {
                "id": 1341,
                "alias": []
            },
            "茌平县": {
                "id": 1342,
                "alias": ["茌平"]
            },
            "东阿县": {
                "id": 1343,
                "alias": ["东阿"]
            },
            "冠县": {
                "id": 1344,
                "alias": []
            },
            "高唐县": {
                "id": 1345,
                "alias": ["高唐"]
            },
            "临清市": {
                "id": 1346,
                "alias": ["临清"]
            }
        },
        "滨州市": {
            "id": 150,
            "alias": ["滨州"],
            "滨城区": {
                "id": 1347,
                "alias": ["滨城"]
            },
            "districts": ["滨城区", "惠民县", "阳信县", "无棣县", "沾化区", "博兴县", "邹平县"],
            "惠民县": {
                "id": 1348,
                "alias": ["惠民"]
            },
            "阳信县": {
                "id": 1349,
                "alias": ["阳信"]
            },
            "无棣县": {
                "id": 1350,
                "alias": ["无棣"]
            },
            "沾化区": {
                "id": 1351,
                "alias": ["沾化"]
            },
            "博兴县": {
                "id": 1352,
                "alias": ["博兴"]
            },
            "邹平县": {
                "id": 1353,
                "alias": ["邹平"]
            }
        },
        "菏泽市": {
            "id": 151,
            "alias": ["菏泽"],
            "牡丹区": {
                "id": 1354,
                "alias": ["牡丹"]
            },
            "districts": ["牡丹区", "曹县", "单县", "成武县", "巨野县", "郓城县", "鄄城县", "定陶区", "东明县", "菏泽经济技术开发区", "菏泽高新技术开发区"],
            "曹县": {
                "id": 1355,
                "alias": []
            },
            "单县": {
                "id": 1356,
                "alias": []
            },
            "成武县": {
                "id": 1357,
                "alias": ["成武"]
            },
            "巨野县": {
                "id": 1358,
                "alias": ["巨野"]
            },
            "郓城县": {
                "id": 1359,
                "alias": ["郓城"]
            },
            "鄄城县": {
                "id": 1360,
                "alias": ["鄄城"]
            },
            "定陶区": {
                "id": 1361,
                "alias": ["定陶"]
            },
            "东明县": {
                "id": 1362,
                "alias": ["东明"]
            },
            "菏泽经济技术开发区": {
                "id": 3319,
                "alias": ["菏泽经济技术开发"]
            },
            "菏泽高新技术开发区": {
                "id": 3320,
                "alias": ["菏泽高新技术开发"]
            }
        }
    },
    "河南省": {
        "alias": ["河南"],
        "id": 16,
        "cities": ["郑州市", "开封市", "洛阳市", "平顶山市", "安阳市", "鹤壁市", "新乡市", "焦作市", "濮阳市", "许昌市", "漯河市", "三门峡市", "南阳市", "商丘市", "信阳市", "周口市", "驻马店市"],
        "郑州市": {
            "id": 152,
            "alias": ["郑州"],
            "中原区": {
                "id": 1363,
                "alias": ["中原"]
            },
            "districts": ["中原区", "二七区", "管城回族区", "金水区", "上街区", "惠济区", "中牟县", "巩义市", "荥阳市", "新密市", "新郑市", "登封市", "郑州经济技术开发区", "郑州高新技术产业开发区", "郑州航空港经济综合实验区"],
            "二七区": {
                "id": 1364,
                "alias": ["二七"]
            },
            "管城回族区": {
                "id": 1365,
                "alias": ["管城"]
            },
            "金水区": {
                "id": 1366,
                "alias": ["金水"]
            },
            "上街区": {
                "id": 1367,
                "alias": ["上街"]
            },
            "惠济区": {
                "id": 1368,
                "alias": ["惠济"]
            },
            "中牟县": {
                "id": 1369,
                "alias": ["中牟"]
            },
            "巩义市": {
                "id": 1370,
                "alias": ["巩义"]
            },
            "荥阳市": {
                "id": 1371,
                "alias": ["荥阳"]
            },
            "新密市": {
                "id": 1372,
                "alias": ["新密"]
            },
            "新郑市": {
                "id": 1373,
                "alias": ["新郑"]
            },
            "登封市": {
                "id": 1374,
                "alias": ["登封"]
            },
            "郑州经济技术开发区": {
                "id": 3446,
                "alias": ["郑州经济技术开发"]
            },
            "郑州高新技术产业开发区": {
                "id": 3447,
                "alias": ["郑州高新技术产业开发"]
            },
            "郑州航空港经济综合实验区": {
                "id": 3448,
                "alias": ["郑州航空港经济综合实验"]
            }
        },
        "开封市": {
            "id": 153,
            "alias": ["开封"],
            "龙亭区": {
                "id": 1375,
                "alias": ["龙亭"]
            },
            "districts": ["龙亭区", "顺河回族区", "鼓楼区", "杞县", "通许县", "尉氏县", "兰考县", "禹王台区", "祥符区"],
            "顺河回族区": {
                "id": 1376,
                "alias": ["顺河"]
            },
            "鼓楼区": {
                "id": 1377,
                "alias": ["鼓楼"]
            },
            "杞县": {
                "id": 1380,
                "alias": []
            },
            "通许县": {
                "id": 1381,
                "alias": ["通许"]
            },
            "尉氏县": {
                "id": 1382,
                "alias": ["尉氏"]
            },
            "兰考县": {
                "id": 1384,
                "alias": ["兰考"]
            },
            "禹王台区": {
                "id": 3449,
                "alias": ["禹王台"]
            },
            "祥符区": {
                "id": 3450,
                "alias": ["祥符"]
            }
        },
        "洛阳市": {
            "id": 154,
            "alias": ["洛阳"],
            "老城区": {
                "id": 1385,
                "alias": ["老城"]
            },
            "districts": ["老城区", "西工区", "涧西区", "吉利区", "洛龙区", "孟津县", "新安县", "栾川县", "嵩县", "汝阳县", "宜阳县", "洛宁县", "伊川县", "偃师市", "瀍河回族区", "洛阳高新技术产业开发区"],
            "西工区": {
                "id": 1386,
                "alias": ["西工"]
            },
            "涧西区": {
                "id": 1388,
                "alias": ["涧西"]
            },
            "吉利区": {
                "id": 1389,
                "alias": ["吉利"]
            },
            "洛龙区": {
                "id": 1390,
                "alias": ["洛龙"]
            },
            "孟津县": {
                "id": 1391,
                "alias": ["孟津"]
            },
            "新安县": {
                "id": 1392,
                "alias": ["新安"]
            },
            "栾川县": {
                "id": 1393,
                "alias": ["栾川"]
            },
            "嵩县": {
                "id": 1394,
                "alias": []
            },
            "汝阳县": {
                "id": 1395,
                "alias": ["汝阳"]
            },
            "宜阳县": {
                "id": 1396,
                "alias": ["宜阳"]
            },
            "洛宁县": {
                "id": 1397,
                "alias": ["洛宁"]
            },
            "伊川县": {
                "id": 1398,
                "alias": ["伊川"]
            },
            "偃师市": {
                "id": 1399,
                "alias": ["偃师"]
            },
            "瀍河回族区": {
                "id": 3451,
                "alias": ["瀍河"]
            },
            "洛阳高新技术产业开发区": {
                "id": 3452,
                "alias": ["洛阳高新技术产业开发"]
            }
        },
        "平顶山市": {
            "id": 155,
            "alias": ["平顶山"],
            "新华区": {
                "id": 1400,
                "alias": ["新华"]
            },
            "districts": ["新华区", "卫东区", "石龙区", "湛河区", "宝丰县", "叶县", "鲁山县", "郏县", "舞钢市", "汝州市", "平顶山高新技术产业开发区", "平顶山市新城区"],
            "卫东区": {
                "id": 1401,
                "alias": ["卫东"]
            },
            "石龙区": {
                "id": 1402,
                "alias": ["石龙"]
            },
            "湛河区": {
                "id": 1403,
                "alias": ["湛河"]
            },
            "宝丰县": {
                "id": 1404,
                "alias": ["宝丰"]
            },
            "叶县": {
                "id": 1405,
                "alias": []
            },
            "鲁山县": {
                "id": 1406,
                "alias": ["鲁山"]
            },
            "郏县": {
                "id": 1407,
                "alias": []
            },
            "舞钢市": {
                "id": 1408,
                "alias": ["舞钢"]
            },
            "汝州市": {
                "id": 1409,
                "alias": ["汝州"]
            },
            "平顶山高新技术产业开发区": {
                "id": 3453,
                "alias": ["平顶山高新技术产业开发"]
            },
            "平顶山市新城区": {
                "id": 3454,
                "alias": ["平顶山市新城"]
            }
        },
        "安阳市": {
            "id": 156,
            "alias": ["安阳"],
            "文峰区": {
                "id": 1410,
                "alias": ["文峰"]
            },
            "districts": ["文峰区", "北关区", "殷都区", "龙安区", "安阳县", "汤阴县", "滑县", "内黄县", "林州市", "安阳高新技术产业开发区"],
            "北关区": {
                "id": 1411,
                "alias": ["北关"]
            },
            "殷都区": {
                "id": 1412,
                "alias": ["殷都"]
            },
            "龙安区": {
                "id": 1413,
                "alias": ["龙安"]
            },
            "安阳县": {
                "id": 1414,
                "alias": ["安阳"]
            },
            "汤阴县": {
                "id": 1415,
                "alias": ["汤阴"]
            },
            "滑县": {
                "id": 1416,
                "alias": []
            },
            "内黄县": {
                "id": 1417,
                "alias": ["内黄"]
            },
            "林州市": {
                "id": 1418,
                "alias": ["林州"]
            },
            "安阳高新技术产业开发区": {
                "id": 3455,
                "alias": ["安阳高新技术产业开发"]
            }
        },
        "鹤壁市": {
            "id": 157,
            "alias": ["鹤壁"],
            "鹤山区": {
                "id": 1419,
                "alias": ["鹤山"]
            },
            "districts": ["鹤山区", "山城区", "淇滨区", "浚县", "淇县", "鹤壁经济技术开发区"],
            "山城区": {
                "id": 1420,
                "alias": ["山城"]
            },
            "淇滨区": {
                "id": 1421,
                "alias": ["淇滨"]
            },
            "浚县": {
                "id": 1422,
                "alias": []
            },
            "淇县": {
                "id": 1423,
                "alias": []
            },
            "鹤壁经济技术开发区": {
                "id": 3456,
                "alias": ["鹤壁经济技术开发"]
            }
        },
        "新乡市": {
            "id": 158,
            "alias": ["新乡"],
            "红旗区": {
                "id": 1424,
                "alias": ["红区"]
            },
            "districts": ["红旗区", "卫滨区", "凤泉区", "牧野区", "新乡县", "获嘉县", "原阳县", "延津县", "封丘县", "长垣县", "卫辉市", "辉县市", "新乡高新技术产业开发区", "新乡经济技术开发区", "新乡市平原城乡一体化示范区"],
            "卫滨区": {
                "id": 1425,
                "alias": ["卫滨"]
            },
            "凤泉区": {
                "id": 1426,
                "alias": ["凤泉"]
            },
            "牧野区": {
                "id": 1427,
                "alias": ["牧野"]
            },
            "新乡县": {
                "id": 1428,
                "alias": ["新乡"]
            },
            "获嘉县": {
                "id": 1429,
                "alias": ["获嘉"]
            },
            "原阳县": {
                "id": 1430,
                "alias": ["原阳"]
            },
            "延津县": {
                "id": 1431,
                "alias": ["延津"]
            },
            "封丘县": {
                "id": 1432,
                "alias": ["封丘"]
            },
            "长垣县": {
                "id": 1433,
                "alias": ["长垣"]
            },
            "卫辉市": {
                "id": 1434,
                "alias": ["卫辉"]
            },
            "辉县市": {
                "id": 1435,
                "alias": ["辉市"]
            },
            "新乡高新技术产业开发区": {
                "id": 3457,
                "alias": ["新乡高新技术产业开发"]
            },
            "新乡经济技术开发区": {
                "id": 3458,
                "alias": ["新乡经济技术开发"]
            },
            "新乡市平原城乡一体化示范区": {
                "id": 3459,
                "alias": ["新乡市平原城乡一体化示范"]
            }
        },
        "焦作市": {
            "id": 159,
            "alias": ["焦作"],
            "解放区": {
                "id": 1436,
                "alias": ["解放"]
            },
            "districts": ["解放区", "中站区", "马村区", "山阳区", "修武县", "博爱县", "武陟县", "温县", "沁阳市", "孟州市", "焦作城乡一体化示范区"],
            "中站区": {
                "id": 1437,
                "alias": ["中站"]
            },
            "马村区": {
                "id": 1438,
                "alias": ["马村"]
            },
            "山阳区": {
                "id": 1439,
                "alias": ["山阳"]
            },
            "修武县": {
                "id": 1440,
                "alias": ["修武"]
            },
            "博爱县": {
                "id": 1441,
                "alias": ["博爱"]
            },
            "武陟县": {
                "id": 1442,
                "alias": ["武陟"]
            },
            "温县": {
                "id": 1443,
                "alias": []
            },
            "沁阳市": {
                "id": 1445,
                "alias": ["沁阳"]
            },
            "孟州市": {
                "id": 1446,
                "alias": ["孟州"]
            },
            "焦作城乡一体化示范区": {
                "id": 3460,
                "alias": ["焦作城乡一体化示范"]
            }
        },
        "濮阳市": {
            "id": 160,
            "alias": ["濮阳"],
            "华龙区": {
                "id": 1447,
                "alias": ["华龙"]
            },
            "districts": ["华龙区", "清丰县", "南乐县", "范县", "台前县", "濮阳县", "河南濮阳工业园区", "濮阳经济技术开发区"],
            "清丰县": {
                "id": 1448,
                "alias": ["清丰"]
            },
            "南乐县": {
                "id": 1449,
                "alias": ["南乐"]
            },
            "范县": {
                "id": 1450,
                "alias": []
            },
            "台前县": {
                "id": 1451,
                "alias": ["台前"]
            },
            "濮阳县": {
                "id": 1452,
                "alias": ["濮阳"]
            },
            "河南濮阳工业园区": {
                "id": 3461,
                "alias": ["河南濮阳工业园"]
            },
            "濮阳经济技术开发区": {
                "id": 3462,
                "alias": ["濮阳经济技术开发"]
            }
        },
        "许昌市": {
            "id": 161,
            "alias": ["许昌"],
            "魏都区": {
                "id": 1453,
                "alias": ["魏都"]
            },
            "districts": ["魏都区", "许昌经济技术开发区", "鄢陵县", "襄城县", "禹州市", "长葛市", "建安区"],
            "许昌经济技术开发区": {
                "id": 1454,
                "alias": ["许昌经济技术开发"]
            },
            "鄢陵县": {
                "id": 1455,
                "alias": ["鄢陵"]
            },
            "襄城县": {
                "id": 1456,
                "alias": ["襄城"]
            },
            "禹州市": {
                "id": 1457,
                "alias": ["禹州"]
            },
            "长葛市": {
                "id": 1458,
                "alias": ["长葛"]
            },
            "建安区": {
                "id": 3463,
                "alias": ["建安"]
            }
        },
        "漯河市": {
            "id": 162,
            "alias": ["漯河"],
            "源汇区": {
                "id": 1459,
                "alias": ["源汇"]
            },
            "districts": ["源汇区", "郾城区", "召陵区", "舞阳县", "临颍县", "漯河经济技术开发区"],
            "郾城区": {
                "id": 1460,
                "alias": ["郾城"]
            },
            "召陵区": {
                "id": 1461,
                "alias": ["召陵"]
            },
            "舞阳县": {
                "id": 1462,
                "alias": ["舞阳"]
            },
            "临颍县": {
                "id": 1463,
                "alias": ["临颍"]
            },
            "漯河经济技术开发区": {
                "id": 3464,
                "alias": ["漯河经济技术开发"]
            }
        },
        "三门峡市": {
            "id": 163,
            "alias": ["三门峡"],
            "市辖区": {
                "id": 1464,
                "alias": ["市辖"]
            },
            "districts": ["市辖区", "湖滨区", "渑池县", "卢氏县", "义马市", "灵宝市", "陕州区", "河南三门峡经济开发区"],
            "湖滨区": {
                "id": 1465,
                "alias": ["湖滨"]
            },
            "渑池县": {
                "id": 1466,
                "alias": ["渑池"]
            },
            "卢氏县": {
                "id": 1468,
                "alias": ["卢氏"]
            },
            "义马市": {
                "id": 1469,
                "alias": ["义马"]
            },
            "灵宝市": {
                "id": 1470,
                "alias": ["灵宝"]
            },
            "陕州区": {
                "id": 3465,
                "alias": ["陕州"]
            },
            "河南三门峡经济开发区": {
                "id": 3466,
                "alias": ["河南三门峡经济开发"]
            }
        },
        "南阳市": {
            "id": 164,
            "alias": ["南阳"],
            "宛城区": {
                "id": 1471,
                "alias": ["宛城"]
            },
            "districts": ["宛城区", "卧龙区", "南召县", "方城县", "西峡县", "镇平县", "内乡县", "淅川县", "社旗县", "唐河县", "新野县", "桐柏县", "邓州市", "南阳高新技术产业开发区", "南阳市城乡一体化示范区"],
            "卧龙区": {
                "id": 1472,
                "alias": ["卧龙"]
            },
            "南召县": {
                "id": 1473,
                "alias": ["南召"]
            },
            "方城县": {
                "id": 1474,
                "alias": ["方城"]
            },
            "西峡县": {
                "id": 1475,
                "alias": ["西峡"]
            },
            "镇平县": {
                "id": 1476,
                "alias": ["镇平"]
            },
            "内乡县": {
                "id": 1477,
                "alias": ["内乡"]
            },
            "淅川县": {
                "id": 1478,
                "alias": ["淅川"]
            },
            "社旗县": {
                "id": 1479,
                "alias": ["社县"]
            },
            "唐河县": {
                "id": 1480,
                "alias": ["唐河"]
            },
            "新野县": {
                "id": 1481,
                "alias": ["新野"]
            },
            "桐柏县": {
                "id": 1482,
                "alias": ["桐柏"]
            },
            "邓州市": {
                "id": 1483,
                "alias": ["邓州"]
            },
            "南阳高新技术产业开发区": {
                "id": 3467,
                "alias": ["南阳高新技术产业开发"]
            },
            "南阳市城乡一体化示范区": {
                "id": 3468,
                "alias": ["南阳市城乡一体化示范"]
            }
        },
        "商丘市": {
            "id": 165,
            "alias": ["商丘"],
            "梁园区": {
                "id": 1484,
                "alias": ["梁园"]
            },
            "districts": ["梁园区", "睢阳区", "民权县", "睢县", "宁陵县", "柘城县", "虞城县", "夏邑县", "永城市", "豫东综合物流产业聚集区", "河南商丘经济开发区"],
            "睢阳区": {
                "id": 1485,
                "alias": ["睢阳"]
            },
            "民权县": {
                "id": 1486,
                "alias": ["民权"]
            },
            "睢县": {
                "id": 1487,
                "alias": []
            },
            "宁陵县": {
                "id": 1488,
                "alias": ["宁陵"]
            },
            "柘城县": {
                "id": 1489,
                "alias": ["柘城"]
            },
            "虞城县": {
                "id": 1490,
                "alias": ["虞城"]
            },
            "夏邑县": {
                "id": 1491,
                "alias": ["夏邑"]
            },
            "永城市": {
                "id": 1492,
                "alias": ["永城"]
            },
            "豫东综合物流产业聚集区": {
                "id": 3469,
                "alias": ["豫东综合物流产业聚集"]
            },
            "河南商丘经济开发区": {
                "id": 3470,
                "alias": ["河南商丘经济开发"]
            }
        },
        "信阳市": {
            "id": 166,
            "alias": ["信阳"],
            "浉河区": {
                "id": 1493,
                "alias": ["浉河"]
            },
            "districts": ["浉河区", "平桥区", "罗山县", "光山县", "新县", "商城县", "固始县", "潢川县", "淮滨县", "息县", "信阳高新技术产业开发区"],
            "平桥区": {
                "id": 1494,
                "alias": ["平桥"]
            },
            "罗山县": {
                "id": 1495,
                "alias": ["罗山"]
            },
            "光山县": {
                "id": 1496,
                "alias": ["光山"]
            },
            "新县": {
                "id": 1497,
                "alias": []
            },
            "商城县": {
                "id": 1498,
                "alias": ["商城"]
            },
            "固始县": {
                "id": 1499,
                "alias": ["固始"]
            },
            "潢川县": {
                "id": 1500,
                "alias": ["潢川"]
            },
            "淮滨县": {
                "id": 1501,
                "alias": ["淮滨"]
            },
            "息县": {
                "id": 1502,
                "alias": []
            },
            "信阳高新技术产业开发区": {
                "id": 3471,
                "alias": ["信阳高新技术产业开发"]
            }
        },
        "周口市": {
            "id": 167,
            "alias": ["周口"],
            "川汇区": {
                "id": 1503,
                "alias": ["川汇"]
            },
            "districts": ["川汇区", "扶沟县", "西华县", "商水县", "沈丘县", "郸城县", "淮阳县", "太康县", "鹿邑县", "项城市", "河南周口经济开发区"],
            "扶沟县": {
                "id": 1504,
                "alias": ["扶沟"]
            },
            "西华县": {
                "id": 1505,
                "alias": ["西华"]
            },
            "商水县": {
                "id": 1506,
                "alias": ["商水"]
            },
            "沈丘县": {
                "id": 1507,
                "alias": ["沈丘"]
            },
            "郸城县": {
                "id": 1508,
                "alias": ["郸城"]
            },
            "淮阳县": {
                "id": 1509,
                "alias": ["淮阳"]
            },
            "太康县": {
                "id": 1510,
                "alias": ["太康"]
            },
            "鹿邑县": {
                "id": 1511,
                "alias": ["鹿邑"]
            },
            "项城市": {
                "id": 1512,
                "alias": ["项城"]
            },
            "河南周口经济开发区": {
                "id": 3472,
                "alias": ["河南周口经济开发"]
            }
        },
        "驻马店市": {
            "id": 168,
            "alias": ["驻马店"],
            "驿城区": {
                "id": 1513,
                "alias": ["驿城"]
            },
            "districts": ["驿城区", "西平县", "上蔡县", "平舆县", "正阳县", "确山县", "泌阳县", "汝南县", "遂平县", "新蔡县", "河南驻马店经济开发区"],
            "西平县": {
                "id": 1514,
                "alias": ["西平"]
            },
            "上蔡县": {
                "id": 1515,
                "alias": ["上蔡"]
            },
            "平舆县": {
                "id": 1516,
                "alias": ["平舆"]
            },
            "正阳县": {
                "id": 1517,
                "alias": ["正阳"]
            },
            "确山县": {
                "id": 1518,
                "alias": ["确山"]
            },
            "泌阳县": {
                "id": 1519,
                "alias": ["泌阳"]
            },
            "汝南县": {
                "id": 1520,
                "alias": ["汝南"]
            },
            "遂平县": {
                "id": 1521,
                "alias": ["遂平"]
            },
            "新蔡县": {
                "id": 1522,
                "alias": ["新蔡"]
            },
            "河南驻马店经济开发区": {
                "id": 3473,
                "alias": ["河南驻马店经济开发"]
            }
        }
    },
    "湖北省": {
        "alias": ["湖北"],
        "id": 17,
        "cities": ["武汉市", "黄石市", "十堰市", "宜昌市", "襄阳市", "鄂州市", "荆门市", "孝感市", "荆州市", "黄冈市", "咸宁市", "随州市", "恩施土家族苗族自治州", "神农架"],
        "武汉市": {
            "id": 169,
            "alias": ["武汉"],
            "江岸区": {
                "id": 1523,
                "alias": ["江岸"]
            },
            "districts": ["江岸区", "江汉区", "硚口区", "汉阳区", "武昌区", "青山区", "洪山区", "东西湖区", "汉南区", "蔡甸区", "江夏区", "黄陂区", "新洲区"],
            "江汉区": {
                "id": 1524,
                "alias": ["江汉"]
            },
            "硚口区": {
                "id": 1525,
                "alias": ["硚口"]
            },
            "汉阳区": {
                "id": 1526,
                "alias": ["汉阳"]
            },
            "武昌区": {
                "id": 1527,
                "alias": ["武昌"]
            },
            "青山区": {
                "id": 1528,
                "alias": ["青山"]
            },
            "洪山区": {
                "id": 1529,
                "alias": ["洪山"]
            },
            "东西湖区": {
                "id": 1530,
                "alias": ["东西湖"]
            },
            "汉南区": {
                "id": 1531,
                "alias": ["汉南"]
            },
            "蔡甸区": {
                "id": 1532,
                "alias": ["蔡甸"]
            },
            "江夏区": {
                "id": 1533,
                "alias": ["江夏"]
            },
            "黄陂区": {
                "id": 1534,
                "alias": ["黄陂"]
            },
            "新洲区": {
                "id": 1535,
                "alias": ["新洲"]
            }
        },
        "黄石市": {
            "id": 170,
            "alias": ["黄石"],
            "黄石港区": {
                "id": 1536,
                "alias": ["黄石港"]
            },
            "districts": ["黄石港区", "西塞山区", "下陆区", "铁山区", "阳新县", "大冶市"],
            "西塞山区": {
                "id": 1537,
                "alias": ["西塞山"]
            },
            "下陆区": {
                "id": 1538,
                "alias": ["下陆"]
            },
            "铁山区": {
                "id": 1539,
                "alias": ["铁山"]
            },
            "阳新县": {
                "id": 1540,
                "alias": ["阳新"]
            },
            "大冶市": {
                "id": 1541,
                "alias": ["大冶"]
            }
        },
        "十堰市": {
            "id": 171,
            "alias": ["十堰"],
            "茅箭区": {
                "id": 1542,
                "alias": ["茅箭"]
            },
            "districts": ["茅箭区", "张湾区", "郧西县", "竹山县", "竹溪县", "房县", "丹江口市", "郧阳区"],
            "张湾区": {
                "id": 1543,
                "alias": ["张湾"]
            },
            "郧西县": {
                "id": 1545,
                "alias": ["郧西"]
            },
            "竹山县": {
                "id": 1546,
                "alias": ["竹山"]
            },
            "竹溪县": {
                "id": 1547,
                "alias": ["竹溪"]
            },
            "房县": {
                "id": 1548,
                "alias": []
            },
            "丹江口市": {
                "id": 1549,
                "alias": ["丹江口"]
            },
            "郧阳区": {
                "id": 3502,
                "alias": ["郧阳"]
            }
        },
        "宜昌市": {
            "id": 172,
            "alias": ["宜昌"],
            "西陵区": {
                "id": 1550,
                "alias": ["西陵"]
            },
            "districts": ["西陵区", "伍家岗区", "点军区", "猇亭区", "夷陵区", "远安县", "兴山县", "秭归县", "长阳土家族自治县", "五峰土家族自治县", "宜都市", "当阳市", "枝江市"],
            "伍家岗区": {
                "id": 1551,
                "alias": ["伍家岗"]
            },
            "点军区": {
                "id": 1552,
                "alias": ["点军"]
            },
            "猇亭区": {
                "id": 1553,
                "alias": ["猇亭"]
            },
            "夷陵区": {
                "id": 1554,
                "alias": ["夷陵"]
            },
            "远安县": {
                "id": 1555,
                "alias": ["远安"]
            },
            "兴山县": {
                "id": 1556,
                "alias": ["兴山"]
            },
            "秭归县": {
                "id": 1557,
                "alias": ["秭归"]
            },
            "长阳土家族自治县": {
                "id": 1558,
                "alias": ["长阳"]
            },
            "五峰土家族自治县": {
                "id": 1559,
                "alias": ["五峰"]
            },
            "宜都市": {
                "id": 1560,
                "alias": ["宜都"]
            },
            "当阳市": {
                "id": 1561,
                "alias": ["当阳"]
            },
            "枝江市": {
                "id": 1562,
                "alias": ["枝江"]
            }
        },
        "襄阳市": {
            "id": 173,
            "alias": ["襄阳"],
            "襄城区": {
                "id": 1563,
                "alias": ["襄城"]
            },
            "districts": ["襄城区", "樊城区", "南漳县", "谷城县", "保康县", "老河口市", "枣阳市", "宜城市", "襄州区"],
            "樊城区": {
                "id": 1564,
                "alias": ["樊城"]
            },
            "南漳县": {
                "id": 1566,
                "alias": ["南漳"]
            },
            "谷城县": {
                "id": 1567,
                "alias": ["谷城"]
            },
            "保康县": {
                "id": 1568,
                "alias": ["保康"]
            },
            "老河口市": {
                "id": 1569,
                "alias": ["老河口"]
            },
            "枣阳市": {
                "id": 1570,
                "alias": ["枣阳"]
            },
            "宜城市": {
                "id": 1571,
                "alias": ["宜城"]
            },
            "襄州区": {
                "id": 3503,
                "alias": ["襄州"]
            }
        },
        "鄂州市": {
            "id": 174,
            "alias": ["鄂州"],
            "梁子湖区": {
                "id": 1572,
                "alias": ["梁子湖"]
            },
            "districts": ["梁子湖区", "华容区", "鄂城区"],
            "华容区": {
                "id": 1573,
                "alias": ["华容"]
            },
            "鄂城区": {
                "id": 1574,
                "alias": ["鄂城"]
            }
        },
        "荆门市": {
            "id": 175,
            "alias": ["荆门"],
            "东宝区": {
                "id": 1575,
                "alias": ["东宝"]
            },
            "districts": ["东宝区", "掇刀区", "京山县", "沙洋县", "钟祥市"],
            "掇刀区": {
                "id": 1576,
                "alias": ["掇刀"]
            },
            "京山县": {
                "id": 1577,
                "alias": ["京山"]
            },
            "沙洋县": {
                "id": 1578,
                "alias": ["沙洋"]
            },
            "钟祥市": {
                "id": 1579,
                "alias": ["钟祥"]
            }
        },
        "孝感市": {
            "id": 176,
            "alias": ["孝感"],
            "孝南区": {
                "id": 1580,
                "alias": ["孝南"]
            },
            "districts": ["孝南区", "孝昌县", "大悟县", "云梦县", "应城市", "安陆市", "汉川市"],
            "孝昌县": {
                "id": 1581,
                "alias": ["孝昌"]
            },
            "大悟县": {
                "id": 1582,
                "alias": ["大悟"]
            },
            "云梦县": {
                "id": 1583,
                "alias": ["云梦"]
            },
            "应城市": {
                "id": 1584,
                "alias": ["应城"]
            },
            "安陆市": {
                "id": 1585,
                "alias": ["安陆"]
            },
            "汉川市": {
                "id": 1586,
                "alias": ["汉川"]
            }
        },
        "荆州市": {
            "id": 177,
            "alias": ["荆州"],
            "沙市区": {
                "id": 1587,
                "alias": ["沙市"]
            },
            "districts": ["沙市区", "荆州区", "公安县", "监利县", "江陵县", "石首市", "洪湖市", "松滋市", "荆州经济技术开发区"],
            "荆州区": {
                "id": 1588,
                "alias": ["荆州"]
            },
            "公安县": {
                "id": 1589,
                "alias": ["公安"]
            },
            "监利县": {
                "id": 1590,
                "alias": ["监利"]
            },
            "江陵县": {
                "id": 1591,
                "alias": ["江陵"]
            },
            "石首市": {
                "id": 1592,
                "alias": ["石首"]
            },
            "洪湖市": {
                "id": 1593,
                "alias": ["洪湖"]
            },
            "松滋市": {
                "id": 1594,
                "alias": ["松滋"]
            },
            "荆州经济技术开发区": {
                "id": 3504,
                "alias": ["荆州经济技术开发"]
            }
        },
        "黄冈市": {
            "id": 178,
            "alias": ["黄冈"],
            "黄州区": {
                "id": 1595,
                "alias": ["黄州"]
            },
            "districts": ["黄州区", "团风县", "红安县", "罗田县", "英山县", "浠水县", "蕲春县", "黄梅县", "麻城市", "武穴市", "龙感湖管理区"],
            "团风县": {
                "id": 1596,
                "alias": ["团风"]
            },
            "红安县": {
                "id": 1597,
                "alias": ["红安"]
            },
            "罗田县": {
                "id": 1598,
                "alias": ["罗田"]
            },
            "英山县": {
                "id": 1599,
                "alias": ["英山"]
            },
            "浠水县": {
                "id": 1600,
                "alias": ["浠水"]
            },
            "蕲春县": {
                "id": 1601,
                "alias": ["蕲春"]
            },
            "黄梅县": {
                "id": 1602,
                "alias": ["黄梅"]
            },
            "麻城市": {
                "id": 1603,
                "alias": ["麻城"]
            },
            "武穴市": {
                "id": 1604,
                "alias": ["武穴"]
            },
            "龙感湖管理区": {
                "id": 3505,
                "alias": ["龙感湖管理"]
            }
        },
        "咸宁市": {
            "id": 179,
            "alias": ["咸宁"],
            "咸安区": {
                "id": 1605,
                "alias": ["咸安"]
            },
            "districts": ["咸安区", "嘉鱼县", "通城县", "崇阳县", "通山县", "赤壁市"],
            "嘉鱼县": {
                "id": 1606,
                "alias": ["嘉鱼"]
            },
            "通城县": {
                "id": 1607,
                "alias": ["通城"]
            },
            "崇阳县": {
                "id": 1608,
                "alias": ["崇阳"]
            },
            "通山县": {
                "id": 1609,
                "alias": ["通山"]
            },
            "赤壁市": {
                "id": 1610,
                "alias": ["赤壁"]
            }
        },
        "随州市": {
            "id": 180,
            "alias": ["随州"],
            "曾都区": {
                "id": 1611,
                "alias": ["曾都"]
            },
            "districts": ["曾都区", "广水市", "随县"],
            "广水市": {
                "id": 1612,
                "alias": ["广水"]
            },
            "随县": {
                "id": 3506,
                "alias": []
            }
        },
        "恩施土家族苗族自治州": {
            "id": 181,
            "alias": ["恩施"],
            "恩施市": {
                "id": 1613,
                "alias": ["恩施"]
            },
            "districts": ["恩施市", "利川市", "建始县", "巴东县", "宣恩县", "咸丰县", "来凤县", "鹤峰县"],
            "利川市": {
                "id": 1614,
                "alias": ["利川"]
            },
            "建始县": {
                "id": 1615,
                "alias": ["建始"]
            },
            "巴东县": {
                "id": 1616,
                "alias": ["巴东"]
            },
            "宣恩县": {
                "id": 1617,
                "alias": ["宣恩"]
            },
            "咸丰县": {
                "id": 1618,
                "alias": ["咸丰"]
            },
            "来凤县": {
                "id": 1619,
                "alias": ["来凤"]
            },
            "鹤峰县": {
                "id": 1620,
                "alias": ["鹤峰"]
            }
        },
        "神农架": {
            "id": 182,
            "alias": []
        }
    },
    "湖南省": {
        "alias": ["湖南"],
        "id": 18,
        "cities": ["长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "益阳市", "郴州市", "永州市", "怀化市", "娄底市", "湘西土家族苗族自治州"],
        "长沙市": {
            "id": 183,
            "alias": ["长沙"],
            "芙蓉区": {
                "id": 1625,
                "alias": ["芙蓉"]
            },
            "districts": ["芙蓉区", "天心区", "岳麓区", "开福区", "雨花区", "长沙县", "望城区", "宁乡市", "浏阳市"],
            "天心区": {
                "id": 1626,
                "alias": ["天心"]
            },
            "岳麓区": {
                "id": 1627,
                "alias": ["岳麓"]
            },
            "开福区": {
                "id": 1628,
                "alias": ["开福"]
            },
            "雨花区": {
                "id": 1629,
                "alias": ["雨花"]
            },
            "长沙县": {
                "id": 1630,
                "alias": ["长沙"]
            },
            "望城区": {
                "id": 1631,
                "alias": ["望城"]
            },
            "宁乡市": {
                "id": 1632,
                "alias": ["宁乡"]
            },
            "浏阳市": {
                "id": 1633,
                "alias": ["浏阳"]
            }
        },
        "株洲市": {
            "id": 184,
            "alias": ["株洲"],
            "荷塘区": {
                "id": 1634,
                "alias": ["荷塘"]
            },
            "districts": ["荷塘区", "芦淞区", "石峰区", "天元区", "株洲县", "攸县", "茶陵县", "炎陵县", "醴陵市", "云龙示范区"],
            "芦淞区": {
                "id": 1635,
                "alias": ["芦淞"]
            },
            "石峰区": {
                "id": 1636,
                "alias": ["石峰"]
            },
            "天元区": {
                "id": 1637,
                "alias": ["天元"]
            },
            "株洲县": {
                "id": 1638,
                "alias": ["株洲"]
            },
            "攸县": {
                "id": 1639,
                "alias": []
            },
            "茶陵县": {
                "id": 1640,
                "alias": ["茶陵"]
            },
            "炎陵县": {
                "id": 1641,
                "alias": ["炎陵"]
            },
            "醴陵市": {
                "id": 1642,
                "alias": ["醴陵"]
            },
            "云龙示范区": {
                "id": 3507,
                "alias": ["云龙示范"]
            }
        },
        "湘潭市": {
            "id": 185,
            "alias": ["湘潭"],
            "雨湖区": {
                "id": 1643,
                "alias": ["雨湖"]
            },
            "districts": ["雨湖区", "岳塘区", "湘潭县", "湘乡市", "韶山市", "湖南湘潭高新技术产业园区", "湘潭昭山示范区", "湘潭九华示范区"],
            "岳塘区": {
                "id": 1644,
                "alias": ["岳塘"]
            },
            "湘潭县": {
                "id": 1645,
                "alias": ["湘潭"]
            },
            "湘乡市": {
                "id": 1646,
                "alias": ["湘乡"]
            },
            "韶山市": {
                "id": 1647,
                "alias": ["韶山"]
            },
            "湖南湘潭高新技术产业园区": {
                "id": 3508,
                "alias": ["湖南湘潭高新技术产业园"]
            },
            "湘潭昭山示范区": {
                "id": 3509,
                "alias": ["湘潭昭山示范"]
            },
            "湘潭九华示范区": {
                "id": 3510,
                "alias": ["湘潭九华示范"]
            }
        },
        "衡阳市": {
            "id": 186,
            "alias": ["衡阳"],
            "珠晖区": {
                "id": 1648,
                "alias": ["珠晖"]
            },
            "districts": ["珠晖区", "雁峰区", "石鼓区", "蒸湘区", "南岳区", "衡阳县", "衡南县", "衡山县", "衡东县", "祁东县", "耒阳市", "常宁市", "衡阳综合保税区", "湖南衡阳高新技术产业园区", "湖南衡阳松木经济开发区"],
            "雁峰区": {
                "id": 1649,
                "alias": ["雁峰"]
            },
            "石鼓区": {
                "id": 1650,
                "alias": ["石鼓"]
            },
            "蒸湘区": {
                "id": 1651,
                "alias": ["蒸湘"]
            },
            "南岳区": {
                "id": 1652,
                "alias": ["南岳"]
            },
            "衡阳县": {
                "id": 1653,
                "alias": ["衡阳"]
            },
            "衡南县": {
                "id": 1654,
                "alias": ["衡南"]
            },
            "衡山县": {
                "id": 1655,
                "alias": ["衡山"]
            },
            "衡东县": {
                "id": 1656,
                "alias": ["衡东"]
            },
            "祁东县": {
                "id": 1657,
                "alias": ["祁东"]
            },
            "耒阳市": {
                "id": 1658,
                "alias": ["耒阳"]
            },
            "常宁市": {
                "id": 1659,
                "alias": ["常宁"]
            },
            "衡阳综合保税区": {
                "id": 3511,
                "alias": ["衡阳综合保税"]
            },
            "湖南衡阳高新技术产业园区": {
                "id": 3512,
                "alias": ["湖南衡阳高新技术产业园"]
            },
            "湖南衡阳松木经济开发区": {
                "id": 3513,
                "alias": ["湖南衡阳松木经济开发"]
            }
        },
        "邵阳市": {
            "id": 187,
            "alias": ["邵阳"],
            "双清区": {
                "id": 1660,
                "alias": ["双清"]
            },
            "districts": ["双清区", "大祥区", "北塔区", "邵东县", "新邵县", "邵阳县", "隆回县", "洞口县", "绥宁县", "新宁县", "城步苗族自治县", "武冈市"],
            "大祥区": {
                "id": 1661,
                "alias": ["大祥"]
            },
            "北塔区": {
                "id": 1662,
                "alias": ["北塔"]
            },
            "邵东县": {
                "id": 1663,
                "alias": ["邵东"]
            },
            "新邵县": {
                "id": 1664,
                "alias": ["新邵"]
            },
            "邵阳县": {
                "id": 1665,
                "alias": ["邵阳"]
            },
            "隆回县": {
                "id": 1666,
                "alias": ["隆回"]
            },
            "洞口县": {
                "id": 1667,
                "alias": ["洞口"]
            },
            "绥宁县": {
                "id": 1668,
                "alias": ["绥宁"]
            },
            "新宁县": {
                "id": 1669,
                "alias": ["新宁"]
            },
            "城步苗族自治县": {
                "id": 1670,
                "alias": ["城步"]
            },
            "武冈市": {
                "id": 1671,
                "alias": ["武冈"]
            }
        },
        "岳阳市": {
            "id": 188,
            "alias": ["岳阳"],
            "岳阳楼区": {
                "id": 1672,
                "alias": ["岳阳楼"]
            },
            "districts": ["岳阳楼区", "云溪区", "君山区", "岳阳县", "华容县", "湘阴县", "平江县", "汨罗市", "临湘市", "岳阳市屈原管理区"],
            "云溪区": {
                "id": 1673,
                "alias": ["云溪"]
            },
            "君山区": {
                "id": 1674,
                "alias": ["君山"]
            },
            "岳阳县": {
                "id": 1675,
                "alias": ["岳阳"]
            },
            "华容县": {
                "id": 1676,
                "alias": ["华容"]
            },
            "湘阴县": {
                "id": 1677,
                "alias": ["湘阴"]
            },
            "平江县": {
                "id": 1678,
                "alias": ["平江"]
            },
            "汨罗市": {
                "id": 1679,
                "alias": ["汨罗"]
            },
            "临湘市": {
                "id": 1680,
                "alias": ["临湘"]
            },
            "岳阳市屈原管理区": {
                "id": 3514,
                "alias": ["岳阳市屈原管理"]
            }
        },
        "常德市": {
            "id": 189,
            "alias": ["常德"],
            "武陵区": {
                "id": 1681,
                "alias": ["武陵"]
            },
            "districts": ["武陵区", "鼎城区", "安乡县", "汉寿县", "澧县", "临澧县", "桃源县", "石门县", "津市市", "常德市西洞庭管理区"],
            "鼎城区": {
                "id": 1682,
                "alias": ["鼎城"]
            },
            "安乡县": {
                "id": 1683,
                "alias": ["安乡"]
            },
            "汉寿县": {
                "id": 1684,
                "alias": ["汉寿"]
            },
            "澧县": {
                "id": 1685,
                "alias": []
            },
            "临澧县": {
                "id": 1686,
                "alias": ["临澧"]
            },
            "桃源县": {
                "id": 1687,
                "alias": ["桃源"]
            },
            "石门县": {
                "id": 1688,
                "alias": ["石门"]
            },
            "津市市": {
                "id": 1689,
                "alias": []
            },
            "常德市西洞庭管理区": {
                "id": 3515,
                "alias": ["常德市西洞庭管理"]
            }
        },
        "张家界市": {
            "id": 190,
            "alias": ["张家界"],
            "永定区": {
                "id": 1690,
                "alias": ["永定"]
            },
            "districts": ["永定区", "武陵源区", "慈利县", "桑植县"],
            "武陵源区": {
                "id": 1691,
                "alias": ["武陵源"]
            },
            "慈利县": {
                "id": 1692,
                "alias": ["慈利"]
            },
            "桑植县": {
                "id": 1693,
                "alias": ["桑植"]
            }
        },
        "益阳市": {
            "id": 191,
            "alias": ["益阳"],
            "资阳区": {
                "id": 1694,
                "alias": ["资阳"]
            },
            "districts": ["资阳区", "赫山区", "南县", "桃江县", "安化县", "沅江市", "益阳市大通湖管理区", "湖南益阳高新技术产业园区"],
            "赫山区": {
                "id": 1695,
                "alias": ["赫山"]
            },
            "南县": {
                "id": 1696,
                "alias": []
            },
            "桃江县": {
                "id": 1697,
                "alias": ["桃江"]
            },
            "安化县": {
                "id": 1698,
                "alias": ["安化"]
            },
            "沅江市": {
                "id": 1699,
                "alias": ["沅江"]
            },
            "益阳市大通湖管理区": {
                "id": 3516,
                "alias": ["益阳市大通湖管理"]
            },
            "湖南益阳高新技术产业园区": {
                "id": 3517,
                "alias": ["湖南益阳高新技术产业园"]
            }
        },
        "郴州市": {
            "id": 192,
            "alias": ["郴州"],
            "北湖区": {
                "id": 1700,
                "alias": ["北湖"]
            },
            "districts": ["北湖区", "苏仙区", "桂阳县", "宜章县", "永兴县", "嘉禾县", "临武县", "汝城县", "桂东县", "安仁县", "资兴市"],
            "苏仙区": {
                "id": 1701,
                "alias": ["苏仙"]
            },
            "桂阳县": {
                "id": 1702,
                "alias": ["桂阳"]
            },
            "宜章县": {
                "id": 1703,
                "alias": ["宜章"]
            },
            "永兴县": {
                "id": 1704,
                "alias": ["永兴"]
            },
            "嘉禾县": {
                "id": 1705,
                "alias": ["嘉禾"]
            },
            "临武县": {
                "id": 1706,
                "alias": ["临武"]
            },
            "汝城县": {
                "id": 1707,
                "alias": ["汝城"]
            },
            "桂东县": {
                "id": 1708,
                "alias": ["桂东"]
            },
            "安仁县": {
                "id": 1709,
                "alias": ["安仁"]
            },
            "资兴市": {
                "id": 1710,
                "alias": ["资兴"]
            }
        },
        "永州市": {
            "id": 193,
            "alias": ["永州"],
            "冷水滩区": {
                "id": 1712,
                "alias": ["冷水滩"]
            },
            "districts": ["冷水滩区", "祁阳县", "东安县", "双牌县", "道县", "江永县", "宁远县", "蓝山县", "新田县", "江华瑶族自治县", "零陵区", "永州经济技术开发区", "永州市金洞管理区", "永州市回龙圩管理区"],
            "祁阳县": {
                "id": 1713,
                "alias": ["祁阳"]
            },
            "东安县": {
                "id": 1714,
                "alias": ["东安"]
            },
            "双牌县": {
                "id": 1715,
                "alias": ["双牌"]
            },
            "道县": {
                "id": 1716,
                "alias": []
            },
            "江永县": {
                "id": 1717,
                "alias": ["江永"]
            },
            "宁远县": {
                "id": 1718,
                "alias": ["宁远"]
            },
            "蓝山县": {
                "id": 1719,
                "alias": ["蓝山"]
            },
            "新田县": {
                "id": 1720,
                "alias": ["新田"]
            },
            "江华瑶族自治县": {
                "id": 1721,
                "alias": ["江华"]
            },
            "零陵区": {
                "id": 3518,
                "alias": ["零陵"]
            },
            "永州经济技术开发区": {
                "id": 3519,
                "alias": ["永州经济技术开发"]
            },
            "永州市金洞管理区": {
                "id": 3520,
                "alias": ["永州市金洞管理"]
            },
            "永州市回龙圩管理区": {
                "id": 3521,
                "alias": ["永州市回龙圩管理"]
            }
        },
        "怀化市": {
            "id": 194,
            "alias": ["怀化"],
            "鹤城区": {
                "id": 1722,
                "alias": ["鹤城"]
            },
            "districts": ["鹤城区", "中方县", "沅陵县", "辰溪县", "溆浦县", "会同县", "麻阳苗族自治县", "新晃侗族自治县", "芷江侗族自治县", "靖州苗族侗族自治县", "通道侗族自治县", "洪江市", "怀化市洪江管理区"],
            "中方县": {
                "id": 1723,
                "alias": ["中方"]
            },
            "沅陵县": {
                "id": 1724,
                "alias": ["沅陵"]
            },
            "辰溪县": {
                "id": 1725,
                "alias": ["辰溪"]
            },
            "溆浦县": {
                "id": 1726,
                "alias": ["溆浦"]
            },
            "会同县": {
                "id": 1727,
                "alias": ["会同"]
            },
            "麻阳苗族自治县": {
                "id": 1728,
                "alias": ["麻阳"]
            },
            "新晃侗族自治县": {
                "id": 1729,
                "alias": ["新晃"]
            },
            "芷江侗族自治县": {
                "id": 1730,
                "alias": ["芷江"]
            },
            "靖州苗族侗族自治县": {
                "id": 1731,
                "alias": ["靖州"]
            },
            "通道侗族自治县": {
                "id": 1732,
                "alias": ["通道"]
            },
            "洪江市": {
                "id": 1733,
                "alias": ["洪江"]
            },
            "怀化市洪江管理区": {
                "id": 3522,
                "alias": ["怀化市洪江管理"]
            }
        },
        "娄底市": {
            "id": 195,
            "alias": ["娄底"],
            "娄星区": {
                "id": 1734,
                "alias": ["娄星"]
            },
            "districts": ["娄星区", "双峰县", "新化县", "冷水江市", "涟源市"],
            "双峰县": {
                "id": 1735,
                "alias": ["双峰"]
            },
            "新化县": {
                "id": 1736,
                "alias": ["新化"]
            },
            "冷水江市": {
                "id": 1737,
                "alias": ["冷水江"]
            },
            "涟源市": {
                "id": 1738,
                "alias": ["涟源"]
            }
        },
        "湘西土家族苗族自治州": {
            "id": 196,
            "alias": ["湘西"],
            "吉首市": {
                "id": 1739,
                "alias": ["吉首"]
            },
            "districts": ["吉首市", "泸溪县", "凤凰县", "花垣县", "保靖县", "古丈县", "永顺县", "龙山县", "湖南吉首经济开发区", "湖南永顺经济开发区"],
            "泸溪县": {
                "id": 1740,
                "alias": ["泸溪"]
            },
            "凤凰县": {
                "id": 1741,
                "alias": ["凤凰"]
            },
            "花垣县": {
                "id": 1742,
                "alias": ["花垣"]
            },
            "保靖县": {
                "id": 1743,
                "alias": ["保靖"]
            },
            "古丈县": {
                "id": 1744,
                "alias": ["古丈"]
            },
            "永顺县": {
                "id": 1745,
                "alias": ["永顺"]
            },
            "龙山县": {
                "id": 1746,
                "alias": ["龙山"]
            },
            "湖南吉首经济开发区": {
                "id": 3523,
                "alias": ["湖南吉首经济开发"]
            },
            "湖南永顺经济开发区": {
                "id": 3524,
                "alias": ["湖南永顺经济开发"]
            }
        }
    },
    "广东省": {
        "alias": ["广东"],
        "id": 19,
        "cities": ["广州市", "韶关市", "深圳市", "珠海市", "汕头市", "佛山市", "江门市", "湛江市", "茂名市", "肇庆市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市", "清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市"],
        "广州市": {
            "id": 197,
            "alias": ["广州"],
            "荔湾区": {
                "id": 1748,
                "alias": ["荔湾"]
            },
            "districts": ["荔湾区", "越秀区", "海珠区", "天河区", "白云区", "黄埔区", "番禺区", "花都区", "增城区", "南沙区", "从化区"],
            "越秀区": {
                "id": 1749,
                "alias": ["越秀"]
            },
            "海珠区": {
                "id": 1750,
                "alias": ["海珠"]
            },
            "天河区": {
                "id": 1751,
                "alias": ["天河"]
            },
            "白云区": {
                "id": 1753,
                "alias": ["白云"]
            },
            "黄埔区": {
                "id": 1754,
                "alias": ["黄埔"]
            },
            "番禺区": {
                "id": 1755,
                "alias": ["番禺"]
            },
            "花都区": {
                "id": 1756,
                "alias": ["花都"]
            },
            "增城区": {
                "id": 1757,
                "alias": ["增城"]
            },
            "南沙区": {
                "id": 3327,
                "alias": ["南沙"]
            },
            "从化区": {
                "id": 3328,
                "alias": ["从化"]
            }
        },
        "韶关市": {
            "id": 198,
            "alias": ["韶关"],
            "武江区": {
                "id": 1759,
                "alias": ["武江"]
            },
            "districts": ["武江区", "浈江区", "曲江区", "始兴县", "仁化县", "翁源县", "乳源瑶族自治县", "新丰县", "乐昌市", "南雄市"],
            "浈江区": {
                "id": 1760,
                "alias": ["浈江"]
            },
            "曲江区": {
                "id": 1761,
                "alias": ["曲江"]
            },
            "始兴县": {
                "id": 1762,
                "alias": ["始兴"]
            },
            "仁化县": {
                "id": 1763,
                "alias": ["仁化"]
            },
            "翁源县": {
                "id": 1764,
                "alias": ["翁源"]
            },
            "乳源瑶族自治县": {
                "id": 1765,
                "alias": ["乳源"]
            },
            "新丰县": {
                "id": 1766,
                "alias": ["新丰"]
            },
            "乐昌市": {
                "id": 1767,
                "alias": ["乐昌"]
            },
            "南雄市": {
                "id": 1768,
                "alias": ["南雄"]
            }
        },
        "深圳市": {
            "id": 199,
            "alias": ["深圳"],
            "罗湖区": {
                "id": 1769,
                "alias": ["罗湖"]
            },
            "districts": ["罗湖区", "福田区", "南山区", "宝安区", "龙岗区", "盐田区", "龙华区", "坪山区"],
            "福田区": {
                "id": 1770,
                "alias": ["福田"]
            },
            "南山区": {
                "id": 1771,
                "alias": ["南山"]
            },
            "宝安区": {
                "id": 1772,
                "alias": ["宝安"]
            },
            "龙岗区": {
                "id": 1773,
                "alias": ["龙岗"]
            },
            "盐田区": {
                "id": 1774,
                "alias": ["盐田"]
            },
            "龙华区": {
                "id": 3329,
                "alias": ["龙华"]
            },
            "坪山区": {
                "id": 3330,
                "alias": ["坪山"]
            }
        },
        "珠海市": {
            "id": 200,
            "alias": ["珠海"],
            "香洲区": {
                "id": 1775,
                "alias": ["香洲"]
            },
            "districts": ["香洲区", "斗门区", "金湾区"],
            "斗门区": {
                "id": 1776,
                "alias": ["斗门"]
            },
            "金湾区": {
                "id": 1777,
                "alias": ["金湾"]
            }
        },
        "汕头市": {
            "id": 201,
            "alias": ["汕头"],
            "龙湖区": {
                "id": 1778,
                "alias": ["龙湖"]
            },
            "districts": ["龙湖区", "金平区", "濠江区", "潮阳区", "潮南区", "澄海区", "南澳县"],
            "金平区": {
                "id": 1779,
                "alias": ["金平"]
            },
            "濠江区": {
                "id": 1780,
                "alias": ["濠江"]
            },
            "潮阳区": {
                "id": 1781,
                "alias": ["潮阳"]
            },
            "潮南区": {
                "id": 1782,
                "alias": ["潮南"]
            },
            "澄海区": {
                "id": 1783,
                "alias": ["澄海"]
            },
            "南澳县": {
                "id": 1784,
                "alias": ["南澳"]
            }
        },
        "佛山市": {
            "id": 202,
            "alias": ["佛山"],
            "禅城区": {
                "id": 1785,
                "alias": ["禅城"]
            },
            "districts": ["禅城区", "南海区", "顺德区", "三水区", "高明区"],
            "南海区": {
                "id": 1786,
                "alias": ["南海"]
            },
            "顺德区": {
                "id": 1787,
                "alias": ["顺德"]
            },
            "三水区": {
                "id": 1788,
                "alias": ["三水"]
            },
            "高明区": {
                "id": 1789,
                "alias": ["高明"]
            }
        },
        "江门市": {
            "id": 203,
            "alias": ["江门"],
            "蓬江区": {
                "id": 1790,
                "alias": ["蓬江"]
            },
            "districts": ["蓬江区", "江海区", "新会区", "台山市", "开平市", "鹤山市", "恩平市"],
            "江海区": {
                "id": 1791,
                "alias": ["江海"]
            },
            "新会区": {
                "id": 1792,
                "alias": ["新会"]
            },
            "台山市": {
                "id": 1793,
                "alias": ["台山"]
            },
            "开平市": {
                "id": 1794,
                "alias": ["开平"]
            },
            "鹤山市": {
                "id": 1795,
                "alias": ["鹤山"]
            },
            "恩平市": {
                "id": 1796,
                "alias": ["恩平"]
            }
        },
        "湛江市": {
            "id": 204,
            "alias": ["湛江"],
            "赤坎区": {
                "id": 1797,
                "alias": ["赤坎"]
            },
            "districts": ["赤坎区", "霞山区", "坡头区", "麻章区", "遂溪县", "徐闻县", "廉江市", "雷州市", "吴川市"],
            "霞山区": {
                "id": 1798,
                "alias": ["霞山"]
            },
            "坡头区": {
                "id": 1799,
                "alias": ["坡头"]
            },
            "麻章区": {
                "id": 1800,
                "alias": ["麻章"]
            },
            "遂溪县": {
                "id": 1801,
                "alias": ["遂溪"]
            },
            "徐闻县": {
                "id": 1802,
                "alias": ["徐闻"]
            },
            "廉江市": {
                "id": 1803,
                "alias": ["廉江"]
            },
            "雷州市": {
                "id": 1804,
                "alias": ["雷州"]
            },
            "吴川市": {
                "id": 1805,
                "alias": ["吴川"]
            }
        },
        "茂名市": {
            "id": 205,
            "alias": ["茂名"],
            "茂南区": {
                "id": 1806,
                "alias": ["茂南"]
            },
            "districts": ["茂南区", "电白区", "高州市", "化州市", "信宜市"],
            "电白区": {
                "id": 1808,
                "alias": ["电白"]
            },
            "高州市": {
                "id": 1809,
                "alias": ["高州"]
            },
            "化州市": {
                "id": 1810,
                "alias": ["化州"]
            },
            "信宜市": {
                "id": 1811,
                "alias": ["信宜"]
            }
        },
        "肇庆市": {
            "id": 206,
            "alias": ["肇庆"],
            "端州区": {
                "id": 1812,
                "alias": ["端州"]
            },
            "districts": ["端州区", "鼎湖区", "广宁县", "怀集县", "封开县", "德庆县", "高要区", "四会市"],
            "鼎湖区": {
                "id": 1813,
                "alias": ["鼎湖"]
            },
            "广宁县": {
                "id": 1814,
                "alias": ["广宁"]
            },
            "怀集县": {
                "id": 1815,
                "alias": ["怀集"]
            },
            "封开县": {
                "id": 1816,
                "alias": ["封开"]
            },
            "德庆县": {
                "id": 1817,
                "alias": ["德庆"]
            },
            "高要区": {
                "id": 1818,
                "alias": ["高要"]
            },
            "四会市": {
                "id": 1819,
                "alias": ["四会"]
            }
        },
        "惠州市": {
            "id": 207,
            "alias": ["惠州"],
            "惠城区": {
                "id": 1820,
                "alias": ["惠城"]
            },
            "districts": ["惠城区", "惠阳区", "博罗县", "惠东县", "龙门县"],
            "惠阳区": {
                "id": 1821,
                "alias": ["惠阳"]
            },
            "博罗县": {
                "id": 1822,
                "alias": ["博罗"]
            },
            "惠东县": {
                "id": 1823,
                "alias": ["惠东"]
            },
            "龙门县": {
                "id": 1824,
                "alias": ["龙门"]
            }
        },
        "梅州市": {
            "id": 208,
            "alias": ["梅州"],
            "梅江区": {
                "id": 1825,
                "alias": ["梅江"]
            },
            "districts": ["梅江区", "梅县区", "大埔县", "丰顺县", "五华县", "平远县", "蕉岭县", "兴宁市"],
            "梅县区": {
                "id": 1826,
                "alias": ["梅县"]
            },
            "大埔县": {
                "id": 1827,
                "alias": ["大埔"]
            },
            "丰顺县": {
                "id": 1828,
                "alias": ["丰顺"]
            },
            "五华县": {
                "id": 1829,
                "alias": ["五华"]
            },
            "平远县": {
                "id": 1830,
                "alias": ["平远"]
            },
            "蕉岭县": {
                "id": 1831,
                "alias": ["蕉岭"]
            },
            "兴宁市": {
                "id": 1832,
                "alias": ["兴宁"]
            }
        },
        "汕尾市": {
            "id": 209,
            "alias": ["汕尾"],
            "城区": {
                "id": 1833,
                "alias": []
            },
            "districts": ["城区", "海丰县", "陆河县", "陆丰市"],
            "海丰县": {
                "id": 1834,
                "alias": ["海丰"]
            },
            "陆河县": {
                "id": 1835,
                "alias": ["陆河"]
            },
            "陆丰市": {
                "id": 1836,
                "alias": ["陆丰"]
            }
        },
        "河源市": {
            "id": 210,
            "alias": ["河源"],
            "源城区": {
                "id": 1837,
                "alias": ["源城"]
            },
            "districts": ["源城区", "紫金县", "龙川县", "连平县", "和平县", "东源县"],
            "紫金县": {
                "id": 1838,
                "alias": ["紫金"]
            },
            "龙川县": {
                "id": 1839,
                "alias": ["龙川"]
            },
            "连平县": {
                "id": 1840,
                "alias": ["连平"]
            },
            "和平县": {
                "id": 1841,
                "alias": ["和平"]
            },
            "东源县": {
                "id": 1842,
                "alias": ["东源"]
            }
        },
        "阳江市": {
            "id": 211,
            "alias": ["阳江"],
            "江城区": {
                "id": 1843,
                "alias": ["江城"]
            },
            "districts": ["江城区", "阳西县", "阳东区", "阳春市"],
            "阳西县": {
                "id": 1844,
                "alias": ["阳西"]
            },
            "阳东区": {
                "id": 1845,
                "alias": ["阳东"]
            },
            "阳春市": {
                "id": 1846,
                "alias": ["阳春"]
            }
        },
        "清远市": {
            "id": 212,
            "alias": ["清远"],
            "清城区": {
                "id": 1847,
                "alias": ["清城"]
            },
            "districts": ["清城区", "佛冈县", "阳山县", "连山壮族瑶族自治县", "连南瑶族自治县", "清新区", "英德市", "连州市"],
            "佛冈县": {
                "id": 1848,
                "alias": ["佛冈"]
            },
            "阳山县": {
                "id": 1849,
                "alias": ["阳山"]
            },
            "连山壮族瑶族自治县": {
                "id": 1850,
                "alias": ["连山"]
            },
            "连南瑶族自治县": {
                "id": 1851,
                "alias": ["连南"]
            },
            "清新区": {
                "id": 1852,
                "alias": ["清新"]
            },
            "英德市": {
                "id": 1853,
                "alias": ["英德"]
            },
            "连州市": {
                "id": 1854,
                "alias": ["连州"]
            }
        },
        "东莞市": {
            "id": 213,
            "alias": ["东莞"],
            "东城街道办事处": {
                "id": 3331,
                "alias": []
            },
            "districts": ["东城街道办事处", "南城街道办事处", "万江街道办事处", "莞城街道办事处", "石碣镇", "石龙镇", "茶山镇", "石排镇", "企石镇", "横沥镇", "桥头镇", "谢岗镇", "东坑镇", "常平镇", "寮步镇", "樟木头镇", "大朗镇", "黄江镇", "清溪镇", "塘厦镇", "凤岗镇", "大岭山镇", "长安镇", "虎门镇", "厚街镇", "沙田镇", "道滘镇", "洪梅镇", "麻涌镇", "望牛墩镇", "中堂镇", "高埗镇", "松山湖管委会", "东莞港", "东莞生态园"],
            "南城街道办事处": {
                "id": 3332,
                "alias": []
            },
            "万江街道办事处": {
                "id": 3333,
                "alias": []
            },
            "莞城街道办事处": {
                "id": 3334,
                "alias": []
            },
            "石碣镇": {
                "id": 3335,
                "alias": []
            },
            "石龙镇": {
                "id": 3336,
                "alias": []
            },
            "茶山镇": {
                "id": 3337,
                "alias": []
            },
            "石排镇": {
                "id": 3338,
                "alias": []
            },
            "企石镇": {
                "id": 3339,
                "alias": []
            },
            "横沥镇": {
                "id": 3340,
                "alias": []
            },
            "桥头镇": {
                "id": 3341,
                "alias": []
            },
            "谢岗镇": {
                "id": 3342,
                "alias": []
            },
            "东坑镇": {
                "id": 3343,
                "alias": []
            },
            "常平镇": {
                "id": 3344,
                "alias": []
            },
            "寮步镇": {
                "id": 3345,
                "alias": []
            },
            "樟木头镇": {
                "id": 3346,
                "alias": []
            },
            "大朗镇": {
                "id": 3347,
                "alias": []
            },
            "黄江镇": {
                "id": 3348,
                "alias": []
            },
            "清溪镇": {
                "id": 3349,
                "alias": []
            },
            "塘厦镇": {
                "id": 3350,
                "alias": []
            },
            "凤岗镇": {
                "id": 3351,
                "alias": []
            },
            "大岭山镇": {
                "id": 3352,
                "alias": []
            },
            "长安镇": {
                "id": 3353,
                "alias": []
            },
            "虎门镇": {
                "id": 3354,
                "alias": []
            },
            "厚街镇": {
                "id": 3355,
                "alias": []
            },
            "沙田镇": {
                "id": 3356,
                "alias": []
            },
            "道滘镇": {
                "id": 3357,
                "alias": []
            },
            "洪梅镇": {
                "id": 3358,
                "alias": []
            },
            "麻涌镇": {
                "id": 3359,
                "alias": []
            },
            "望牛墩镇": {
                "id": 3360,
                "alias": []
            },
            "中堂镇": {
                "id": 3361,
                "alias": []
            },
            "高埗镇": {
                "id": 3362,
                "alias": []
            },
            "松山湖管委会": {
                "id": 3363,
                "alias": []
            },
            "东莞港": {
                "id": 3364,
                "alias": []
            },
            "东莞生态园": {
                "id": 3365,
                "alias": []
            }
        },
        "中山市": {
            "id": 214,
            "alias": ["中山"],
            "石岐区街道办事处": {
                "id": 3366,
                "alias": ["石岐街道办事处"]
            },
            "districts": ["石岐区街道办事处", "东区街道办事处", "火炬开发区街道办事处", "西区街道办事处", "南区街道办事处", "五桂山街道办事处", "小榄镇", "黄圃镇", "民众镇", "东凤镇", "东升镇", "古镇镇", "沙溪镇", "坦洲镇", "港口镇", "三角镇", "横栏镇", "南头镇", "阜沙镇", "南朗镇", "三乡镇", "板芙镇", "大涌镇", "神湾镇"],
            "东区街道办事处": {
                "id": 3367,
                "alias": ["东街道办事处"]
            },
            "火炬开发区街道办事处": {
                "id": 3368,
                "alias": ["火炬开发街道办事处"]
            },
            "西区街道办事处": {
                "id": 3369,
                "alias": ["西街道办事处"]
            },
            "南区街道办事处": {
                "id": 3370,
                "alias": ["南街道办事处"]
            },
            "五桂山街道办事处": {
                "id": 3371,
                "alias": []
            },
            "小榄镇": {
                "id": 3372,
                "alias": []
            },
            "黄圃镇": {
                "id": 3373,
                "alias": []
            },
            "民众镇": {
                "id": 3374,
                "alias": []
            },
            "东凤镇": {
                "id": 3375,
                "alias": []
            },
            "东升镇": {
                "id": 3376,
                "alias": []
            },
            "古镇镇": {
                "id": 3377,
                "alias": []
            },
            "沙溪镇": {
                "id": 3378,
                "alias": []
            },
            "坦洲镇": {
                "id": 3379,
                "alias": []
            },
            "港口镇": {
                "id": 3380,
                "alias": []
            },
            "三角镇": {
                "id": 3381,
                "alias": []
            },
            "横栏镇": {
                "id": 3382,
                "alias": []
            },
            "南头镇": {
                "id": 3383,
                "alias": []
            },
            "阜沙镇": {
                "id": 3384,
                "alias": []
            },
            "南朗镇": {
                "id": 3385,
                "alias": []
            },
            "三乡镇": {
                "id": 3386,
                "alias": []
            },
            "板芙镇": {
                "id": 3387,
                "alias": []
            },
            "大涌镇": {
                "id": 3388,
                "alias": []
            },
            "神湾镇": {
                "id": 3389,
                "alias": []
            }
        },
        "潮州市": {
            "id": 215,
            "alias": ["潮州"],
            "湘桥区": {
                "id": 1855,
                "alias": ["湘桥"]
            },
            "districts": ["湘桥区", "潮安区", "饶平县"],
            "潮安区": {
                "id": 1856,
                "alias": ["潮安"]
            },
            "饶平县": {
                "id": 1857,
                "alias": ["饶平"]
            }
        },
        "揭阳市": {
            "id": 216,
            "alias": ["揭阳"],
            "榕城区": {
                "id": 1858,
                "alias": ["榕城"]
            },
            "districts": ["榕城区", "揭东区", "揭西县", "惠来县", "普宁市"],
            "揭东区": {
                "id": 1859,
                "alias": ["揭东"]
            },
            "揭西县": {
                "id": 1860,
                "alias": ["揭西"]
            },
            "惠来县": {
                "id": 1861,
                "alias": ["惠来"]
            },
            "普宁市": {
                "id": 1862,
                "alias": ["普宁"]
            }
        },
        "云浮市": {
            "id": 217,
            "alias": ["云浮"],
            "云城区": {
                "id": 1863,
                "alias": ["云城"]
            },
            "districts": ["云城区", "新兴县", "郁南县", "云安区", "罗定市"],
            "新兴县": {
                "id": 1864,
                "alias": ["新兴"]
            },
            "郁南县": {
                "id": 1865,
                "alias": ["郁南"]
            },
            "云安区": {
                "id": 1866,
                "alias": ["云安"]
            },
            "罗定市": {
                "id": 1867,
                "alias": ["罗定"]
            }
        }
    },
    "广西壮族自治区": {
        "alias": ["广西"],
        "id": 20,
        "cities": ["南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市"],
        "南宁市": {
            "id": 218,
            "alias": ["南宁"],
            "兴宁区": {
                "id": 1868,
                "alias": ["兴宁"]
            },
            "districts": ["兴宁区", "青秀区", "江南区", "西乡塘区", "良庆区", "邕宁区", "武鸣区", "隆安县", "马山县", "上林县", "宾阳县", "横县"],
            "青秀区": {
                "id": 1869,
                "alias": ["青秀"]
            },
            "江南区": {
                "id": 1870,
                "alias": ["江南"]
            },
            "西乡塘区": {
                "id": 1871,
                "alias": ["西乡塘"]
            },
            "良庆区": {
                "id": 1872,
                "alias": ["良庆"]
            },
            "邕宁区": {
                "id": 1873,
                "alias": ["邕宁"]
            },
            "武鸣区": {
                "id": 1874,
                "alias": ["武鸣"]
            },
            "隆安县": {
                "id": 1875,
                "alias": ["隆安"]
            },
            "马山县": {
                "id": 1876,
                "alias": ["马山"]
            },
            "上林县": {
                "id": 1877,
                "alias": ["上林"]
            },
            "宾阳县": {
                "id": 1878,
                "alias": ["宾阳"]
            },
            "横县": {
                "id": 1879,
                "alias": []
            }
        },
        "柳州市": {
            "id": 219,
            "alias": ["柳州"],
            "城中区": {
                "id": 1880,
                "alias": ["城中"]
            },
            "districts": ["城中区", "鱼峰区", "柳南区", "柳北区", "柳江区", "柳城县", "鹿寨县", "融安县", "融水苗族自治县", "三江侗族自治县"],
            "鱼峰区": {
                "id": 1881,
                "alias": ["鱼峰"]
            },
            "柳南区": {
                "id": 1882,
                "alias": ["柳南"]
            },
            "柳北区": {
                "id": 1883,
                "alias": ["柳北"]
            },
            "柳江区": {
                "id": 1884,
                "alias": ["柳江"]
            },
            "柳城县": {
                "id": 1885,
                "alias": ["柳城"]
            },
            "鹿寨县": {
                "id": 1886,
                "alias": ["鹿寨"]
            },
            "融安县": {
                "id": 1887,
                "alias": ["融安"]
            },
            "融水苗族自治县": {
                "id": 1888,
                "alias": ["融水"]
            },
            "三江侗族自治县": {
                "id": 1889,
                "alias": ["三江"]
            }
        },
        "桂林市": {
            "id": 220,
            "alias": ["桂林"],
            "秀峰区": {
                "id": 1890,
                "alias": ["秀峰"]
            },
            "districts": ["秀峰区", "叠彩区", "象山区", "七星区", "雁山区", "阳朔县", "临桂区", "灵川县", "全州县", "兴安县", "永福县", "灌阳县", "龙胜各族自治县", "资源县", "平乐县", "恭城瑶族自治县", "荔浦县"],
            "叠彩区": {
                "id": 1891,
                "alias": ["叠彩"]
            },
            "象山区": {
                "id": 1892,
                "alias": ["象山"]
            },
            "七星区": {
                "id": 1893,
                "alias": ["七星"]
            },
            "雁山区": {
                "id": 1894,
                "alias": ["雁山"]
            },
            "阳朔县": {
                "id": 1895,
                "alias": ["阳朔"]
            },
            "临桂区": {
                "id": 1896,
                "alias": ["临桂"]
            },
            "灵川县": {
                "id": 1897,
                "alias": ["灵川"]
            },
            "全州县": {
                "id": 1898,
                "alias": ["全州"]
            },
            "兴安县": {
                "id": 1899,
                "alias": ["兴安"]
            },
            "永福县": {
                "id": 1900,
                "alias": ["永福"]
            },
            "灌阳县": {
                "id": 1901,
                "alias": ["灌阳"]
            },
            "龙胜各族自治县": {
                "id": 1902,
                "alias": ["龙胜"]
            },
            "资源县": {
                "id": 1903,
                "alias": ["资源"]
            },
            "平乐县": {
                "id": 1904,
                "alias": ["平乐"]
            },
            "恭城瑶族自治县": {
                "id": 1906,
                "alias": ["恭城"]
            },
            "荔浦县": {
                "id": 3390,
                "alias": ["荔浦"]
            }
        },
        "梧州市": {
            "id": 221,
            "alias": ["梧州"],
            "万秀区": {
                "id": 1907,
                "alias": ["万秀"]
            },
            "districts": ["万秀区", "长洲区", "苍梧县", "藤县", "蒙山县", "岑溪市", "龙圩区"],
            "长洲区": {
                "id": 1909,
                "alias": ["长洲"]
            },
            "苍梧县": {
                "id": 1910,
                "alias": ["苍梧"]
            },
            "藤县": {
                "id": 1911,
                "alias": []
            },
            "蒙山县": {
                "id": 1912,
                "alias": ["蒙山"]
            },
            "岑溪市": {
                "id": 1913,
                "alias": ["岑溪"]
            },
            "龙圩区": {
                "id": 3391,
                "alias": ["龙圩"]
            }
        },
        "北海市": {
            "id": 222,
            "alias": ["北海"],
            "海城区": {
                "id": 1914,
                "alias": ["海城"]
            },
            "districts": ["海城区", "银海区", "铁山港区", "合浦县"],
            "银海区": {
                "id": 1915,
                "alias": ["银海"]
            },
            "铁山港区": {
                "id": 1916,
                "alias": ["铁山港"]
            },
            "合浦县": {
                "id": 1917,
                "alias": ["合浦"]
            }
        },
        "防城港市": {
            "id": 223,
            "alias": ["防城港"],
            "港口区": {
                "id": 1918,
                "alias": ["港口"]
            },
            "districts": ["港口区", "防城区", "上思县", "东兴市"],
            "防城区": {
                "id": 1919,
                "alias": ["防城"]
            },
            "上思县": {
                "id": 1920,
                "alias": ["上思"]
            },
            "东兴市": {
                "id": 1921,
                "alias": ["东兴"]
            }
        },
        "钦州市": {
            "id": 224,
            "alias": ["钦州"],
            "钦南区": {
                "id": 1922,
                "alias": ["钦南"]
            },
            "districts": ["钦南区", "钦北区", "灵山县", "浦北县"],
            "钦北区": {
                "id": 1923,
                "alias": ["钦北"]
            },
            "灵山县": {
                "id": 1924,
                "alias": ["灵山"]
            },
            "浦北县": {
                "id": 1925,
                "alias": ["浦北"]
            }
        },
        "贵港市": {
            "id": 225,
            "alias": ["贵港"],
            "港北区": {
                "id": 1926,
                "alias": ["港北"]
            },
            "districts": ["港北区", "港南区", "覃塘区", "平南县", "桂平市"],
            "港南区": {
                "id": 1927,
                "alias": ["港南"]
            },
            "覃塘区": {
                "id": 1928,
                "alias": ["覃塘"]
            },
            "平南县": {
                "id": 1929,
                "alias": ["平南"]
            },
            "桂平市": {
                "id": 1930,
                "alias": ["桂平"]
            }
        },
        "玉林市": {
            "id": 226,
            "alias": ["玉林"],
            "玉州区": {
                "id": 1931,
                "alias": ["玉州"]
            },
            "districts": ["玉州区", "容县", "陆川县", "博白县", "兴业县", "北流市", "福绵区"],
            "容县": {
                "id": 1932,
                "alias": []
            },
            "陆川县": {
                "id": 1933,
                "alias": ["陆川"]
            },
            "博白县": {
                "id": 1934,
                "alias": ["博白"]
            },
            "兴业县": {
                "id": 1935,
                "alias": ["兴业"]
            },
            "北流市": {
                "id": 1936,
                "alias": ["北流"]
            },
            "福绵区": {
                "id": 3392,
                "alias": ["福绵"]
            }
        },
        "百色市": {
            "id": 227,
            "alias": ["百色"],
            "右江区": {
                "id": 1937,
                "alias": ["右江"]
            },
            "districts": ["右江区", "田阳县", "田东县", "平果县", "德保县", "靖西市", "那坡县", "凌云县", "乐业县", "田林县", "西林县", "隆林各族自治县"],
            "田阳县": {
                "id": 1938,
                "alias": ["田阳"]
            },
            "田东县": {
                "id": 1939,
                "alias": ["田东"]
            },
            "平果县": {
                "id": 1940,
                "alias": ["平果"]
            },
            "德保县": {
                "id": 1941,
                "alias": ["德保"]
            },
            "靖西市": {
                "id": 1942,
                "alias": ["靖西"]
            },
            "那坡县": {
                "id": 1943,
                "alias": ["那坡"]
            },
            "凌云县": {
                "id": 1944,
                "alias": ["凌云"]
            },
            "乐业县": {
                "id": 1945,
                "alias": ["乐业"]
            },
            "田林县": {
                "id": 1946,
                "alias": ["田林"]
            },
            "西林县": {
                "id": 1947,
                "alias": ["西林"]
            },
            "隆林各族自治县": {
                "id": 1948,
                "alias": ["隆林"]
            }
        },
        "贺州市": {
            "id": 228,
            "alias": ["贺州"],
            "八步区": {
                "id": 1949,
                "alias": ["八步"]
            },
            "districts": ["八步区", "昭平县", "钟山县", "富川瑶族自治县", "平桂区"],
            "昭平县": {
                "id": 1950,
                "alias": ["昭平"]
            },
            "钟山县": {
                "id": 1951,
                "alias": ["钟山"]
            },
            "富川瑶族自治县": {
                "id": 1952,
                "alias": ["富川"]
            },
            "平桂区": {
                "id": 3393,
                "alias": ["平桂"]
            }
        },
        "河池市": {
            "id": 229,
            "alias": ["河池"],
            "金城江区": {
                "id": 1953,
                "alias": ["金城江"]
            },
            "districts": ["金城江区", "南丹县", "天峨县", "凤山县", "东兰县", "罗城仫佬族自治县", "环江毛南族自治县", "巴马瑶族自治县", "都安瑶族自治县", "大化瑶族自治县", "宜州区"],
            "南丹县": {
                "id": 1954,
                "alias": ["南丹"]
            },
            "天峨县": {
                "id": 1955,
                "alias": ["天峨"]
            },
            "凤山县": {
                "id": 1956,
                "alias": ["凤山"]
            },
            "东兰县": {
                "id": 1957,
                "alias": ["东兰"]
            },
            "罗城仫佬族自治县": {
                "id": 1958,
                "alias": ["罗城"]
            },
            "环江毛南族自治县": {
                "id": 1959,
                "alias": ["环江"]
            },
            "巴马瑶族自治县": {
                "id": 1960,
                "alias": ["巴马"]
            },
            "都安瑶族自治县": {
                "id": 1961,
                "alias": ["都安"]
            },
            "大化瑶族自治县": {
                "id": 1962,
                "alias": ["大化"]
            },
            "宜州区": {
                "id": 1963,
                "alias": ["宜州"]
            }
        },
        "来宾市": {
            "id": 230,
            "alias": ["来宾"],
            "兴宾区": {
                "id": 1964,
                "alias": ["兴宾"]
            },
            "districts": ["兴宾区", "忻城县", "象州县", "武宣县", "金秀瑶族自治县", "合山市"],
            "忻城县": {
                "id": 1965,
                "alias": ["忻城"]
            },
            "象州县": {
                "id": 1966,
                "alias": ["象州"]
            },
            "武宣县": {
                "id": 1967,
                "alias": ["武宣"]
            },
            "金秀瑶族自治县": {
                "id": 1968,
                "alias": ["金秀"]
            },
            "合山市": {
                "id": 1969,
                "alias": ["合山"]
            }
        },
        "崇左市": {
            "id": 231,
            "alias": ["崇左"],
            "扶绥县": {
                "id": 1971,
                "alias": ["扶绥"]
            },
            "districts": ["扶绥县", "宁明县", "龙州县", "大新县", "天等县", "凭祥市", "江州区"],
            "宁明县": {
                "id": 1972,
                "alias": ["宁明"]
            },
            "龙州县": {
                "id": 1973,
                "alias": ["龙州"]
            },
            "大新县": {
                "id": 1974,
                "alias": ["大新"]
            },
            "天等县": {
                "id": 1975,
                "alias": ["天等"]
            },
            "凭祥市": {
                "id": 1976,
                "alias": ["凭祥"]
            },
            "江州区": {
                "id": 3394,
                "alias": ["江州"]
            }
        }
    },
    "海南省": {
        "alias": ["海南"],
        "id": 21,
        "cities": ["海口市", "三亚市", "三沙市", "儋州市"],
        "海口市": {
            "id": 232,
            "alias": ["海口"],
            "秀英区": {
                "id": 1977,
                "alias": ["秀英"]
            },
            "districts": ["秀英区", "龙华区", "琼山区", "美兰区"],
            "龙华区": {
                "id": 1978,
                "alias": ["龙华"]
            },
            "琼山区": {
                "id": 1979,
                "alias": ["琼山"]
            },
            "美兰区": {
                "id": 1980,
                "alias": ["美兰"]
            }
        },
        "三亚市": {
            "id": 233,
            "alias": ["三亚"],
            "海棠区": {
                "id": 3477,
                "alias": ["海棠"]
            },
            "districts": ["海棠区", "吉阳区", "天涯区", "崖州区"],
            "吉阳区": {
                "id": 3478,
                "alias": ["吉阳"]
            },
            "天涯区": {
                "id": 3479,
                "alias": ["天涯"]
            },
            "崖州区": {
                "id": 3480,
                "alias": ["崖州"]
            }
        },
        "三沙市": {
            "id": 370,
            "alias": ["三沙"],
            "西沙群岛": {
                "id": 3481,
                "alias": []
            },
            "districts": ["西沙群岛", "南沙群岛", "中沙群岛的岛礁及其海域"],
            "南沙群岛": {
                "id": 3482,
                "alias": []
            },
            "中沙群岛的岛礁及其海域": {
                "id": 3483,
                "alias": []
            }
        },
        "儋州市": {
            "id": 371,
            "alias": ["儋州"],
            "那大镇": {
                "id": 3484,
                "alias": []
            },
            "districts": ["那大镇", "和庆镇", "南丰镇", "大成镇", "雅星镇", "兰洋镇", "光村镇", "木棠镇", "海头镇", "峨蔓镇", "王五镇", "白马井镇", "中和镇", "排浦镇", "东成镇", "新州镇", "洋浦经济开发区", "华南热作学院"],
            "和庆镇": {
                "id": 3485,
                "alias": []
            },
            "南丰镇": {
                "id": 3486,
                "alias": []
            },
            "大成镇": {
                "id": 3487,
                "alias": []
            },
            "雅星镇": {
                "id": 3488,
                "alias": []
            },
            "兰洋镇": {
                "id": 3489,
                "alias": []
            },
            "光村镇": {
                "id": 3490,
                "alias": []
            },
            "木棠镇": {
                "id": 3491,
                "alias": []
            },
            "海头镇": {
                "id": 3492,
                "alias": []
            },
            "峨蔓镇": {
                "id": 3493,
                "alias": []
            },
            "王五镇": {
                "id": 3494,
                "alias": []
            },
            "白马井镇": {
                "id": 3495,
                "alias": []
            },
            "中和镇": {
                "id": 3496,
                "alias": []
            },
            "排浦镇": {
                "id": 3497,
                "alias": []
            },
            "东成镇": {
                "id": 3498,
                "alias": []
            },
            "新州镇": {
                "id": 3499,
                "alias": []
            },
            "洋浦经济开发区": {
                "id": 3500,
                "alias": ["洋浦经济开发"]
            },
            "华南热作学院": {
                "id": 3501,
                "alias": []
            }
        }
    },
    "重庆市": {
        "alias": ["重庆"],
        "id": 22,
        "cities": ["重庆市"],
        "重庆市": {
            "id": 234,
            "alias": ["重庆"],
            "万州区": {
                "id": 2000,
                "alias": ["万州"]
            },
            "districts": ["万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "渝北区", "巴南区", "黔江区", "长寿区", "綦江区", "潼南区", "铜梁区", "大足区", "荣昌区", "璧山区", "梁平区", "武隆区", "江津区", "合川区", "永川区", "南川区", "开州区"],
            "涪陵区": {
                "id": 2001,
                "alias": ["涪陵"]
            },
            "渝中区": {
                "id": 2002,
                "alias": ["渝中"]
            },
            "大渡口区": {
                "id": 2003,
                "alias": ["大渡口"]
            },
            "江北区": {
                "id": 2004,
                "alias": ["江北"]
            },
            "沙坪坝区": {
                "id": 2005,
                "alias": ["沙坪坝"]
            },
            "九龙坡区": {
                "id": 2006,
                "alias": ["九龙坡"]
            },
            "南岸区": {
                "id": 2007,
                "alias": ["南岸"]
            },
            "北碚区": {
                "id": 2008,
                "alias": ["北碚"]
            },
            "渝北区": {
                "id": 2011,
                "alias": ["渝北"]
            },
            "巴南区": {
                "id": 2012,
                "alias": ["巴南"]
            },
            "黔江区": {
                "id": 2013,
                "alias": ["黔江"]
            },
            "长寿区": {
                "id": 2014,
                "alias": ["长寿"]
            },
            "綦江区": {
                "id": 2015,
                "alias": ["綦江"]
            },
            "潼南区": {
                "id": 2016,
                "alias": ["潼南"]
            },
            "铜梁区": {
                "id": 2017,
                "alias": ["铜梁"]
            },
            "大足区": {
                "id": 2018,
                "alias": ["大足"]
            },
            "荣昌区": {
                "id": 2019,
                "alias": ["荣昌"]
            },
            "璧山区": {
                "id": 2020,
                "alias": ["璧山"]
            },
            "梁平区": {
                "id": 2021,
                "alias": ["梁平"]
            },
            "武隆区": {
                "id": 2025,
                "alias": ["武隆"]
            },
            "江津区": {
                "id": 2036,
                "alias": ["江津"]
            },
            "合川区": {
                "id": 2037,
                "alias": ["合川"]
            },
            "永川区": {
                "id": 2038,
                "alias": ["永川"]
            },
            "南川区": {
                "id": 2039,
                "alias": ["南川"]
            },
            "开州区": {
                "id": 3553,
                "alias": ["开州"]
            }
        }
    },
    "四川省": {
        "alias": ["四川"],
        "id": 23,
        "cities": ["成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市", "雅安市", "巴中市", "资阳市", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"],
        "成都市": {
            "id": 235,
            "alias": ["成都"],
            "锦江区": {
                "id": 2040,
                "alias": ["锦江"]
            },
            "districts": ["锦江区", "青羊区", "金牛区", "武侯区", "成华区", "龙泉驿区", "青白江区", "新都区", "温江区", "金堂县", "双流区", "大邑县", "蒲江县", "新津县", "都江堰市", "彭州市", "邛崃市", "崇州市", "郫都区", "简阳市"],
            "青羊区": {
                "id": 2041,
                "alias": ["青羊"]
            },
            "金牛区": {
                "id": 2042,
                "alias": ["金牛"]
            },
            "武侯区": {
                "id": 2043,
                "alias": ["武侯"]
            },
            "成华区": {
                "id": 2044,
                "alias": ["成华"]
            },
            "龙泉驿区": {
                "id": 2045,
                "alias": ["龙泉驿"]
            },
            "青白江区": {
                "id": 2046,
                "alias": ["青白江"]
            },
            "新都区": {
                "id": 2047,
                "alias": ["新都"]
            },
            "温江区": {
                "id": 2048,
                "alias": ["温江"]
            },
            "金堂县": {
                "id": 2049,
                "alias": ["金堂"]
            },
            "双流区": {
                "id": 2050,
                "alias": ["双流"]
            },
            "大邑县": {
                "id": 2052,
                "alias": ["大邑"]
            },
            "蒲江县": {
                "id": 2053,
                "alias": ["蒲江"]
            },
            "新津县": {
                "id": 2054,
                "alias": ["新津"]
            },
            "都江堰市": {
                "id": 2055,
                "alias": ["都江堰"]
            },
            "彭州市": {
                "id": 2056,
                "alias": ["彭州"]
            },
            "邛崃市": {
                "id": 2057,
                "alias": ["邛崃"]
            },
            "崇州市": {
                "id": 2058,
                "alias": ["崇州"]
            },
            "郫都区": {
                "id": 3261,
                "alias": ["郫都"]
            },
            "简阳市": {
                "id": 3262,
                "alias": ["简阳"]
            }
        },
        "自贡市": {
            "id": 236,
            "alias": ["自贡"],
            "自流井区": {
                "id": 2059,
                "alias": ["自流井"]
            },
            "districts": ["自流井区", "贡井区", "大安区", "沿滩区", "荣县", "富顺县"],
            "贡井区": {
                "id": 2060,
                "alias": ["贡井"]
            },
            "大安区": {
                "id": 2061,
                "alias": ["大安"]
            },
            "沿滩区": {
                "id": 2062,
                "alias": ["沿滩"]
            },
            "荣县": {
                "id": 2063,
                "alias": []
            },
            "富顺县": {
                "id": 2064,
                "alias": ["富顺"]
            }
        },
        "攀枝花市": {
            "id": 237,
            "alias": ["攀枝花"],
            "东区": {
                "id": 2065,
                "alias": []
            },
            "districts": ["东区", "西区", "仁和区", "米易县", "盐边县"],
            "西区": {
                "id": 2066,
                "alias": []
            },
            "仁和区": {
                "id": 2067,
                "alias": ["仁和"]
            },
            "米易县": {
                "id": 2068,
                "alias": ["米易"]
            },
            "盐边县": {
                "id": 2069,
                "alias": ["盐边"]
            }
        },
        "泸州市": {
            "id": 238,
            "alias": ["泸州"],
            "江阳区": {
                "id": 2070,
                "alias": ["江阳"]
            },
            "districts": ["江阳区", "纳溪区", "龙马潭区", "泸县", "合江县", "叙永县", "古蔺县"],
            "纳溪区": {
                "id": 2071,
                "alias": ["纳溪"]
            },
            "龙马潭区": {
                "id": 2072,
                "alias": ["龙马潭"]
            },
            "泸县": {
                "id": 2073,
                "alias": []
            },
            "合江县": {
                "id": 2074,
                "alias": ["合江"]
            },
            "叙永县": {
                "id": 2075,
                "alias": ["叙永"]
            },
            "古蔺县": {
                "id": 2076,
                "alias": ["古蔺"]
            }
        },
        "德阳市": {
            "id": 239,
            "alias": ["德阳"],
            "旌阳区": {
                "id": 2077,
                "alias": ["旌阳"]
            },
            "districts": ["旌阳区", "中江县", "罗江区", "广汉市", "什邡市", "绵竹市"],
            "中江县": {
                "id": 2078,
                "alias": ["中江"]
            },
            "罗江区": {
                "id": 2079,
                "alias": ["罗江"]
            },
            "广汉市": {
                "id": 2080,
                "alias": ["广汉"]
            },
            "什邡市": {
                "id": 2081,
                "alias": ["什邡"]
            },
            "绵竹市": {
                "id": 2082,
                "alias": ["绵竹"]
            }
        },
        "绵阳市": {
            "id": 240,
            "alias": ["绵阳"],
            "涪城区": {
                "id": 2083,
                "alias": ["涪城"]
            },
            "districts": ["涪城区", "游仙区", "三台县", "盐亭县", "梓潼县", "北川羌族自治县", "平武县", "江油市", "安州区"],
            "游仙区": {
                "id": 2084,
                "alias": ["游仙"]
            },
            "三台县": {
                "id": 2085,
                "alias": ["三台"]
            },
            "盐亭县": {
                "id": 2086,
                "alias": ["盐亭"]
            },
            "梓潼县": {
                "id": 2088,
                "alias": ["梓潼"]
            },
            "北川羌族自治县": {
                "id": 2089,
                "alias": ["北川"]
            },
            "平武县": {
                "id": 2090,
                "alias": ["平武"]
            },
            "江油市": {
                "id": 2091,
                "alias": ["江油"]
            },
            "安州区": {
                "id": 3263,
                "alias": ["安州"]
            }
        },
        "广元市": {
            "id": 241,
            "alias": ["广元"],
            "朝天区": {
                "id": 2094,
                "alias": ["朝天"]
            },
            "districts": ["朝天区", "旺苍县", "青川县", "剑阁县", "苍溪县", "利州区", "昭化区"],
            "旺苍县": {
                "id": 2095,
                "alias": ["旺苍"]
            },
            "青川县": {
                "id": 2096,
                "alias": ["青川"]
            },
            "剑阁县": {
                "id": 2097,
                "alias": ["剑阁"]
            },
            "苍溪县": {
                "id": 2098,
                "alias": ["苍溪"]
            },
            "利州区": {
                "id": 3264,
                "alias": ["利州"]
            },
            "昭化区": {
                "id": 3265,
                "alias": ["昭化"]
            }
        },
        "遂宁市": {
            "id": 242,
            "alias": ["遂宁"],
            "船山区": {
                "id": 2099,
                "alias": ["船山"]
            },
            "districts": ["船山区", "安居区", "蓬溪县", "射洪县", "大英县"],
            "安居区": {
                "id": 2100,
                "alias": ["安居"]
            },
            "蓬溪县": {
                "id": 2101,
                "alias": ["蓬溪"]
            },
            "射洪县": {
                "id": 2102,
                "alias": ["射洪"]
            },
            "大英县": {
                "id": 2103,
                "alias": ["大英"]
            }
        },
        "内江市": {
            "id": 243,
            "alias": ["内江"],
            "市中区": {
                "id": 2104,
                "alias": ["市中"]
            },
            "districts": ["市中区", "东兴区", "威远县", "资中县", "隆昌市", "内江经济开发区"],
            "东兴区": {
                "id": 2105,
                "alias": ["东兴"]
            },
            "威远县": {
                "id": 2106,
                "alias": ["威远"]
            },
            "资中县": {
                "id": 2107,
                "alias": ["资中"]
            },
            "隆昌市": {
                "id": 2108,
                "alias": ["隆昌"]
            },
            "内江经济开发区": {
                "id": 3266,
                "alias": ["内江经济开发"]
            }
        },
        "乐山市": {
            "id": 244,
            "alias": ["乐山"],
            "市中区": {
                "id": 2109,
                "alias": ["市中"]
            },
            "districts": ["市中区", "沙湾区", "五通桥区", "金口河区", "犍为县", "井研县", "夹江县", "沐川县", "峨边彝族自治县", "马边彝族自治县", "峨眉山市"],
            "沙湾区": {
                "id": 2110,
                "alias": ["沙湾"]
            },
            "五通桥区": {
                "id": 2111,
                "alias": ["五通桥"]
            },
            "金口河区": {
                "id": 2112,
                "alias": ["金口河"]
            },
            "犍为县": {
                "id": 2113,
                "alias": ["犍为"]
            },
            "井研县": {
                "id": 2114,
                "alias": ["井研"]
            },
            "夹江县": {
                "id": 2115,
                "alias": ["夹江"]
            },
            "沐川县": {
                "id": 2116,
                "alias": ["沐川"]
            },
            "峨边彝族自治县": {
                "id": 2117,
                "alias": ["峨边"]
            },
            "马边彝族自治县": {
                "id": 2118,
                "alias": ["马边"]
            },
            "峨眉山市": {
                "id": 2119,
                "alias": ["峨眉山"]
            }
        },
        "南充市": {
            "id": 245,
            "alias": ["南充"],
            "顺庆区": {
                "id": 2120,
                "alias": ["顺庆"]
            },
            "districts": ["顺庆区", "高坪区", "嘉陵区", "南部县", "营山县", "蓬安县", "仪陇县", "西充县", "阆中市"],
            "高坪区": {
                "id": 2121,
                "alias": ["高坪"]
            },
            "嘉陵区": {
                "id": 2122,
                "alias": ["嘉陵"]
            },
            "南部县": {
                "id": 2123,
                "alias": ["南部"]
            },
            "营山县": {
                "id": 2124,
                "alias": ["营山"]
            },
            "蓬安县": {
                "id": 2125,
                "alias": ["蓬安"]
            },
            "仪陇县": {
                "id": 2126,
                "alias": ["仪陇"]
            },
            "西充县": {
                "id": 2127,
                "alias": ["西充"]
            },
            "阆中市": {
                "id": 2128,
                "alias": ["阆中"]
            }
        },
        "眉山市": {
            "id": 246,
            "alias": ["眉山"],
            "东坡区": {
                "id": 2129,
                "alias": ["东坡"]
            },
            "districts": ["东坡区", "仁寿县", "彭山区", "洪雅县", "丹棱县", "青神县"],
            "仁寿县": {
                "id": 2130,
                "alias": ["仁寿"]
            },
            "彭山区": {
                "id": 2131,
                "alias": ["彭山"]
            },
            "洪雅县": {
                "id": 2132,
                "alias": ["洪雅"]
            },
            "丹棱县": {
                "id": 2133,
                "alias": ["丹棱"]
            },
            "青神县": {
                "id": 2134,
                "alias": ["青神"]
            }
        },
        "宜宾市": {
            "id": 247,
            "alias": ["宜宾"],
            "翠屏区": {
                "id": 2135,
                "alias": ["翠屏"]
            },
            "districts": ["翠屏区", "宜宾县", "南溪区", "江安县", "长宁县", "高县", "珙县", "筠连县", "兴文县", "屏山县"],
            "宜宾县": {
                "id": 2136,
                "alias": ["宜宾"]
            },
            "南溪区": {
                "id": 2137,
                "alias": ["南溪"]
            },
            "江安县": {
                "id": 2138,
                "alias": ["江安"]
            },
            "长宁县": {
                "id": 2139,
                "alias": ["长宁"]
            },
            "高县": {
                "id": 2140,
                "alias": []
            },
            "珙县": {
                "id": 2141,
                "alias": []
            },
            "筠连县": {
                "id": 2142,
                "alias": ["筠连"]
            },
            "兴文县": {
                "id": 2143,
                "alias": ["兴文"]
            },
            "屏山县": {
                "id": 2144,
                "alias": ["屏山"]
            }
        },
        "广安市": {
            "id": 248,
            "alias": ["广安"],
            "广安区": {
                "id": 2145,
                "alias": ["广安"]
            },
            "districts": ["广安区", "岳池县", "武胜县", "邻水县", "华蓥市", "前锋区"],
            "岳池县": {
                "id": 2146,
                "alias": ["岳池"]
            },
            "武胜县": {
                "id": 2147,
                "alias": ["武胜"]
            },
            "邻水县": {
                "id": 2148,
                "alias": ["邻水"]
            },
            "华蓥市": {
                "id": 2149,
                "alias": ["华蓥"]
            },
            "前锋区": {
                "id": 3267,
                "alias": ["前锋"]
            }
        },
        "达州市": {
            "id": 249,
            "alias": ["达州"],
            "通川区": {
                "id": 2150,
                "alias": ["通川"]
            },
            "districts": ["通川区", "宣汉县", "开江县", "大竹县", "渠县", "万源市", "达川区", "达州经济开发区"],
            "宣汉县": {
                "id": 2152,
                "alias": ["宣汉"]
            },
            "开江县": {
                "id": 2153,
                "alias": ["开江"]
            },
            "大竹县": {
                "id": 2154,
                "alias": ["大竹"]
            },
            "渠县": {
                "id": 2155,
                "alias": []
            },
            "万源市": {
                "id": 2156,
                "alias": ["万源"]
            },
            "达川区": {
                "id": 3268,
                "alias": ["达川"]
            },
            "达州经济开发区": {
                "id": 3269,
                "alias": ["达州经济开发"]
            }
        },
        "雅安市": {
            "id": 250,
            "alias": ["雅安"],
            "雨城区": {
                "id": 2157,
                "alias": ["雨城"]
            },
            "districts": ["雨城区", "名山区", "荥经县", "汉源县", "石棉县", "天全县", "芦山县", "宝兴县"],
            "名山区": {
                "id": 2158,
                "alias": ["名山"]
            },
            "荥经县": {
                "id": 2159,
                "alias": ["荥经"]
            },
            "汉源县": {
                "id": 2160,
                "alias": ["汉源"]
            },
            "石棉县": {
                "id": 2161,
                "alias": ["石棉"]
            },
            "天全县": {
                "id": 2162,
                "alias": ["天全"]
            },
            "芦山县": {
                "id": 2163,
                "alias": ["芦山"]
            },
            "宝兴县": {
                "id": 2164,
                "alias": ["宝兴"]
            }
        },
        "巴中市": {
            "id": 251,
            "alias": ["巴中"],
            "巴州区": {
                "id": 2165,
                "alias": ["巴州"]
            },
            "districts": ["巴州区", "通江县", "南江县", "平昌县", "恩阳区", "巴中经济开发区"],
            "通江县": {
                "id": 2166,
                "alias": ["通江"]
            },
            "南江县": {
                "id": 2167,
                "alias": ["南江"]
            },
            "平昌县": {
                "id": 2168,
                "alias": ["平昌"]
            },
            "恩阳区": {
                "id": 3270,
                "alias": ["恩阳"]
            },
            "巴中经济开发区": {
                "id": 3271,
                "alias": ["巴中经济开发"]
            }
        },
        "资阳市": {
            "id": 252,
            "alias": ["资阳"],
            "雁江区": {
                "id": 2169,
                "alias": ["雁江"]
            },
            "districts": ["雁江区", "安岳县", "乐至县"],
            "安岳县": {
                "id": 2170,
                "alias": ["安岳"]
            },
            "乐至县": {
                "id": 2171,
                "alias": ["乐至"]
            }
        },
        "阿坝藏族羌族自治州": {
            "id": 253,
            "alias": ["阿坝"],
            "汶川县": {
                "id": 2173,
                "alias": ["汶川"]
            },
            "districts": ["汶川县", "理县", "茂县", "松潘县", "九寨沟县", "金川县", "小金县", "黑水县", "马尔康市", "壤塘县", "阿坝县", "若尔盖县", "红原县"],
            "理县": {
                "id": 2174,
                "alias": []
            },
            "茂县": {
                "id": 2175,
                "alias": []
            },
            "松潘县": {
                "id": 2176,
                "alias": ["松潘"]
            },
            "九寨沟县": {
                "id": 2177,
                "alias": ["九寨沟"]
            },
            "金川县": {
                "id": 2178,
                "alias": ["金川"]
            },
            "小金县": {
                "id": 2179,
                "alias": ["小金"]
            },
            "黑水县": {
                "id": 2180,
                "alias": ["黑水"]
            },
            "马尔康市": {
                "id": 2181,
                "alias": ["马尔康"]
            },
            "壤塘县": {
                "id": 2182,
                "alias": ["壤塘"]
            },
            "阿坝县": {
                "id": 2183,
                "alias": ["阿坝"]
            },
            "若尔盖县": {
                "id": 2184,
                "alias": ["若尔盖"]
            },
            "红原县": {
                "id": 2185,
                "alias": ["红原"]
            }
        },
        "甘孜藏族自治州": {
            "id": 254,
            "alias": ["甘孜"],
            "康定市": {
                "id": 2186,
                "alias": ["康定"]
            },
            "districts": ["康定市", "泸定县", "丹巴县", "九龙县", "雅江县", "道孚县", "炉霍县", "甘孜县", "新龙县", "德格县", "白玉县", "石渠县", "色达县", "理塘县", "巴塘县", "乡城县", "稻城县", "得荣县"],
            "泸定县": {
                "id": 2187,
                "alias": ["泸定"]
            },
            "丹巴县": {
                "id": 2188,
                "alias": ["丹巴"]
            },
            "九龙县": {
                "id": 2189,
                "alias": ["九龙"]
            },
            "雅江县": {
                "id": 2190,
                "alias": ["雅江"]
            },
            "道孚县": {
                "id": 2191,
                "alias": ["道孚"]
            },
            "炉霍县": {
                "id": 2192,
                "alias": ["炉霍"]
            },
            "甘孜县": {
                "id": 2193,
                "alias": ["甘孜"]
            },
            "新龙县": {
                "id": 2194,
                "alias": ["新龙"]
            },
            "德格县": {
                "id": 2195,
                "alias": ["德格"]
            },
            "白玉县": {
                "id": 2196,
                "alias": ["白玉"]
            },
            "石渠县": {
                "id": 2197,
                "alias": ["石渠"]
            },
            "色达县": {
                "id": 2198,
                "alias": ["色达"]
            },
            "理塘县": {
                "id": 2199,
                "alias": ["理塘"]
            },
            "巴塘县": {
                "id": 2200,
                "alias": ["巴塘"]
            },
            "乡城县": {
                "id": 2201,
                "alias": ["乡城"]
            },
            "稻城县": {
                "id": 2202,
                "alias": ["稻城"]
            },
            "得荣县": {
                "id": 2203,
                "alias": ["得荣"]
            }
        },
        "凉山彝族自治州": {
            "id": 255,
            "alias": ["凉山"],
            "西昌市": {
                "id": 2204,
                "alias": ["西昌"]
            },
            "districts": ["西昌市", "木里藏族自治县", "盐源县", "德昌县", "会理县", "会东县", "宁南县", "普格县", "布拖县", "金阳县", "昭觉县", "喜德县", "冕宁县", "越西县", "甘洛县", "美姑县", "雷波县"],
            "木里藏族自治县": {
                "id": 2205,
                "alias": ["木里"]
            },
            "盐源县": {
                "id": 2206,
                "alias": ["盐源"]
            },
            "德昌县": {
                "id": 2207,
                "alias": ["德昌"]
            },
            "会理县": {
                "id": 2208,
                "alias": ["会理"]
            },
            "会东县": {
                "id": 2209,
                "alias": ["会东"]
            },
            "宁南县": {
                "id": 2210,
                "alias": ["宁南"]
            },
            "普格县": {
                "id": 2211,
                "alias": ["普格"]
            },
            "布拖县": {
                "id": 2212,
                "alias": ["布拖"]
            },
            "金阳县": {
                "id": 2213,
                "alias": ["金阳"]
            },
            "昭觉县": {
                "id": 2214,
                "alias": ["昭觉"]
            },
            "喜德县": {
                "id": 2215,
                "alias": ["喜德"]
            },
            "冕宁县": {
                "id": 2216,
                "alias": ["冕宁"]
            },
            "越西县": {
                "id": 2217,
                "alias": ["越西"]
            },
            "甘洛县": {
                "id": 2218,
                "alias": ["甘洛"]
            },
            "美姑县": {
                "id": 2219,
                "alias": ["美姑"]
            },
            "雷波县": {
                "id": 2220,
                "alias": ["雷波"]
            }
        }
    },
    "贵州省": {
        "alias": ["贵州"],
        "id": 24,
        "cities": ["贵阳市", "六盘水市", "遵义市", "安顺市", "铜仁市", "黔西南布依族苗族自治州", "毕节市", "黔东南苗族侗族自治州", "黔南布依族苗族自治州"],
        "贵阳市": {
            "id": 256,
            "alias": ["贵阳"],
            "南明区": {
                "id": 2221,
                "alias": ["南明"]
            },
            "districts": ["南明区", "云岩区", "花溪区", "乌当区", "白云区", "小河区", "开阳县", "息烽县", "修文县", "清镇市", "观山湖区"],
            "云岩区": {
                "id": 2222,
                "alias": ["云岩"]
            },
            "花溪区": {
                "id": 2223,
                "alias": ["花溪"]
            },
            "乌当区": {
                "id": 2224,
                "alias": ["乌当"]
            },
            "白云区": {
                "id": 2225,
                "alias": ["白云"]
            },
            "小河区": {
                "id": 2226,
                "alias": ["小河"]
            },
            "开阳县": {
                "id": 2227,
                "alias": ["开阳"]
            },
            "息烽县": {
                "id": 2228,
                "alias": ["息烽"]
            },
            "修文县": {
                "id": 2229,
                "alias": ["修文"]
            },
            "清镇市": {
                "id": 2230,
                "alias": ["清镇"]
            },
            "观山湖区": {
                "id": 3545,
                "alias": ["观山湖"]
            }
        },
        "六盘水市": {
            "id": 257,
            "alias": ["六盘水"],
            "钟山区": {
                "id": 2231,
                "alias": ["钟山"]
            },
            "districts": ["钟山区", "六枝特区", "水城县", "盘州市"],
            "六枝特区": {
                "id": 2232,
                "alias": ["六枝特"]
            },
            "水城县": {
                "id": 2233,
                "alias": ["水城"]
            },
            "盘州市": {
                "id": 3546,
                "alias": ["盘州"]
            }
        },
        "遵义市": {
            "id": 258,
            "alias": ["遵义"],
            "红花岗区": {
                "id": 2235,
                "alias": ["红花岗"]
            },
            "districts": ["红花岗区", "汇川区", "遵义县", "桐梓县", "绥阳县", "正安县", "道真仡佬族苗族自治县", "务川仡佬族苗族自治县", "凤冈县", "湄潭县", "余庆县", "习水县", "赤水市", "仁怀市", "播州区"],
            "汇川区": {
                "id": 2236,
                "alias": ["汇川"]
            },
            "遵义县": {
                "id": 2237,
                "alias": ["遵义"]
            },
            "桐梓县": {
                "id": 2238,
                "alias": ["桐梓"]
            },
            "绥阳县": {
                "id": 2239,
                "alias": ["绥阳"]
            },
            "正安县": {
                "id": 2240,
                "alias": ["正安"]
            },
            "道真仡佬族苗族自治县": {
                "id": 2241,
                "alias": ["道真"]
            },
            "务川仡佬族苗族自治县": {
                "id": 2242,
                "alias": ["务川"]
            },
            "凤冈县": {
                "id": 2243,
                "alias": ["凤冈"]
            },
            "湄潭县": {
                "id": 2244,
                "alias": ["湄潭"]
            },
            "余庆县": {
                "id": 2245,
                "alias": ["余庆"]
            },
            "习水县": {
                "id": 2246,
                "alias": ["习水"]
            },
            "赤水市": {
                "id": 2247,
                "alias": ["赤水"]
            },
            "仁怀市": {
                "id": 2248,
                "alias": ["仁怀"]
            },
            "播州区": {
                "id": 3547,
                "alias": ["播州"]
            }
        },
        "安顺市": {
            "id": 259,
            "alias": ["安顺"],
            "西秀区": {
                "id": 2249,
                "alias": ["西秀"]
            },
            "districts": ["西秀区", "平坝区", "普定县", "镇宁布依族苗族自治县", "关岭布依族苗族自治县", "紫云苗族布依族自治县"],
            "平坝区": {
                "id": 2250,
                "alias": ["平坝"]
            },
            "普定县": {
                "id": 2251,
                "alias": ["普定"]
            },
            "镇宁布依族苗族自治县": {
                "id": 2252,
                "alias": ["镇宁"]
            },
            "关岭布依族苗族自治县": {
                "id": 2253,
                "alias": ["关岭"]
            },
            "紫云苗族布依族自治县": {
                "id": 2254,
                "alias": ["紫云"]
            }
        },
        "铜仁市": {
            "id": 260,
            "alias": ["铜仁"],
            "铜仁市": {
                "id": 2255,
                "alias": ["铜仁"]
            },
            "districts": ["铜仁市", "江口县", "玉屏侗族自治县", "石阡县", "思南县", "印江土家族苗族自治县", "德江县", "沿河土家族自治县", "松桃苗族自治县", "万山区", "碧江区"],
            "江口县": {
                "id": 2256,
                "alias": ["江口"]
            },
            "玉屏侗族自治县": {
                "id": 2257,
                "alias": ["玉屏"]
            },
            "石阡县": {
                "id": 2258,
                "alias": ["石阡"]
            },
            "思南县": {
                "id": 2259,
                "alias": ["思南"]
            },
            "印江土家族苗族自治县": {
                "id": 2260,
                "alias": ["印江"]
            },
            "德江县": {
                "id": 2261,
                "alias": ["德江"]
            },
            "沿河土家族自治县": {
                "id": 2262,
                "alias": ["沿河"]
            },
            "松桃苗族自治县": {
                "id": 2263,
                "alias": ["松桃"]
            },
            "万山区": {
                "id": 2264,
                "alias": ["万山"]
            },
            "碧江区": {
                "id": 3548,
                "alias": ["碧江"]
            }
        },
        "黔西南布依族苗族自治州": {
            "id": 261,
            "alias": ["黔西南"],
            "兴义市": {
                "id": 2265,
                "alias": ["兴义"]
            },
            "districts": ["兴义市", "兴仁县", "普安县", "晴隆县", "贞丰县", "望谟县", "册亨县", "安龙县"],
            "兴仁县": {
                "id": 2266,
                "alias": ["兴仁"]
            },
            "普安县": {
                "id": 2267,
                "alias": ["普安"]
            },
            "晴隆县": {
                "id": 2268,
                "alias": ["晴隆"]
            },
            "贞丰县": {
                "id": 2269,
                "alias": ["贞丰"]
            },
            "望谟县": {
                "id": 2270,
                "alias": ["望谟"]
            },
            "册亨县": {
                "id": 2271,
                "alias": ["册亨"]
            },
            "安龙县": {
                "id": 2272,
                "alias": ["安龙"]
            }
        },
        "毕节市": {
            "id": 262,
            "alias": ["毕节"],
            "大方县": {
                "id": 2274,
                "alias": ["大方"]
            },
            "districts": ["大方县", "黔西县", "金沙县", "织金县", "纳雍县", "威宁彝族回族苗族自治县", "赫章县", "七星关区"],
            "黔西县": {
                "id": 2275,
                "alias": ["黔西"]
            },
            "金沙县": {
                "id": 2276,
                "alias": ["金沙"]
            },
            "织金县": {
                "id": 2277,
                "alias": ["织金"]
            },
            "纳雍县": {
                "id": 2278,
                "alias": ["纳雍"]
            },
            "威宁彝族回族苗族自治县": {
                "id": 2279,
                "alias": ["威宁"]
            },
            "赫章县": {
                "id": 2280,
                "alias": ["赫章"]
            },
            "七星关区": {
                "id": 3549,
                "alias": ["七星关"]
            }
        },
        "黔东南苗族侗族自治州": {
            "id": 263,
            "alias": ["黔东南"],
            "凯里市": {
                "id": 2281,
                "alias": ["凯里"]
            },
            "districts": ["凯里市", "黄平县", "施秉县", "三穗县", "镇远县", "岑巩县", "天柱县", "锦屏县", "剑河县", "台江县", "黎平县", "榕江县", "从江县", "雷山县", "麻江县", "丹寨县"],
            "黄平县": {
                "id": 2282,
                "alias": ["黄平"]
            },
            "施秉县": {
                "id": 2283,
                "alias": ["施秉"]
            },
            "三穗县": {
                "id": 2284,
                "alias": ["三穗"]
            },
            "镇远县": {
                "id": 2285,
                "alias": ["镇远"]
            },
            "岑巩县": {
                "id": 2286,
                "alias": ["岑巩"]
            },
            "天柱县": {
                "id": 2287,
                "alias": ["天柱"]
            },
            "锦屏县": {
                "id": 2288,
                "alias": ["锦屏"]
            },
            "剑河县": {
                "id": 2289,
                "alias": ["剑河"]
            },
            "台江县": {
                "id": 2290,
                "alias": ["台江"]
            },
            "黎平县": {
                "id": 2291,
                "alias": ["黎平"]
            },
            "榕江县": {
                "id": 2292,
                "alias": ["榕江"]
            },
            "从江县": {
                "id": 2293,
                "alias": ["从江"]
            },
            "雷山县": {
                "id": 2294,
                "alias": ["雷山"]
            },
            "麻江县": {
                "id": 2295,
                "alias": ["麻江"]
            },
            "丹寨县": {
                "id": 2296,
                "alias": ["丹寨"]
            }
        },
        "黔南布依族苗族自治州": {
            "id": 264,
            "alias": ["黔南"],
            "都匀市": {
                "id": 2297,
                "alias": ["都匀"]
            },
            "districts": ["都匀市", "福泉市", "荔波县", "贵定县", "瓮安县", "独山县", "平塘县", "罗甸县", "长顺县", "龙里县", "惠水县", "三都水族自治县"],
            "福泉市": {
                "id": 2298,
                "alias": ["福泉"]
            },
            "荔波县": {
                "id": 2299,
                "alias": ["荔波"]
            },
            "贵定县": {
                "id": 2300,
                "alias": ["贵定"]
            },
            "瓮安县": {
                "id": 2301,
                "alias": ["瓮安"]
            },
            "独山县": {
                "id": 2302,
                "alias": ["独山"]
            },
            "平塘县": {
                "id": 2303,
                "alias": ["平塘"]
            },
            "罗甸县": {
                "id": 2304,
                "alias": ["罗甸"]
            },
            "长顺县": {
                "id": 2305,
                "alias": ["长顺"]
            },
            "龙里县": {
                "id": 2306,
                "alias": ["龙里"]
            },
            "惠水县": {
                "id": 2307,
                "alias": ["惠水"]
            },
            "三都水族自治县": {
                "id": 2308,
                "alias": ["三都"]
            }
        }
    },
    "云南省": {
        "alias": ["云南"],
        "id": 25,
        "cities": ["昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "思茅市", "临沧市", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州", "西双版纳傣族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州", "普洱市"],
        "昆明市": {
            "id": 265,
            "alias": ["昆明"],
            "五华区": {
                "id": 2309,
                "alias": ["五华"]
            },
            "districts": ["五华区", "盘龙区", "官渡区", "西山区", "东川区", "呈贡区", "晋宁区", "富民县", "宜良县", "石林彝族自治县", "嵩明县", "禄劝彝族苗族自治县", "寻甸回族彝族自治县", "安宁市"],
            "盘龙区": {
                "id": 2310,
                "alias": ["盘龙"]
            },
            "官渡区": {
                "id": 2311,
                "alias": ["官渡"]
            },
            "西山区": {
                "id": 2312,
                "alias": ["西山"]
            },
            "东川区": {
                "id": 2313,
                "alias": ["东川"]
            },
            "呈贡区": {
                "id": 2314,
                "alias": ["呈贡"]
            },
            "晋宁区": {
                "id": 2315,
                "alias": ["晋宁"]
            },
            "富民县": {
                "id": 2316,
                "alias": ["富民"]
            },
            "宜良县": {
                "id": 2317,
                "alias": ["宜良"]
            },
            "石林彝族自治县": {
                "id": 2318,
                "alias": ["石林"]
            },
            "嵩明县": {
                "id": 2319,
                "alias": ["嵩明"]
            },
            "禄劝彝族苗族自治县": {
                "id": 2320,
                "alias": ["禄劝"]
            },
            "寻甸回族彝族自治县": {
                "id": 2321,
                "alias": ["寻甸"]
            },
            "安宁市": {
                "id": 2322,
                "alias": ["安宁"]
            }
        },
        "曲靖市": {
            "id": 266,
            "alias": ["曲靖"],
            "麒麟区": {
                "id": 2323,
                "alias": ["麒麟"]
            },
            "districts": ["麒麟区", "马龙县", "陆良县", "师宗县", "罗平县", "富源县", "会泽县", "沾益区", "宣威市"],
            "马龙县": {
                "id": 2324,
                "alias": ["马龙"]
            },
            "陆良县": {
                "id": 2325,
                "alias": ["陆良"]
            },
            "师宗县": {
                "id": 2326,
                "alias": ["师宗"]
            },
            "罗平县": {
                "id": 2327,
                "alias": ["罗平"]
            },
            "富源县": {
                "id": 2328,
                "alias": ["富源"]
            },
            "会泽县": {
                "id": 2329,
                "alias": ["会泽"]
            },
            "沾益区": {
                "id": 2330,
                "alias": ["沾益"]
            },
            "宣威市": {
                "id": 2331,
                "alias": ["宣威"]
            }
        },
        "玉溪市": {
            "id": 267,
            "alias": ["玉溪"],
            "红塔区": {
                "id": 2332,
                "alias": ["红塔"]
            },
            "districts": ["红塔区", "江川区", "澄江县", "通海县", "华宁县", "易门县", "峨山彝族自治县", "新平彝族傣族自治县", "元江哈尼族彝族傣族自治县"],
            "江川区": {
                "id": 2333,
                "alias": ["江川"]
            },
            "澄江县": {
                "id": 2334,
                "alias": ["澄江"]
            },
            "通海县": {
                "id": 2335,
                "alias": ["通海"]
            },
            "华宁县": {
                "id": 2336,
                "alias": ["华宁"]
            },
            "易门县": {
                "id": 2337,
                "alias": ["易门"]
            },
            "峨山彝族自治县": {
                "id": 2338,
                "alias": ["峨山"]
            },
            "新平彝族傣族自治县": {
                "id": 2339,
                "alias": ["新平"]
            },
            "元江哈尼族彝族傣族自治县": {
                "id": 2340,
                "alias": ["元江"]
            }
        },
        "保山市": {
            "id": 268,
            "alias": ["保山"],
            "隆阳区": {
                "id": 2341,
                "alias": ["隆阳"]
            },
            "districts": ["隆阳区", "施甸县", "腾冲市", "龙陵县", "昌宁县"],
            "施甸县": {
                "id": 2342,
                "alias": ["施甸"]
            },
            "腾冲市": {
                "id": 2343,
                "alias": ["腾冲"]
            },
            "龙陵县": {
                "id": 2344,
                "alias": ["龙陵"]
            },
            "昌宁县": {
                "id": 2345,
                "alias": ["昌宁"]
            }
        },
        "昭通市": {
            "id": 269,
            "alias": ["昭通"],
            "昭阳区": {
                "id": 2346,
                "alias": ["昭阳"]
            },
            "districts": ["昭阳区", "鲁甸县", "巧家县", "盐津县", "大关县", "永善县", "绥江县", "镇雄县", "彝良县", "威信县", "水富县"],
            "鲁甸县": {
                "id": 2347,
                "alias": ["鲁甸"]
            },
            "巧家县": {
                "id": 2348,
                "alias": ["巧家"]
            },
            "盐津县": {
                "id": 2349,
                "alias": ["盐津"]
            },
            "大关县": {
                "id": 2350,
                "alias": ["大关"]
            },
            "永善县": {
                "id": 2351,
                "alias": ["永善"]
            },
            "绥江县": {
                "id": 2352,
                "alias": ["绥江"]
            },
            "镇雄县": {
                "id": 2353,
                "alias": ["镇雄"]
            },
            "彝良县": {
                "id": 2354,
                "alias": ["彝良"]
            },
            "威信县": {
                "id": 2355,
                "alias": ["威信"]
            },
            "水富县": {
                "id": 2356,
                "alias": ["水富"]
            }
        },
        "丽江市": {
            "id": 270,
            "alias": ["丽江"],
            "古城区": {
                "id": 2357,
                "alias": ["古城"]
            },
            "districts": ["古城区", "玉龙纳西族自治县", "永胜县", "华坪县", "宁蒗彝族自治县"],
            "玉龙纳西族自治县": {
                "id": 2358,
                "alias": ["玉龙"]
            },
            "永胜县": {
                "id": 2359,
                "alias": ["永胜"]
            },
            "华坪县": {
                "id": 2360,
                "alias": ["华坪"]
            },
            "宁蒗彝族自治县": {
                "id": 2361,
                "alias": ["宁蒗"]
            }
        },
        "思茅市": {
            "id": 271,
            "alias": ["思茅"]
        },
        "临沧市": {
            "id": 272,
            "alias": ["临沧"],
            "临翔区": {
                "id": 2372,
                "alias": ["临翔"]
            },
            "districts": ["临翔区", "凤庆县", "云县", "永德县", "镇康县", "双江拉祜族佤族布朗族傣族自治县", "耿马傣族佤族自治县", "沧源佤族自治县"],
            "凤庆县": {
                "id": 2373,
                "alias": ["凤庆"]
            },
            "云县": {
                "id": 2374,
                "alias": []
            },
            "永德县": {
                "id": 2375,
                "alias": ["永德"]
            },
            "镇康县": {
                "id": 2376,
                "alias": ["镇康"]
            },
            "双江拉祜族佤族布朗族傣族自治县": {
                "id": 2377,
                "alias": ["双江"]
            },
            "耿马傣族佤族自治县": {
                "id": 2378,
                "alias": ["耿马"]
            },
            "沧源佤族自治县": {
                "id": 2379,
                "alias": ["沧源"]
            }
        },
        "楚雄彝族自治州": {
            "id": 273,
            "alias": ["楚雄"],
            "楚雄市": {
                "id": 2380,
                "alias": ["楚雄"]
            },
            "districts": ["楚雄市", "双柏县", "牟定县", "南华县", "姚安县", "大姚县", "永仁县", "元谋县", "武定县", "禄丰县"],
            "双柏县": {
                "id": 2381,
                "alias": ["双柏"]
            },
            "牟定县": {
                "id": 2382,
                "alias": ["牟定"]
            },
            "南华县": {
                "id": 2383,
                "alias": ["南华"]
            },
            "姚安县": {
                "id": 2384,
                "alias": ["姚安"]
            },
            "大姚县": {
                "id": 2385,
                "alias": ["大姚"]
            },
            "永仁县": {
                "id": 2386,
                "alias": ["永仁"]
            },
            "元谋县": {
                "id": 2387,
                "alias": ["元谋"]
            },
            "武定县": {
                "id": 2388,
                "alias": ["武定"]
            },
            "禄丰县": {
                "id": 2389,
                "alias": ["禄丰"]
            }
        },
        "红河哈尼族彝族自治州": {
            "id": 274,
            "alias": ["红河"],
            "个旧市": {
                "id": 2390,
                "alias": ["个旧"]
            },
            "districts": ["个旧市", "开远市", "蒙自市", "屏边苗族自治县", "建水县", "石屏县", "弥勒市", "泸西县", "元阳县", "红河县", "金平苗族瑶族傣族自治县", "绿春县", "河口瑶族自治县"],
            "开远市": {
                "id": 2391,
                "alias": ["开远"]
            },
            "蒙自市": {
                "id": 2392,
                "alias": ["蒙自"]
            },
            "屏边苗族自治县": {
                "id": 2393,
                "alias": ["屏边"]
            },
            "建水县": {
                "id": 2394,
                "alias": ["建水"]
            },
            "石屏县": {
                "id": 2395,
                "alias": ["石屏"]
            },
            "弥勒市": {
                "id": 2396,
                "alias": ["弥勒"]
            },
            "泸西县": {
                "id": 2397,
                "alias": ["泸西"]
            },
            "元阳县": {
                "id": 2398,
                "alias": ["元阳"]
            },
            "红河县": {
                "id": 2399,
                "alias": ["红河"]
            },
            "金平苗族瑶族傣族自治县": {
                "id": 2400,
                "alias": ["金平"]
            },
            "绿春县": {
                "id": 2401,
                "alias": ["绿春"]
            },
            "河口瑶族自治县": {
                "id": 2402,
                "alias": ["河口"]
            }
        },
        "文山壮族苗族自治州": {
            "id": 275,
            "alias": ["文山"],
            "文山市": {
                "id": 2403,
                "alias": ["文山"]
            },
            "districts": ["文山市", "砚山县", "西畴县", "麻栗坡县", "马关县", "丘北县", "广南县", "富宁县"],
            "砚山县": {
                "id": 2404,
                "alias": ["砚山"]
            },
            "西畴县": {
                "id": 2405,
                "alias": ["西畴"]
            },
            "麻栗坡县": {
                "id": 2406,
                "alias": ["麻栗坡"]
            },
            "马关县": {
                "id": 2407,
                "alias": ["马关"]
            },
            "丘北县": {
                "id": 2408,
                "alias": ["丘北"]
            },
            "广南县": {
                "id": 2409,
                "alias": ["广南"]
            },
            "富宁县": {
                "id": 2410,
                "alias": ["富宁"]
            }
        },
        "西双版纳傣族自治州": {
            "id": 276,
            "alias": ["西双版纳"],
            "景洪市": {
                "id": 2411,
                "alias": ["景洪"]
            },
            "districts": ["景洪市", "勐海县", "勐腊县"],
            "勐海县": {
                "id": 2412,
                "alias": ["勐海"]
            },
            "勐腊县": {
                "id": 2413,
                "alias": ["勐腊"]
            }
        },
        "大理白族自治州": {
            "id": 277,
            "alias": ["大理"],
            "大理市": {
                "id": 2414,
                "alias": ["大理"]
            },
            "districts": ["大理市", "漾濞彝族自治县", "祥云县", "宾川县", "弥渡县", "南涧彝族自治县", "巍山彝族回族自治县", "永平县", "云龙县", "洱源县", "剑川县", "鹤庆县"],
            "漾濞彝族自治县": {
                "id": 2415,
                "alias": ["漾濞"]
            },
            "祥云县": {
                "id": 2416,
                "alias": ["祥云"]
            },
            "宾川县": {
                "id": 2417,
                "alias": ["宾川"]
            },
            "弥渡县": {
                "id": 2418,
                "alias": ["弥渡"]
            },
            "南涧彝族自治县": {
                "id": 2419,
                "alias": ["南涧"]
            },
            "巍山彝族回族自治县": {
                "id": 2420,
                "alias": ["巍山"]
            },
            "永平县": {
                "id": 2421,
                "alias": ["永平"]
            },
            "云龙县": {
                "id": 2422,
                "alias": ["云龙"]
            },
            "洱源县": {
                "id": 2423,
                "alias": ["洱源"]
            },
            "剑川县": {
                "id": 2424,
                "alias": ["剑川"]
            },
            "鹤庆县": {
                "id": 2425,
                "alias": ["鹤庆"]
            }
        },
        "德宏傣族景颇族自治州": {
            "id": 278,
            "alias": ["德宏"],
            "瑞丽市": {
                "id": 2426,
                "alias": ["瑞丽"]
            },
            "districts": ["瑞丽市", "梁河县", "盈江县", "陇川县", "芒市"],
            "梁河县": {
                "id": 2428,
                "alias": ["梁河"]
            },
            "盈江县": {
                "id": 2429,
                "alias": ["盈江"]
            },
            "陇川县": {
                "id": 2430,
                "alias": ["陇川"]
            },
            "芒市": {
                "id": 2870,
                "alias": []
            }
        },
        "怒江傈僳族自治州": {
            "id": 279,
            "alias": ["怒江傈僳族"],
            "泸水市": {
                "id": 2431,
                "alias": ["泸水"]
            },
            "districts": ["泸水市", "福贡县", "贡山独龙族怒族自治县", "兰坪白族普米族自治县"],
            "福贡县": {
                "id": 2432,
                "alias": ["福贡"]
            },
            "贡山独龙族怒族自治县": {
                "id": 2433,
                "alias": ["贡山"]
            },
            "兰坪白族普米族自治县": {
                "id": 2434,
                "alias": ["兰坪"]
            }
        },
        "迪庆藏族自治州": {
            "id": 280,
            "alias": ["迪庆"],
            "香格里拉市": {
                "id": 2435,
                "alias": ["香格里拉"]
            },
            "districts": ["香格里拉市", "德钦县", "维西傈僳族自治县"],
            "德钦县": {
                "id": 2436,
                "alias": ["德钦"]
            },
            "维西傈僳族自治县": {
                "id": 2437,
                "alias": ["维西傈僳族"]
            }
        },
        "普洱市": {
            "id": 346,
            "alias": ["普洱"],
            "墨江哈尼族自治县": {
                "id": 2364,
                "alias": ["墨江"]
            },
            "districts": ["墨江哈尼族自治县", "景东彝族自治县", "景谷傣族彝族自治县", "镇沅彝族哈尼族拉祜族自治县", "江城哈尼族彝族自治县", "孟连傣族拉祜族佤族自治县", "澜沧拉祜族自治县", "西盟佤族自治县", "思茅区", "宁洱哈尼族彝族自治县"],
            "景东彝族自治县": {
                "id": 2365,
                "alias": ["景东"]
            },
            "景谷傣族彝族自治县": {
                "id": 2366,
                "alias": ["景谷"]
            },
            "镇沅彝族哈尼族拉祜族自治县": {
                "id": 2367,
                "alias": ["镇沅"]
            },
            "江城哈尼族彝族自治县": {
                "id": 2368,
                "alias": ["江城"]
            },
            "孟连傣族拉祜族佤族自治县": {
                "id": 2369,
                "alias": ["孟连"]
            },
            "澜沧拉祜族自治县": {
                "id": 2370,
                "alias": ["澜沧"]
            },
            "西盟佤族自治县": {
                "id": 2371,
                "alias": ["西盟"]
            },
            "思茅区": {
                "id": 2871,
                "alias": ["思茅"]
            },
            "宁洱哈尼族彝族自治县": {
                "id": 2872,
                "alias": ["宁洱"]
            }
        }
    },
    "西藏自治区": {
        "alias": ["西藏"],
        "id": 26,
        "cities": ["拉萨市", "昌都市", "山南市", "日喀则市", "那曲地区", "阿里地区", "林芝市"],
        "拉萨市": {
            "id": 281,
            "alias": ["拉萨"],
            "城关区": {
                "id": 2438,
                "alias": ["城关"]
            },
            "districts": ["城关区", "林周县", "当雄县", "尼木县", "曲水县", "堆龙德庆区", "达孜县", "墨竹工卡县", "格尔木藏青工业园区", "拉萨经济技术开发区", "西藏文化旅游创意园区", "达孜工业园区"],
            "林周县": {
                "id": 2439,
                "alias": ["林周"]
            },
            "当雄县": {
                "id": 2440,
                "alias": ["当雄"]
            },
            "尼木县": {
                "id": 2441,
                "alias": ["尼木"]
            },
            "曲水县": {
                "id": 2442,
                "alias": ["曲水"]
            },
            "堆龙德庆区": {
                "id": 2443,
                "alias": ["堆龙德庆"]
            },
            "达孜县": {
                "id": 2444,
                "alias": ["达孜"]
            },
            "墨竹工卡县": {
                "id": 2445,
                "alias": ["墨竹工卡"]
            },
            "格尔木藏青工业园区": {
                "id": 3537,
                "alias": ["格尔木藏青工业园"]
            },
            "拉萨经济技术开发区": {
                "id": 3538,
                "alias": ["拉萨经济技术开发"]
            },
            "西藏文化旅游创意园区": {
                "id": 3539,
                "alias": ["西藏文化旅游创意园"]
            },
            "达孜工业园区": {
                "id": 3540,
                "alias": ["达孜工业园"]
            }
        },
        "昌都市": {
            "id": 282,
            "alias": ["昌都"],
            "江达县": {
                "id": 2447,
                "alias": ["江达"]
            },
            "districts": ["江达县", "贡觉县", "类乌齐县", "丁青县", "察雅县", "八宿县", "左贡县", "芒康县", "洛隆县", "边坝县", "卡若区"],
            "贡觉县": {
                "id": 2448,
                "alias": ["贡觉"]
            },
            "类乌齐县": {
                "id": 2449,
                "alias": ["类乌齐"]
            },
            "丁青县": {
                "id": 2450,
                "alias": ["丁青"]
            },
            "察雅县": {
                "id": 2451,
                "alias": ["察雅"]
            },
            "八宿县": {
                "id": 2452,
                "alias": ["八宿"]
            },
            "左贡县": {
                "id": 2453,
                "alias": ["左贡"]
            },
            "芒康县": {
                "id": 2454,
                "alias": ["芒康"]
            },
            "洛隆县": {
                "id": 2455,
                "alias": ["洛隆"]
            },
            "边坝县": {
                "id": 2456,
                "alias": ["边坝"]
            },
            "卡若区": {
                "id": 3541,
                "alias": ["卡若"]
            }
        },
        "山南市": {
            "id": 283,
            "alias": ["山南"],
            "乃东区": {
                "id": 2457,
                "alias": ["乃东"]
            },
            "districts": ["乃东区", "扎囊县", "贡嘎县", "桑日县", "琼结县", "曲松县", "措美县", "洛扎县", "加查县", "隆子县", "错那县", "浪卡子县"],
            "扎囊县": {
                "id": 2458,
                "alias": ["扎囊"]
            },
            "贡嘎县": {
                "id": 2459,
                "alias": ["贡嘎"]
            },
            "桑日县": {
                "id": 2460,
                "alias": ["桑日"]
            },
            "琼结县": {
                "id": 2461,
                "alias": ["琼结"]
            },
            "曲松县": {
                "id": 2462,
                "alias": ["曲松"]
            },
            "措美县": {
                "id": 2463,
                "alias": ["措美"]
            },
            "洛扎县": {
                "id": 2464,
                "alias": ["洛扎"]
            },
            "加查县": {
                "id": 2465,
                "alias": ["加查"]
            },
            "隆子县": {
                "id": 2466,
                "alias": ["隆子"]
            },
            "错那县": {
                "id": 2467,
                "alias": ["错那"]
            },
            "浪卡子县": {
                "id": 2468,
                "alias": ["浪卡子"]
            }
        },
        "日喀则市": {
            "id": 284,
            "alias": ["日喀则"],
            "南木林县": {
                "id": 2470,
                "alias": ["南木林"]
            },
            "districts": ["南木林县", "江孜县", "定日县", "萨迦县", "拉孜县", "昂仁县", "谢通门县", "白朗县", "仁布县", "康马县", "定结县", "仲巴县", "亚东县", "吉隆县", "聂拉木县", "萨嘎县", "岗巴县", "桑珠孜区"],
            "江孜县": {
                "id": 2471,
                "alias": ["江孜"]
            },
            "定日县": {
                "id": 2472,
                "alias": ["定日"]
            },
            "萨迦县": {
                "id": 2473,
                "alias": ["萨迦"]
            },
            "拉孜县": {
                "id": 2474,
                "alias": ["拉孜"]
            },
            "昂仁县": {
                "id": 2475,
                "alias": ["昂仁"]
            },
            "谢通门县": {
                "id": 2476,
                "alias": ["谢通门"]
            },
            "白朗县": {
                "id": 2477,
                "alias": ["白朗"]
            },
            "仁布县": {
                "id": 2478,
                "alias": ["仁布"]
            },
            "康马县": {
                "id": 2479,
                "alias": ["康马"]
            },
            "定结县": {
                "id": 2480,
                "alias": ["定结"]
            },
            "仲巴县": {
                "id": 2481,
                "alias": ["仲巴"]
            },
            "亚东县": {
                "id": 2482,
                "alias": ["亚东"]
            },
            "吉隆县": {
                "id": 2483,
                "alias": ["吉隆"]
            },
            "聂拉木县": {
                "id": 2484,
                "alias": ["聂拉木"]
            },
            "萨嘎县": {
                "id": 2485,
                "alias": ["萨嘎"]
            },
            "岗巴县": {
                "id": 2486,
                "alias": ["岗巴"]
            },
            "桑珠孜区": {
                "id": 3542,
                "alias": ["桑珠孜"]
            }
        },
        "那曲地区": {
            "id": 285,
            "alias": ["那曲"],
            "那曲县": {
                "id": 2487,
                "alias": ["那曲"]
            },
            "districts": ["那曲县", "嘉黎县", "比如县", "聂荣县", "安多县", "申扎县", "索县", "班戈县", "巴青县", "尼玛县", "双湖县"],
            "嘉黎县": {
                "id": 2488,
                "alias": ["嘉黎"]
            },
            "比如县": {
                "id": 2489,
                "alias": ["比如"]
            },
            "聂荣县": {
                "id": 2490,
                "alias": ["聂荣"]
            },
            "安多县": {
                "id": 2491,
                "alias": ["安多"]
            },
            "申扎县": {
                "id": 2492,
                "alias": ["申扎"]
            },
            "索县": {
                "id": 2493,
                "alias": []
            },
            "班戈县": {
                "id": 2494,
                "alias": ["班戈"]
            },
            "巴青县": {
                "id": 2495,
                "alias": ["巴青"]
            },
            "尼玛县": {
                "id": 2496,
                "alias": ["尼玛"]
            },
            "双湖县": {
                "id": 3543,
                "alias": ["双湖"]
            }
        },
        "阿里地区": {
            "id": 286,
            "alias": ["阿里"],
            "普兰县": {
                "id": 2497,
                "alias": ["普兰"]
            },
            "districts": ["普兰县", "札达县", "噶尔县", "日土县", "革吉县", "改则县", "措勤县"],
            "札达县": {
                "id": 2498,
                "alias": ["札达"]
            },
            "噶尔县": {
                "id": 2499,
                "alias": ["噶尔"]
            },
            "日土县": {
                "id": 2500,
                "alias": ["日土"]
            },
            "革吉县": {
                "id": 2501,
                "alias": ["革吉"]
            },
            "改则县": {
                "id": 2502,
                "alias": ["改则"]
            },
            "措勤县": {
                "id": 2503,
                "alias": ["措勤"]
            }
        },
        "林芝市": {
            "id": 287,
            "alias": ["林芝"],
            "工布江达县": {
                "id": 2505,
                "alias": ["工布江达"]
            },
            "districts": ["工布江达县", "米林县", "墨脱县", "波密县", "察隅县", "朗县", "巴宜区"],
            "米林县": {
                "id": 2506,
                "alias": ["米林"]
            },
            "墨脱县": {
                "id": 2507,
                "alias": ["墨脱"]
            },
            "波密县": {
                "id": 2508,
                "alias": ["波密"]
            },
            "察隅县": {
                "id": 2509,
                "alias": ["察隅"]
            },
            "朗县": {
                "id": 2510,
                "alias": []
            },
            "巴宜区": {
                "id": 3544,
                "alias": ["巴宜"]
            }
        }
    },
    "陕西省": {
        "alias": ["陕西"],
        "id": 27,
        "cities": ["西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市", "榆林市", "安康市", "商洛市"],
        "西安市": {
            "id": 288,
            "alias": ["西安"],
            "新城区": {
                "id": 2511,
                "alias": ["新城"]
            },
            "districts": ["新城区", "碑林区", "莲湖区", "灞桥区", "未央区", "雁塔区", "阎良区", "临潼区", "长安区", "蓝田县", "周至县", "高陵区", "鄠邑区"],
            "碑林区": {
                "id": 2512,
                "alias": ["碑林"]
            },
            "莲湖区": {
                "id": 2513,
                "alias": ["莲湖"]
            },
            "灞桥区": {
                "id": 2514,
                "alias": ["灞桥"]
            },
            "未央区": {
                "id": 2515,
                "alias": ["未央"]
            },
            "雁塔区": {
                "id": 2516,
                "alias": ["雁塔"]
            },
            "阎良区": {
                "id": 2517,
                "alias": ["阎良"]
            },
            "临潼区": {
                "id": 2518,
                "alias": ["临潼"]
            },
            "长安区": {
                "id": 2519,
                "alias": ["长安"]
            },
            "蓝田县": {
                "id": 2520,
                "alias": ["蓝田"]
            },
            "周至县": {
                "id": 2521,
                "alias": ["周至"]
            },
            "高陵区": {
                "id": 2523,
                "alias": ["高陵"]
            },
            "鄠邑区": {
                "id": 3554,
                "alias": ["鄠邑"]
            }
        },
        "铜川市": {
            "id": 289,
            "alias": ["铜川"],
            "王益区": {
                "id": 2524,
                "alias": ["王益"]
            },
            "districts": ["王益区", "印台区", "耀州区", "宜君县"],
            "印台区": {
                "id": 2525,
                "alias": ["印台"]
            },
            "耀州区": {
                "id": 2526,
                "alias": ["耀州"]
            },
            "宜君县": {
                "id": 2527,
                "alias": ["宜君"]
            }
        },
        "宝鸡市": {
            "id": 290,
            "alias": ["宝鸡"],
            "渭滨区": {
                "id": 2528,
                "alias": ["渭滨"]
            },
            "districts": ["渭滨区", "金台区", "陈仓区", "凤翔县", "岐山县", "扶风县", "眉县", "陇县", "千阳县", "麟游县", "凤县", "太白县"],
            "金台区": {
                "id": 2529,
                "alias": ["金台"]
            },
            "陈仓区": {
                "id": 2530,
                "alias": ["陈仓"]
            },
            "凤翔县": {
                "id": 2531,
                "alias": ["凤翔"]
            },
            "岐山县": {
                "id": 2532,
                "alias": ["岐山"]
            },
            "扶风县": {
                "id": 2533,
                "alias": ["扶风"]
            },
            "眉县": {
                "id": 2534,
                "alias": []
            },
            "陇县": {
                "id": 2535,
                "alias": []
            },
            "千阳县": {
                "id": 2536,
                "alias": ["千阳"]
            },
            "麟游县": {
                "id": 2537,
                "alias": ["麟游"]
            },
            "凤县": {
                "id": 2538,
                "alias": []
            },
            "太白县": {
                "id": 2539,
                "alias": ["太白"]
            }
        },
        "咸阳市": {
            "id": 291,
            "alias": ["咸阳"],
            "秦都区": {
                "id": 2540,
                "alias": ["秦都"]
            },
            "districts": ["秦都区", "渭城区", "三原县", "泾阳县", "乾县", "礼泉县", "永寿县", "彬县", "长武县", "旬邑县", "淳化县", "武功县", "兴平市", "杨陵区"],
            "渭城区": {
                "id": 2542,
                "alias": ["渭城"]
            },
            "三原县": {
                "id": 2543,
                "alias": ["三原"]
            },
            "泾阳县": {
                "id": 2544,
                "alias": ["泾阳"]
            },
            "乾县": {
                "id": 2545,
                "alias": []
            },
            "礼泉县": {
                "id": 2546,
                "alias": ["礼泉"]
            },
            "永寿县": {
                "id": 2547,
                "alias": ["永寿"]
            },
            "彬县": {
                "id": 2548,
                "alias": []
            },
            "长武县": {
                "id": 2549,
                "alias": ["长武"]
            },
            "旬邑县": {
                "id": 2550,
                "alias": ["旬邑"]
            },
            "淳化县": {
                "id": 2551,
                "alias": ["淳化"]
            },
            "武功县": {
                "id": 2552,
                "alias": ["武功"]
            },
            "兴平市": {
                "id": 2553,
                "alias": ["兴平"]
            },
            "杨陵区": {
                "id": 3555,
                "alias": ["杨陵"]
            }
        },
        "渭南市": {
            "id": 292,
            "alias": ["渭南"],
            "临渭区": {
                "id": 2554,
                "alias": ["临渭"]
            },
            "districts": ["临渭区", "潼关县", "大荔县", "合阳县", "澄城县", "蒲城县", "白水县", "富平县", "韩城市", "华阴市", "华州区"],
            "潼关县": {
                "id": 2556,
                "alias": ["潼关"]
            },
            "大荔县": {
                "id": 2557,
                "alias": ["大荔"]
            },
            "合阳县": {
                "id": 2558,
                "alias": ["合阳"]
            },
            "澄城县": {
                "id": 2559,
                "alias": ["澄城"]
            },
            "蒲城县": {
                "id": 2560,
                "alias": ["蒲城"]
            },
            "白水县": {
                "id": 2561,
                "alias": ["白水"]
            },
            "富平县": {
                "id": 2562,
                "alias": ["富平"]
            },
            "韩城市": {
                "id": 2563,
                "alias": ["韩城"]
            },
            "华阴市": {
                "id": 2564,
                "alias": ["华阴"]
            },
            "华州区": {
                "id": 3556,
                "alias": ["华州"]
            }
        },
        "延安市": {
            "id": 293,
            "alias": ["延安"],
            "宝塔区": {
                "id": 2565,
                "alias": ["宝塔"]
            },
            "districts": ["宝塔区", "延长县", "延川县", "子长县", "安塞区", "志丹县", "甘泉县", "富县", "洛川县", "宜川县", "黄龙县", "黄陵县", "吴起县"],
            "延长县": {
                "id": 2566,
                "alias": ["延长"]
            },
            "延川县": {
                "id": 2567,
                "alias": ["延川"]
            },
            "子长县": {
                "id": 2568,
                "alias": ["子长"]
            },
            "安塞区": {
                "id": 2569,
                "alias": ["安塞"]
            },
            "志丹县": {
                "id": 2570,
                "alias": ["志丹"]
            },
            "甘泉县": {
                "id": 2572,
                "alias": ["甘泉"]
            },
            "富县": {
                "id": 2573,
                "alias": []
            },
            "洛川县": {
                "id": 2574,
                "alias": ["洛川"]
            },
            "宜川县": {
                "id": 2575,
                "alias": ["宜川"]
            },
            "黄龙县": {
                "id": 2576,
                "alias": ["黄龙"]
            },
            "黄陵县": {
                "id": 2577,
                "alias": ["黄陵"]
            },
            "吴起县": {
                "id": 3557,
                "alias": ["吴起"]
            }
        },
        "汉中市": {
            "id": 294,
            "alias": ["汉中"],
            "汉台区": {
                "id": 2578,
                "alias": ["汉台"]
            },
            "districts": ["汉台区", "南郑区", "城固县", "洋县", "西乡县", "勉县", "宁强县", "略阳县", "镇巴县", "留坝县", "佛坪县"],
            "南郑区": {
                "id": 2579,
                "alias": ["南郑"]
            },
            "城固县": {
                "id": 2580,
                "alias": ["城固"]
            },
            "洋县": {
                "id": 2581,
                "alias": []
            },
            "西乡县": {
                "id": 2582,
                "alias": ["西乡"]
            },
            "勉县": {
                "id": 2583,
                "alias": []
            },
            "宁强县": {
                "id": 2584,
                "alias": ["宁强"]
            },
            "略阳县": {
                "id": 2585,
                "alias": ["略阳"]
            },
            "镇巴县": {
                "id": 2586,
                "alias": ["镇巴"]
            },
            "留坝县": {
                "id": 2587,
                "alias": ["留坝"]
            },
            "佛坪县": {
                "id": 2588,
                "alias": ["佛坪"]
            }
        },
        "榆林市": {
            "id": 295,
            "alias": ["榆林"],
            "榆阳区": {
                "id": 2589,
                "alias": ["榆阳"]
            },
            "districts": ["榆阳区", "神木市", "府谷县", "横山区", "靖边县", "定边县", "绥德县", "米脂县", "佳县", "吴堡县", "清涧县", "子洲县"],
            "神木市": {
                "id": 2590,
                "alias": ["神木"]
            },
            "府谷县": {
                "id": 2591,
                "alias": ["府谷"]
            },
            "横山区": {
                "id": 2592,
                "alias": ["横山"]
            },
            "靖边县": {
                "id": 2593,
                "alias": ["靖边"]
            },
            "定边县": {
                "id": 2594,
                "alias": ["定边"]
            },
            "绥德县": {
                "id": 2595,
                "alias": ["绥德"]
            },
            "米脂县": {
                "id": 2596,
                "alias": ["米脂"]
            },
            "佳县": {
                "id": 2597,
                "alias": []
            },
            "吴堡县": {
                "id": 2598,
                "alias": ["吴堡"]
            },
            "清涧县": {
                "id": 2599,
                "alias": ["清涧"]
            },
            "子洲县": {
                "id": 2600,
                "alias": ["子洲"]
            }
        },
        "安康市": {
            "id": 296,
            "alias": ["安康"],
            "汉滨区": {
                "id": 2601,
                "alias": ["汉滨"]
            },
            "districts": ["汉滨区", "汉阴县", "石泉县", "宁陕县", "紫阳县", "岚皋县", "平利县", "镇坪县", "旬阳县", "白河县"],
            "汉阴县": {
                "id": 2602,
                "alias": ["汉阴"]
            },
            "石泉县": {
                "id": 2603,
                "alias": ["石泉"]
            },
            "宁陕县": {
                "id": 2604,
                "alias": ["宁陕"]
            },
            "紫阳县": {
                "id": 2605,
                "alias": ["紫阳"]
            },
            "岚皋县": {
                "id": 2606,
                "alias": ["岚皋"]
            },
            "平利县": {
                "id": 2607,
                "alias": ["平利"]
            },
            "镇坪县": {
                "id": 2608,
                "alias": ["镇坪"]
            },
            "旬阳县": {
                "id": 2609,
                "alias": ["旬阳"]
            },
            "白河县": {
                "id": 2610,
                "alias": ["白河"]
            }
        },
        "商洛市": {
            "id": 297,
            "alias": ["商洛"],
            "商州区": {
                "id": 2611,
                "alias": ["商州"]
            },
            "districts": ["商州区", "洛南县", "丹凤县", "商南县", "山阳县", "镇安县", "柞水县"],
            "洛南县": {
                "id": 2612,
                "alias": ["洛南"]
            },
            "丹凤县": {
                "id": 2613,
                "alias": ["丹凤"]
            },
            "商南县": {
                "id": 2614,
                "alias": ["商南"]
            },
            "山阳县": {
                "id": 2615,
                "alias": ["山阳"]
            },
            "镇安县": {
                "id": 2616,
                "alias": ["镇安"]
            },
            "柞水县": {
                "id": 2617,
                "alias": ["柞水"]
            }
        }
    },
    "甘肃省": {
        "alias": ["甘肃"],
        "id": 28,
        "cities": ["兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "武威市", "张掖市", "平凉市", "酒泉市", "庆阳市", "定西市", "陇南市", "临夏回族自治州", "甘南藏族自治州"],
        "兰州市": {
            "id": 298,
            "alias": ["兰州"],
            "城关区": {
                "id": 2618,
                "alias": ["城关"]
            },
            "districts": ["城关区", "七里河区", "西固区", "安宁区", "红古区", "永登县", "皋兰县", "榆中县", "兰州新区"],
            "七里河区": {
                "id": 2619,
                "alias": ["七里河"]
            },
            "西固区": {
                "id": 2620,
                "alias": ["西固"]
            },
            "安宁区": {
                "id": 2621,
                "alias": ["安宁"]
            },
            "红古区": {
                "id": 2622,
                "alias": ["红古"]
            },
            "永登县": {
                "id": 2623,
                "alias": ["永登"]
            },
            "皋兰县": {
                "id": 2624,
                "alias": ["皋兰"]
            },
            "榆中县": {
                "id": 2625,
                "alias": ["榆中"]
            },
            "兰州新区": {
                "id": 3532,
                "alias": ["兰州"]
            }
        },
        "嘉峪关市": {
            "id": 299,
            "alias": ["嘉峪关"]
        },
        "金昌市": {
            "id": 300,
            "alias": ["金昌"],
            "金川区": {
                "id": 2626,
                "alias": ["金川"]
            },
            "districts": ["金川区", "永昌县"],
            "永昌县": {
                "id": 2627,
                "alias": ["永昌"]
            }
        },
        "白银市": {
            "id": 301,
            "alias": ["白银"],
            "白银区": {
                "id": 2628,
                "alias": ["白银"]
            },
            "districts": ["白银区", "平川区", "靖远县", "会宁县", "景泰县"],
            "平川区": {
                "id": 2629,
                "alias": ["平川"]
            },
            "靖远县": {
                "id": 2630,
                "alias": ["靖远"]
            },
            "会宁县": {
                "id": 2631,
                "alias": ["会宁"]
            },
            "景泰县": {
                "id": 2632,
                "alias": ["景泰"]
            }
        },
        "天水市": {
            "id": 302,
            "alias": ["天水"],
            "清水县": {
                "id": 2635,
                "alias": ["清水"]
            },
            "districts": ["清水县", "秦安县", "甘谷县", "武山县", "张家川回族自治县", "秦州区", "麦积区"],
            "秦安县": {
                "id": 2636,
                "alias": ["秦安"]
            },
            "甘谷县": {
                "id": 2637,
                "alias": ["甘谷"]
            },
            "武山县": {
                "id": 2638,
                "alias": ["武山"]
            },
            "张家川回族自治县": {
                "id": 2639,
                "alias": ["张家川"]
            },
            "秦州区": {
                "id": 3533,
                "alias": ["秦州"]
            },
            "麦积区": {
                "id": 3534,
                "alias": ["麦积"]
            }
        },
        "武威市": {
            "id": 303,
            "alias": ["武威"],
            "凉州区": {
                "id": 2640,
                "alias": ["凉州"]
            },
            "districts": ["凉州区", "民勤县", "古浪县", "天祝藏族自治县"],
            "民勤县": {
                "id": 2641,
                "alias": ["民勤"]
            },
            "古浪县": {
                "id": 2642,
                "alias": ["古浪"]
            },
            "天祝藏族自治县": {
                "id": 2643,
                "alias": ["天祝"]
            }
        },
        "张掖市": {
            "id": 304,
            "alias": ["张掖"],
            "甘州区": {
                "id": 2644,
                "alias": ["甘州"]
            },
            "districts": ["甘州区", "肃南裕固族自治县", "民乐县", "临泽县", "高台县", "山丹县"],
            "肃南裕固族自治县": {
                "id": 2645,
                "alias": ["肃南"]
            },
            "民乐县": {
                "id": 2646,
                "alias": ["民乐"]
            },
            "临泽县": {
                "id": 2647,
                "alias": ["临泽"]
            },
            "高台县": {
                "id": 2648,
                "alias": ["高台"]
            },
            "山丹县": {
                "id": 2649,
                "alias": ["山丹"]
            }
        },
        "平凉市": {
            "id": 305,
            "alias": ["平凉"],
            "崆峒区": {
                "id": 2650,
                "alias": ["崆峒"]
            },
            "districts": ["崆峒区", "泾川县", "灵台县", "崇信县", "华亭县", "庄浪县", "静宁县", "平凉工业园区"],
            "泾川县": {
                "id": 2651,
                "alias": ["泾川"]
            },
            "灵台县": {
                "id": 2652,
                "alias": ["灵台"]
            },
            "崇信县": {
                "id": 2653,
                "alias": ["崇信"]
            },
            "华亭县": {
                "id": 2654,
                "alias": ["华亭"]
            },
            "庄浪县": {
                "id": 2655,
                "alias": ["庄浪"]
            },
            "静宁县": {
                "id": 2656,
                "alias": ["静宁"]
            },
            "平凉工业园区": {
                "id": 3535,
                "alias": ["平凉工业园"]
            }
        },
        "酒泉市": {
            "id": 306,
            "alias": ["酒泉"],
            "肃州区": {
                "id": 2657,
                "alias": ["肃州"]
            },
            "districts": ["肃州区", "金塔县", "肃北蒙古族自治县", "阿克塞哈萨克族自治县", "玉门市", "敦煌市", "瓜州县"],
            "金塔县": {
                "id": 2658,
                "alias": ["金塔"]
            },
            "肃北蒙古族自治县": {
                "id": 2660,
                "alias": ["肃北"]
            },
            "阿克塞哈萨克族自治县": {
                "id": 2661,
                "alias": ["阿克塞"]
            },
            "玉门市": {
                "id": 2662,
                "alias": ["玉门"]
            },
            "敦煌市": {
                "id": 2663,
                "alias": ["敦煌"]
            },
            "瓜州县": {
                "id": 3536,
                "alias": ["瓜州"]
            }
        },
        "庆阳市": {
            "id": 307,
            "alias": ["庆阳"],
            "西峰区": {
                "id": 2664,
                "alias": ["西峰"]
            },
            "districts": ["西峰区", "庆城县", "环县", "华池县", "合水县", "正宁县", "宁县", "镇原县"],
            "庆城县": {
                "id": 2665,
                "alias": ["庆城"]
            },
            "环县": {
                "id": 2666,
                "alias": []
            },
            "华池县": {
                "id": 2667,
                "alias": ["华池"]
            },
            "合水县": {
                "id": 2668,
                "alias": ["合水"]
            },
            "正宁县": {
                "id": 2669,
                "alias": ["正宁"]
            },
            "宁县": {
                "id": 2670,
                "alias": []
            },
            "镇原县": {
                "id": 2671,
                "alias": ["镇原"]
            }
        },
        "定西市": {
            "id": 308,
            "alias": ["定西"],
            "安定区": {
                "id": 2672,
                "alias": ["安定"]
            },
            "districts": ["安定区", "通渭县", "陇西县", "渭源县", "临洮县", "漳县", "岷县"],
            "通渭县": {
                "id": 2673,
                "alias": ["通渭"]
            },
            "陇西县": {
                "id": 2674,
                "alias": ["陇西"]
            },
            "渭源县": {
                "id": 2675,
                "alias": ["渭源"]
            },
            "临洮县": {
                "id": 2676,
                "alias": ["临洮"]
            },
            "漳县": {
                "id": 2677,
                "alias": []
            },
            "岷县": {
                "id": 2678,
                "alias": []
            }
        },
        "陇南市": {
            "id": 309,
            "alias": ["陇南"],
            "武都区": {
                "id": 2679,
                "alias": ["武都"]
            },
            "districts": ["武都区", "成县", "文县", "宕昌县", "康县", "西和县", "礼县", "徽县", "两当县"],
            "成县": {
                "id": 2680,
                "alias": []
            },
            "文县": {
                "id": 2681,
                "alias": []
            },
            "宕昌县": {
                "id": 2682,
                "alias": ["宕昌"]
            },
            "康县": {
                "id": 2683,
                "alias": []
            },
            "西和县": {
                "id": 2684,
                "alias": ["西和"]
            },
            "礼县": {
                "id": 2685,
                "alias": []
            },
            "徽县": {
                "id": 2686,
                "alias": []
            },
            "两当县": {
                "id": 2687,
                "alias": ["两当"]
            }
        },
        "临夏回族自治州": {
            "id": 310,
            "alias": ["临夏"],
            "临夏市": {
                "id": 2688,
                "alias": ["临夏"]
            },
            "districts": ["临夏市", "临夏县", "康乐县", "永靖县", "广河县", "和政县", "东乡族自治县", "积石山保安族东乡族撒拉族自治县"],
            "临夏县": {
                "id": 2689,
                "alias": ["临夏"]
            },
            "康乐县": {
                "id": 2690,
                "alias": ["康乐"]
            },
            "永靖县": {
                "id": 2691,
                "alias": ["永靖"]
            },
            "广河县": {
                "id": 2692,
                "alias": ["广河"]
            },
            "和政县": {
                "id": 2693,
                "alias": ["和政"]
            },
            "东乡族自治县": {
                "id": 2694,
                "alias": ["东乡族自治"]
            },
            "积石山保安族东乡族撒拉族自治县": {
                "id": 2695,
                "alias": ["积石山"]
            }
        },
        "甘南藏族自治州": {
            "id": 311,
            "alias": ["甘南"],
            "合作市": {
                "id": 2696,
                "alias": ["合作"]
            },
            "districts": ["合作市", "临潭县", "卓尼县", "舟曲县", "迭部县", "玛曲县", "碌曲县", "夏河县"],
            "临潭县": {
                "id": 2697,
                "alias": ["临潭"]
            },
            "卓尼县": {
                "id": 2698,
                "alias": ["卓尼"]
            },
            "舟曲县": {
                "id": 2699,
                "alias": ["舟曲"]
            },
            "迭部县": {
                "id": 2700,
                "alias": ["迭部"]
            },
            "玛曲县": {
                "id": 2701,
                "alias": ["玛曲"]
            },
            "碌曲县": {
                "id": 2702,
                "alias": ["碌曲"]
            },
            "夏河县": {
                "id": 2703,
                "alias": ["夏河"]
            }
        }
    },
    "青海省": {
        "alias": ["青海"],
        "id": 29,
        "cities": ["西宁市", "海东市", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州"],
        "西宁市": {
            "id": 312,
            "alias": ["西宁"],
            "城东区": {
                "id": 2704,
                "alias": ["城东"]
            },
            "districts": ["城东区", "城中区", "城西区", "城北区", "大通回族土族自治县", "湟中县", "湟源县"],
            "城中区": {
                "id": 2705,
                "alias": ["城中"]
            },
            "城西区": {
                "id": 2706,
                "alias": ["城西"]
            },
            "城北区": {
                "id": 2707,
                "alias": ["城北"]
            },
            "大通回族土族自治县": {
                "id": 2708,
                "alias": ["大通"]
            },
            "湟中县": {
                "id": 2709,
                "alias": ["湟中"]
            },
            "湟源县": {
                "id": 2710,
                "alias": ["湟源"]
            }
        },
        "海东市": {
            "id": 313,
            "alias": ["海东"],
            "平安区": {
                "id": 2711,
                "alias": ["平安"]
            },
            "districts": ["平安区", "民和回族土族自治县", "乐都区", "互助土族自治县", "化隆回族自治县", "循化撒拉族自治县"],
            "民和回族土族自治县": {
                "id": 2712,
                "alias": ["民和"]
            },
            "乐都区": {
                "id": 2713,
                "alias": ["乐都"]
            },
            "互助土族自治县": {
                "id": 2714,
                "alias": ["互助"]
            },
            "化隆回族自治县": {
                "id": 2715,
                "alias": ["化隆"]
            },
            "循化撒拉族自治县": {
                "id": 2716,
                "alias": ["循化"]
            }
        },
        "海北藏族自治州": {
            "id": 314,
            "alias": ["海北"],
            "门源回族自治县": {
                "id": 2717,
                "alias": ["门源"]
            },
            "districts": ["门源回族自治县", "祁连县", "海晏县", "刚察县"],
            "祁连县": {
                "id": 2718,
                "alias": ["祁连"]
            },
            "海晏县": {
                "id": 2719,
                "alias": ["海晏"]
            },
            "刚察县": {
                "id": 2720,
                "alias": ["刚察"]
            }
        },
        "黄南藏族自治州": {
            "id": 315,
            "alias": ["黄南"],
            "同仁县": {
                "id": 2721,
                "alias": ["同仁"]
            },
            "districts": ["同仁县", "尖扎县", "泽库县", "河南蒙古族自治县"],
            "尖扎县": {
                "id": 2722,
                "alias": ["尖扎"]
            },
            "泽库县": {
                "id": 2723,
                "alias": ["泽库"]
            },
            "河南蒙古族自治县": {
                "id": 2724,
                "alias": ["河南"]
            }
        },
        "海南藏族自治州": {
            "id": 316,
            "alias": ["海南"],
            "共和县": {
                "id": 2725,
                "alias": ["共和"]
            },
            "districts": ["共和县", "同德县", "贵德县", "兴海县", "贵南县"],
            "同德县": {
                "id": 2726,
                "alias": ["同德"]
            },
            "贵德县": {
                "id": 2727,
                "alias": ["贵德"]
            },
            "兴海县": {
                "id": 2728,
                "alias": ["兴海"]
            },
            "贵南县": {
                "id": 2729,
                "alias": ["贵南"]
            }
        },
        "果洛藏族自治州": {
            "id": 317,
            "alias": ["果洛"],
            "玛沁县": {
                "id": 2730,
                "alias": ["玛沁"]
            },
            "districts": ["玛沁县", "班玛县", "甘德县", "达日县", "久治县", "玛多县"],
            "班玛县": {
                "id": 2731,
                "alias": ["班玛"]
            },
            "甘德县": {
                "id": 2732,
                "alias": ["甘德"]
            },
            "达日县": {
                "id": 2733,
                "alias": ["达日"]
            },
            "久治县": {
                "id": 2734,
                "alias": ["久治"]
            },
            "玛多县": {
                "id": 2735,
                "alias": ["玛多"]
            }
        },
        "玉树藏族自治州": {
            "id": 318,
            "alias": ["玉树"],
            "玉树市": {
                "id": 2736,
                "alias": ["玉树"]
            },
            "districts": ["玉树市", "杂多县", "称多县", "治多县", "囊谦县", "曲麻莱县"],
            "杂多县": {
                "id": 2737,
                "alias": ["杂多"]
            },
            "称多县": {
                "id": 2738,
                "alias": ["称多"]
            },
            "治多县": {
                "id": 2739,
                "alias": ["治多"]
            },
            "囊谦县": {
                "id": 2740,
                "alias": ["囊谦"]
            },
            "曲麻莱县": {
                "id": 2741,
                "alias": ["曲麻莱"]
            }
        },
        "海西蒙古族藏族自治州": {
            "id": 319,
            "alias": ["海西"],
            "格尔木市": {
                "id": 2742,
                "alias": ["格尔木"]
            },
            "districts": ["格尔木市", "德令哈市", "乌兰县", "都兰县", "天峻县", "大柴旦行政委员会", "冷湖行政委员会", "茫崖行政委员会"],
            "德令哈市": {
                "id": 2743,
                "alias": ["德令哈"]
            },
            "乌兰县": {
                "id": 2744,
                "alias": ["乌兰"]
            },
            "都兰县": {
                "id": 2745,
                "alias": ["都兰"]
            },
            "天峻县": {
                "id": 2746,
                "alias": ["天峻"]
            },
            "大柴旦行政委员会": {
                "id": 3558,
                "alias": []
            },
            "冷湖行政委员会": {
                "id": 3559,
                "alias": []
            },
            "茫崖行政委员会": {
                "id": 3560,
                "alias": []
            }
        }
    },
    "宁夏回族自治区": {
        "alias": ["宁夏"],
        "id": 30,
        "cities": ["银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"],
        "银川市": {
            "id": 320,
            "alias": ["银川"],
            "兴庆区": {
                "id": 2747,
                "alias": ["兴庆"]
            },
            "districts": ["兴庆区", "西夏区", "金凤区", "永宁县", "贺兰县", "灵武市"],
            "西夏区": {
                "id": 2748,
                "alias": ["西夏"]
            },
            "金凤区": {
                "id": 2749,
                "alias": ["金凤"]
            },
            "永宁县": {
                "id": 2750,
                "alias": ["永宁"]
            },
            "贺兰县": {
                "id": 2751,
                "alias": ["贺兰"]
            },
            "灵武市": {
                "id": 2752,
                "alias": ["灵武"]
            }
        },
        "石嘴山市": {
            "id": 321,
            "alias": ["石嘴山"],
            "大武口区": {
                "id": 2753,
                "alias": ["大武口"]
            },
            "districts": ["大武口区", "惠农区", "平罗县"],
            "惠农区": {
                "id": 2754,
                "alias": ["惠农"]
            },
            "平罗县": {
                "id": 2755,
                "alias": ["平罗"]
            }
        },
        "吴忠市": {
            "id": 322,
            "alias": ["吴忠"],
            "利通区": {
                "id": 2756,
                "alias": ["利通"]
            },
            "districts": ["利通区", "盐池县", "同心县", "青铜峡市", "红寺堡区"],
            "盐池县": {
                "id": 2757,
                "alias": ["盐池"]
            },
            "同心县": {
                "id": 2758,
                "alias": ["同心"]
            },
            "青铜峡市": {
                "id": 2759,
                "alias": ["青铜峡"]
            },
            "红寺堡区": {
                "id": 3274,
                "alias": ["红寺堡"]
            }
        },
        "固原市": {
            "id": 323,
            "alias": ["固原"],
            "原州区": {
                "id": 2760,
                "alias": ["原州"]
            },
            "districts": ["原州区", "西吉县", "隆德县", "泾源县", "彭阳县"],
            "西吉县": {
                "id": 2761,
                "alias": ["西吉"]
            },
            "隆德县": {
                "id": 2762,
                "alias": ["隆德"]
            },
            "泾源县": {
                "id": 2763,
                "alias": ["泾源"]
            },
            "彭阳县": {
                "id": 2764,
                "alias": ["彭阳"]
            }
        },
        "中卫市": {
            "id": 324,
            "alias": ["中卫"],
            "沙坡头区": {
                "id": 2765,
                "alias": ["沙坡头"]
            },
            "districts": ["沙坡头区", "中宁县", "海原县"],
            "中宁县": {
                "id": 2766,
                "alias": ["中宁"]
            },
            "海原县": {
                "id": 2767,
                "alias": ["海原"]
            }
        }
    },
    "新疆维吾尔自治区": {
        "alias": ["新疆"],
        "id": 31,
        "cities": ["乌鲁木齐市", "克拉玛依市", "吐鲁番市", "哈密市", "昌吉回族自治州", "博尔塔拉蒙古自治州", "巴音郭楞蒙古自治州", "阿克苏地区", "克孜勒苏柯尔克孜自治州", "喀什地区", "和田地区", "伊犁哈萨克自治州", "塔城地区", "阿勒泰地区", "石河子市", "阿拉尔市", "图木舒克市", "五家渠市"],
        "乌鲁木齐市": {
            "id": 325,
            "alias": ["乌鲁木齐"],
            "天山区": {
                "id": 2768,
                "alias": ["天山"]
            },
            "districts": ["天山区", "沙依巴克区", "新市区", "水磨沟区", "头屯河区", "达坂城区", "米东区", "乌鲁木齐县", "乌鲁木齐经济技术开发区", "乌鲁木齐高新技术产业开发区"],
            "沙依巴克区": {
                "id": 2769,
                "alias": ["沙依巴克"]
            },
            "新市区": {
                "id": 2770,
                "alias": ["新市"]
            },
            "水磨沟区": {
                "id": 2771,
                "alias": ["水磨沟"]
            },
            "头屯河区": {
                "id": 2772,
                "alias": ["头屯河"]
            },
            "达坂城区": {
                "id": 2773,
                "alias": ["达坂城"]
            },
            "米东区": {
                "id": 2774,
                "alias": ["米东"]
            },
            "乌鲁木齐县": {
                "id": 2775,
                "alias": ["乌鲁木齐"]
            },
            "乌鲁木齐经济技术开发区": {
                "id": 3395,
                "alias": ["乌鲁木齐经济技术开发"]
            },
            "乌鲁木齐高新技术产业开发区": {
                "id": 3396,
                "alias": ["乌鲁木齐高新技术产业开发"]
            }
        },
        "克拉玛依市": {
            "id": 326,
            "alias": ["克拉玛依"],
            "独山子区": {
                "id": 2776,
                "alias": ["独山子"]
            },
            "districts": ["独山子区", "克拉玛依区", "白碱滩区", "乌尔禾区"],
            "克拉玛依区": {
                "id": 2777,
                "alias": ["克拉玛依"]
            },
            "白碱滩区": {
                "id": 2778,
                "alias": ["白碱滩"]
            },
            "乌尔禾区": {
                "id": 2779,
                "alias": ["乌尔禾"]
            }
        },
        "吐鲁番市": {
            "id": 327,
            "alias": ["吐鲁番"],
            "鄯善县": {
                "id": 2781,
                "alias": ["鄯善"]
            },
            "districts": ["鄯善县", "托克逊县", "高昌区"],
            "托克逊县": {
                "id": 2782,
                "alias": ["托克逊"]
            },
            "高昌区": {
                "id": 3397,
                "alias": ["高昌"]
            }
        },
        "哈密市": {
            "id": 328,
            "alias": ["哈密"],
            "巴里坤哈萨克自治县": {
                "id": 2784,
                "alias": ["巴里坤哈萨克"]
            },
            "districts": ["巴里坤哈萨克自治县", "伊吾县", "伊州区"],
            "伊吾县": {
                "id": 2785,
                "alias": ["伊吾"]
            },
            "伊州区": {
                "id": 3398,
                "alias": ["伊州"]
            }
        },
        "昌吉回族自治州": {
            "id": 329,
            "alias": ["昌吉"],
            "昌吉市": {
                "id": 2786,
                "alias": ["昌吉"]
            },
            "districts": ["昌吉市", "阜康市", "呼图壁县", "玛纳斯县", "奇台县", "吉木萨尔县", "木垒哈萨克自治县"],
            "阜康市": {
                "id": 2787,
                "alias": ["阜康"]
            },
            "呼图壁县": {
                "id": 2789,
                "alias": ["呼图壁"]
            },
            "玛纳斯县": {
                "id": 2790,
                "alias": ["玛纳斯"]
            },
            "奇台县": {
                "id": 2791,
                "alias": ["奇台"]
            },
            "吉木萨尔县": {
                "id": 2792,
                "alias": ["吉木萨尔"]
            },
            "木垒哈萨克自治县": {
                "id": 2793,
                "alias": ["木垒哈萨克"]
            }
        },
        "博尔塔拉蒙古自治州": {
            "id": 330,
            "alias": ["博尔塔拉蒙古"],
            "博乐市": {
                "id": 2794,
                "alias": ["博乐"]
            },
            "districts": ["博乐市", "精河县", "温泉县", "阿拉山口市"],
            "精河县": {
                "id": 2795,
                "alias": ["精河"]
            },
            "温泉县": {
                "id": 2796,
                "alias": ["温泉"]
            },
            "阿拉山口市": {
                "id": 3399,
                "alias": ["阿拉山口"]
            }
        },
        "巴音郭楞蒙古自治州": {
            "id": 331,
            "alias": ["巴音郭楞蒙古"],
            "库尔勒市": {
                "id": 2797,
                "alias": ["库尔勒"]
            },
            "districts": ["库尔勒市", "轮台县", "尉犁县", "若羌县", "且末县", "焉耆回族自治县", "和静县", "和硕县", "博湖县", "库尔勒经济技术开发区"],
            "轮台县": {
                "id": 2798,
                "alias": ["轮台"]
            },
            "尉犁县": {
                "id": 2799,
                "alias": ["尉犁"]
            },
            "若羌县": {
                "id": 2800,
                "alias": ["若羌"]
            },
            "且末县": {
                "id": 2801,
                "alias": ["且末"]
            },
            "焉耆回族自治县": {
                "id": 2802,
                "alias": ["焉耆"]
            },
            "和静县": {
                "id": 2803,
                "alias": ["和静"]
            },
            "和硕县": {
                "id": 2804,
                "alias": ["和硕"]
            },
            "博湖县": {
                "id": 2805,
                "alias": ["博湖"]
            },
            "库尔勒经济技术开发区": {
                "id": 3400,
                "alias": ["库尔勒经济技术开发"]
            }
        },
        "阿克苏地区": {
            "id": 332,
            "alias": ["阿克苏"],
            "阿克苏市": {
                "id": 2806,
                "alias": ["阿克苏"]
            },
            "districts": ["阿克苏市", "温宿县", "库车县", "沙雅县", "新和县", "拜城县", "乌什县", "阿瓦提县", "柯坪县"],
            "温宿县": {
                "id": 2807,
                "alias": ["温宿"]
            },
            "库车县": {
                "id": 2808,
                "alias": ["库车"]
            },
            "沙雅县": {
                "id": 2809,
                "alias": ["沙雅"]
            },
            "新和县": {
                "id": 2810,
                "alias": ["新和"]
            },
            "拜城县": {
                "id": 2811,
                "alias": ["拜城"]
            },
            "乌什县": {
                "id": 2812,
                "alias": ["乌什"]
            },
            "阿瓦提县": {
                "id": 2813,
                "alias": ["阿瓦提"]
            },
            "柯坪县": {
                "id": 2814,
                "alias": ["柯坪"]
            }
        },
        "克孜勒苏柯尔克孜自治州": {
            "id": 333,
            "alias": ["克孜勒苏柯尔克孜"],
            "阿图什市": {
                "id": 2815,
                "alias": ["阿图什"]
            },
            "districts": ["阿图什市", "阿克陶县", "阿合奇县", "乌恰县"],
            "阿克陶县": {
                "id": 2816,
                "alias": ["阿克陶"]
            },
            "阿合奇县": {
                "id": 2817,
                "alias": ["阿合奇"]
            },
            "乌恰县": {
                "id": 2818,
                "alias": ["乌恰"]
            }
        },
        "喀什地区": {
            "id": 334,
            "alias": ["喀什"],
            "喀什市": {
                "id": 2819,
                "alias": ["喀什"]
            },
            "districts": ["喀什市", "疏附县", "疏勒县", "英吉沙县", "泽普县", "莎车县", "叶城县", "麦盖提县", "岳普湖县", "伽师县", "巴楚县", "塔什库尔干塔吉克自治县"],
            "疏附县": {
                "id": 2820,
                "alias": ["疏附"]
            },
            "疏勒县": {
                "id": 2821,
                "alias": ["疏勒"]
            },
            "英吉沙县": {
                "id": 2822,
                "alias": ["英吉沙"]
            },
            "泽普县": {
                "id": 2823,
                "alias": ["泽普"]
            },
            "莎车县": {
                "id": 2824,
                "alias": ["莎车"]
            },
            "叶城县": {
                "id": 2825,
                "alias": ["叶城"]
            },
            "麦盖提县": {
                "id": 2826,
                "alias": ["麦盖提"]
            },
            "岳普湖县": {
                "id": 2827,
                "alias": ["岳普湖"]
            },
            "伽师县": {
                "id": 2828,
                "alias": ["伽师"]
            },
            "巴楚县": {
                "id": 2829,
                "alias": ["巴楚"]
            },
            "塔什库尔干塔吉克自治县": {
                "id": 2830,
                "alias": ["塔什库尔干塔吉克"]
            }
        },
        "和田地区": {
            "id": 335,
            "alias": ["和田"],
            "和田市": {
                "id": 2831,
                "alias": ["和田"]
            },
            "districts": ["和田市", "和田县", "墨玉县", "皮山县", "洛浦县", "策勒县", "于田县", "民丰县"],
            "和田县": {
                "id": 2832,
                "alias": ["和田"]
            },
            "墨玉县": {
                "id": 2833,
                "alias": ["墨玉"]
            },
            "皮山县": {
                "id": 2834,
                "alias": ["皮山"]
            },
            "洛浦县": {
                "id": 2835,
                "alias": ["洛浦"]
            },
            "策勒县": {
                "id": 2836,
                "alias": ["策勒"]
            },
            "于田县": {
                "id": 2837,
                "alias": ["于田"]
            },
            "民丰县": {
                "id": 2838,
                "alias": ["民丰"]
            }
        },
        "伊犁哈萨克自治州": {
            "id": 336,
            "alias": ["伊犁哈萨克"],
            "伊宁市": {
                "id": 2839,
                "alias": ["伊宁"]
            },
            "districts": ["伊宁市", "奎屯市", "伊宁县", "察布查尔锡伯自治县", "霍城县", "巩留县", "新源县", "昭苏县", "特克斯县", "尼勒克县", "霍尔果斯市"],
            "奎屯市": {
                "id": 2840,
                "alias": ["奎屯"]
            },
            "伊宁县": {
                "id": 2841,
                "alias": ["伊宁"]
            },
            "察布查尔锡伯自治县": {
                "id": 2842,
                "alias": ["察布查尔锡伯"]
            },
            "霍城县": {
                "id": 2843,
                "alias": ["霍城"]
            },
            "巩留县": {
                "id": 2844,
                "alias": ["巩留"]
            },
            "新源县": {
                "id": 2845,
                "alias": ["新源"]
            },
            "昭苏县": {
                "id": 2846,
                "alias": ["昭苏"]
            },
            "特克斯县": {
                "id": 2847,
                "alias": ["特克斯"]
            },
            "尼勒克县": {
                "id": 2848,
                "alias": ["尼勒克"]
            },
            "霍尔果斯市": {
                "id": 3401,
                "alias": ["霍尔果斯"]
            }
        },
        "塔城地区": {
            "id": 337,
            "alias": ["塔城"],
            "塔城市": {
                "id": 2849,
                "alias": ["塔城"]
            },
            "districts": ["塔城市", "乌苏市", "额敏县", "沙湾县", "托里县", "裕民县", "和布克赛尔蒙古自治县"],
            "乌苏市": {
                "id": 2850,
                "alias": ["乌苏"]
            },
            "额敏县": {
                "id": 2851,
                "alias": ["额敏"]
            },
            "沙湾县": {
                "id": 2852,
                "alias": ["沙湾"]
            },
            "托里县": {
                "id": 2853,
                "alias": ["托里"]
            },
            "裕民县": {
                "id": 2854,
                "alias": ["裕民"]
            },
            "和布克赛尔蒙古自治县": {
                "id": 2855,
                "alias": ["和布克赛尔"]
            }
        },
        "阿勒泰地区": {
            "id": 338,
            "alias": ["阿勒泰"],
            "阿勒泰市": {
                "id": 2856,
                "alias": ["阿勒泰"]
            },
            "districts": ["阿勒泰市", "布尔津县", "富蕴县", "福海县", "哈巴河县", "青河县", "吉木乃县"],
            "布尔津县": {
                "id": 2857,
                "alias": ["布尔津"]
            },
            "富蕴县": {
                "id": 2858,
                "alias": ["富蕴"]
            },
            "福海县": {
                "id": 2859,
                "alias": ["福海"]
            },
            "哈巴河县": {
                "id": 2860,
                "alias": ["哈巴河"]
            },
            "青河县": {
                "id": 2861,
                "alias": ["青河"]
            },
            "吉木乃县": {
                "id": 2862,
                "alias": ["吉木乃"]
            }
        },
        "石河子市": {
            "id": 339,
            "alias": ["石河子"]
        },
        "阿拉尔市": {
            "id": 340,
            "alias": ["阿拉尔"]
        },
        "图木舒克市": {
            "id": 341,
            "alias": ["图木舒克"]
        },
        "五家渠市": {
            "id": 342,
            "alias": ["五家渠"]
        }
    },
    "香港特别行政区": {
        "alias": ["香港"],
        "id": 32,
        "cities": ["香港岛", "九龙", "新界"],
        "香港岛": {
            "id": 343,
            "alias": [],
            "中西区": {
                "id": 3561,
                "alias": ["中西"]
            },
            "districts": ["中西区", "湾仔区", "东区", "南区"],
            "湾仔区": {
                "id": 3562,
                "alias": ["湾仔"]
            },
            "东区": {
                "id": 3563,
                "alias": []
            },
            "南区": {
                "id": 3564,
                "alias": []
            }
        },
        "九龙": {
            "id": 374,
            "alias": [],
            "油尖旺区": {
                "id": 3565,
                "alias": ["油尖旺"]
            },
            "districts": ["油尖旺区", "深水埗区", "九龙城区", "黄大仙区", "观塘区"],
            "深水埗区": {
                "id": 3566,
                "alias": ["深水埗"]
            },
            "九龙城区": {
                "id": 3567,
                "alias": ["九龙城"]
            },
            "黄大仙区": {
                "id": 3568,
                "alias": ["黄大仙"]
            },
            "观塘区": {
                "id": 3569,
                "alias": ["观塘"]
            }
        },
        "新界": {
            "id": 375,
            "alias": [],
            "荃湾区": {
                "id": 3570,
                "alias": ["荃湾"]
            },
            "districts": ["荃湾区", "屯门区", "元朗区", "北区", "大埔区", "西贡区", "沙田区", "葵青区", "离岛区"],
            "屯门区": {
                "id": 3571,
                "alias": ["屯门"]
            },
            "元朗区": {
                "id": 3572,
                "alias": ["元朗"]
            },
            "北区": {
                "id": 3573,
                "alias": []
            },
            "大埔区": {
                "id": 3574,
                "alias": ["大埔"]
            },
            "西贡区": {
                "id": 3575,
                "alias": ["西贡"]
            },
            "沙田区": {
                "id": 3576,
                "alias": ["沙田"]
            },
            "葵青区": {
                "id": 3577,
                "alias": ["葵青"]
            },
            "离岛区": {
                "id": 3578,
                "alias": ["离岛"]
            }
        }
    },
    "澳门特别行政区": {
        "alias": ["澳门"],
        "id": 33,
        "cities": ["澳门半岛", "氹仔岛", "路环岛"],
        "澳门半岛": {
            "id": 344,
            "alias": [],
            "花地玛堂区": {
                "id": 3525,
                "alias": ["花地玛堂"]
            },
            "districts": ["花地玛堂区", "圣安多尼堂区", "大堂区", "望德堂区", "风顺堂区"],
            "圣安多尼堂区": {
                "id": 3526,
                "alias": ["圣安多尼堂"]
            },
            "大堂区": {
                "id": 3527,
                "alias": ["大堂"]
            },
            "望德堂区": {
                "id": 3528,
                "alias": ["望德堂"]
            },
            "风顺堂区": {
                "id": 3529,
                "alias": ["风顺堂"]
            }
        },
        "氹仔岛": {
            "id": 372,
            "alias": [],
            "嘉模堂区": {
                "id": 3530,
                "alias": ["嘉模堂"]
            },
            "districts": ["嘉模堂区"]
        },
        "路环岛": {
            "id": 373,
            "alias": [],
            "圣方济各堂区": {
                "id": 3531,
                "alias": ["圣方济各堂"]
            },
            "districts": ["圣方济各堂区"]
        }
    },
    "台湾": {
        "alias": [],
        "id": 34,
        "cities": ["台湾省", "彰化县", "嘉义市", "嘉义县", "新竹市", "新竹县", "花莲县", "高雄市", "基隆市", "金门县", "连江县", "苗栗县", "南海岛", "南投县", "新北市", "澎湖县", "屏东县", "台中市", "台南市", "台北市", "台东县", "桃园市", "宜兰县", "云林县"],
        "台湾省": {
            "id": 345,
            "alias": []
        },
        "彰化县": {
            "id": 347,
            "alias": [],
            "芳苑乡": {
                "id": 2881,
                "alias": []
            },
            "districts": ["芳苑乡", "芬园乡", "福兴乡", "和美镇", "花坛乡", "鹿港镇", "埤头乡", "埔心乡", "埔盐乡", "伸港乡", "社头乡", "田尾乡", "田中镇", "线西乡", "溪湖镇", "秀水乡", "溪州乡", "永靖乡", "员林市", "竹塘乡", "北斗镇", "彰化市", "大城乡", "大村乡", "二林镇", "二水乡"],
            "芬园乡": {
                "id": 2882,
                "alias": []
            },
            "福兴乡": {
                "id": 2883,
                "alias": []
            },
            "和美镇": {
                "id": 2884,
                "alias": []
            },
            "花坛乡": {
                "id": 2885,
                "alias": []
            },
            "鹿港镇": {
                "id": 2886,
                "alias": []
            },
            "埤头乡": {
                "id": 2887,
                "alias": []
            },
            "埔心乡": {
                "id": 2888,
                "alias": []
            },
            "埔盐乡": {
                "id": 2889,
                "alias": []
            },
            "伸港乡": {
                "id": 2890,
                "alias": []
            },
            "社头乡": {
                "id": 2891,
                "alias": []
            },
            "田尾乡": {
                "id": 2892,
                "alias": []
            },
            "田中镇": {
                "id": 2893,
                "alias": []
            },
            "线西乡": {
                "id": 2894,
                "alias": []
            },
            "溪湖镇": {
                "id": 2895,
                "alias": []
            },
            "秀水乡": {
                "id": 2896,
                "alias": []
            },
            "溪州乡": {
                "id": 2897,
                "alias": []
            },
            "永靖乡": {
                "id": 2898,
                "alias": []
            },
            "员林市": {
                "id": 2899,
                "alias": ["员林"]
            },
            "竹塘乡": {
                "id": 2900,
                "alias": []
            },
            "北斗镇": {
                "id": 2901,
                "alias": []
            },
            "彰化市": {
                "id": 2902,
                "alias": ["彰化"]
            },
            "大城乡": {
                "id": 2903,
                "alias": []
            },
            "大村乡": {
                "id": 2904,
                "alias": []
            },
            "二林镇": {
                "id": 2905,
                "alias": []
            },
            "二水乡": {
                "id": 2906,
                "alias": []
            }
        },
        "嘉义市": {
            "id": 348,
            "alias": ["嘉义"],
            "东区": {
                "id": 2907,
                "alias": []
            },
            "districts": ["东区", "西区"],
            "西区": {
                "id": 2908,
                "alias": []
            }
        },
        "嘉义县": {
            "id": 349,
            "alias": [],
            "阿里山乡": {
                "id": 2909,
                "alias": []
            },
            "districts": ["阿里山乡", "布袋镇", "大林镇", "大埔乡", "东石乡", "番路乡", "六脚乡", "鹿草乡", "梅山乡", "民雄乡", "朴子市", "水上乡", "太保市", "溪口乡", "新港乡", "义竹乡", "中埔乡", "竹崎乡"],
            "布袋镇": {
                "id": 2910,
                "alias": []
            },
            "大林镇": {
                "id": 2911,
                "alias": []
            },
            "大埔乡": {
                "id": 2912,
                "alias": []
            },
            "东石乡": {
                "id": 2913,
                "alias": []
            },
            "番路乡": {
                "id": 2914,
                "alias": []
            },
            "六脚乡": {
                "id": 2915,
                "alias": []
            },
            "鹿草乡": {
                "id": 2916,
                "alias": []
            },
            "梅山乡": {
                "id": 2917,
                "alias": []
            },
            "民雄乡": {
                "id": 2918,
                "alias": []
            },
            "朴子市": {
                "id": 2919,
                "alias": ["朴子"]
            },
            "水上乡": {
                "id": 2920,
                "alias": []
            },
            "太保市": {
                "id": 2921,
                "alias": ["太保"]
            },
            "溪口乡": {
                "id": 2922,
                "alias": []
            },
            "新港乡": {
                "id": 2923,
                "alias": []
            },
            "义竹乡": {
                "id": 2924,
                "alias": []
            },
            "中埔乡": {
                "id": 2925,
                "alias": []
            },
            "竹崎乡": {
                "id": 2926,
                "alias": []
            }
        },
        "新竹市": {
            "id": 350,
            "alias": ["新竹"],
            "东区": {
                "id": 2927,
                "alias": []
            },
            "districts": ["东区", "北区"],
            "北区": {
                "id": 2928,
                "alias": []
            }
        },
        "新竹县": {
            "id": 351,
            "alias": [],
            "峨眉乡": {
                "id": 2929,
                "alias": []
            },
            "districts": ["峨眉乡", "关西镇", "横山乡", "湖口乡", "尖石乡", "芎林乡", "五峰乡", "新丰乡", "新埔镇", "竹北市", "竹东镇", "宝山乡", "北埔乡"],
            "关西镇": {
                "id": 2930,
                "alias": []
            },
            "横山乡": {
                "id": 2931,
                "alias": []
            },
            "湖口乡": {
                "id": 2932,
                "alias": []
            },
            "尖石乡": {
                "id": 2933,
                "alias": []
            },
            "芎林乡": {
                "id": 2934,
                "alias": []
            },
            "五峰乡": {
                "id": 2935,
                "alias": []
            },
            "新丰乡": {
                "id": 2936,
                "alias": []
            },
            "新埔镇": {
                "id": 2937,
                "alias": []
            },
            "竹北市": {
                "id": 2938,
                "alias": ["竹北"]
            },
            "竹东镇": {
                "id": 2939,
                "alias": []
            },
            "宝山乡": {
                "id": 2940,
                "alias": []
            },
            "北埔乡": {
                "id": 2941,
                "alias": []
            }
        },
        "花莲县": {
            "id": 352,
            "alias": [],
            "卓溪乡": {
                "id": 2942,
                "alias": []
            },
            "districts": ["卓溪乡", "丰滨乡", "凤林镇", "富里乡", "光复乡", "花莲市", "吉安乡", "瑞穗乡", "寿丰乡", "万荣乡", "新城乡", "秀林乡", "玉里镇"],
            "丰滨乡": {
                "id": 2943,
                "alias": []
            },
            "凤林镇": {
                "id": 2944,
                "alias": []
            },
            "富里乡": {
                "id": 2945,
                "alias": []
            },
            "光复乡": {
                "id": 2946,
                "alias": []
            },
            "花莲市": {
                "id": 2947,
                "alias": ["花莲"]
            },
            "吉安乡": {
                "id": 2948,
                "alias": []
            },
            "瑞穗乡": {
                "id": 2949,
                "alias": []
            },
            "寿丰乡": {
                "id": 2950,
                "alias": []
            },
            "万荣乡": {
                "id": 2951,
                "alias": []
            },
            "新城乡": {
                "id": 2952,
                "alias": []
            },
            "秀林乡": {
                "id": 2953,
                "alias": []
            },
            "玉里镇": {
                "id": 2954,
                "alias": []
            }
        },
        "高雄市": {
            "id": 353,
            "alias": ["高雄"],
            "阿莲区": {
                "id": 2955,
                "alias": ["阿莲"]
            },
            "districts": ["阿莲区", "大寮区", "大社区", "大树区", "凤山区", "冈山区", "鼓山区", "湖内区", "甲仙区", "苓雅区", "林园区", "六龟区", "路竹区", "茂林区", "美浓区", "弥陀区", "那玛夏区", "楠梓区", "内门区", "鸟松区", "前金区", "前镇区", "桥头区", "茄萣区", "旗津区", "旗山区", "仁武区", "三民区", "杉林区", "桃源区", "田寮区", "小港区", "新兴区", "燕巢区", "盐埕区", "永安区", "梓官区", "左营区"],
            "大寮区": {
                "id": 2956,
                "alias": ["大寮"]
            },
            "大社区": {
                "id": 2957,
                "alias": ["大社"]
            },
            "大树区": {
                "id": 2958,
                "alias": ["大树"]
            },
            "凤山区": {
                "id": 2959,
                "alias": ["凤山"]
            },
            "冈山区": {
                "id": 2960,
                "alias": ["冈山"]
            },
            "鼓山区": {
                "id": 2961,
                "alias": ["鼓山"]
            },
            "湖内区": {
                "id": 2962,
                "alias": ["湖内"]
            },
            "甲仙区": {
                "id": 2963,
                "alias": ["甲仙"]
            },
            "苓雅区": {
                "id": 2964,
                "alias": ["苓雅"]
            },
            "林园区": {
                "id": 2965,
                "alias": ["林园"]
            },
            "六龟区": {
                "id": 2966,
                "alias": ["六龟"]
            },
            "路竹区": {
                "id": 2967,
                "alias": ["路竹"]
            },
            "茂林区": {
                "id": 2968,
                "alias": ["茂林"]
            },
            "美浓区": {
                "id": 2969,
                "alias": ["美浓"]
            },
            "弥陀区": {
                "id": 2970,
                "alias": ["弥陀"]
            },
            "那玛夏区": {
                "id": 2971,
                "alias": ["那玛夏"]
            },
            "楠梓区": {
                "id": 2972,
                "alias": ["楠梓"]
            },
            "内门区": {
                "id": 2973,
                "alias": ["内门"]
            },
            "鸟松区": {
                "id": 2974,
                "alias": ["鸟松"]
            },
            "前金区": {
                "id": 2975,
                "alias": ["前金"]
            },
            "前镇区": {
                "id": 2976,
                "alias": ["前镇"]
            },
            "桥头区": {
                "id": 2977,
                "alias": ["桥头"]
            },
            "茄萣区": {
                "id": 2978,
                "alias": ["茄萣"]
            },
            "旗津区": {
                "id": 2979,
                "alias": ["津区"]
            },
            "旗山区": {
                "id": 2980,
                "alias": ["山区"]
            },
            "仁武区": {
                "id": 2981,
                "alias": ["仁武"]
            },
            "三民区": {
                "id": 2982,
                "alias": ["三民"]
            },
            "杉林区": {
                "id": 2983,
                "alias": ["杉林"]
            },
            "桃源区": {
                "id": 2984,
                "alias": ["桃源"]
            },
            "田寮区": {
                "id": 2985,
                "alias": ["田寮"]
            },
            "小港区": {
                "id": 2986,
                "alias": ["小港"]
            },
            "新兴区": {
                "id": 2987,
                "alias": ["新兴"]
            },
            "燕巢区": {
                "id": 2988,
                "alias": ["燕巢"]
            },
            "盐埕区": {
                "id": 2989,
                "alias": ["盐埕"]
            },
            "永安区": {
                "id": 2990,
                "alias": ["永安"]
            },
            "梓官区": {
                "id": 2991,
                "alias": ["梓官"]
            },
            "左营区": {
                "id": 2992,
                "alias": ["左营"]
            }
        },
        "基隆市": {
            "id": 354,
            "alias": ["基隆"],
            "安乐区": {
                "id": 2993,
                "alias": ["安乐"]
            },
            "districts": ["安乐区", "暖暖区", "七堵区", "仁爱区", "信义区", "中山区", "中正区"],
            "暖暖区": {
                "id": 2994,
                "alias": ["暖暖"]
            },
            "七堵区": {
                "id": 2995,
                "alias": ["七堵"]
            },
            "仁爱区": {
                "id": 2996,
                "alias": ["仁爱"]
            },
            "信义区": {
                "id": 2997,
                "alias": ["信义"]
            },
            "中山区": {
                "id": 2998,
                "alias": ["中山"]
            },
            "中正区": {
                "id": 2999,
                "alias": ["中正"]
            }
        },
        "金门县": {
            "id": 355,
            "alias": [],
            "金城镇": {
                "id": 3000,
                "alias": []
            },
            "districts": ["金城镇", "金湖镇", "金宁乡", "金沙镇", "烈屿乡", "乌坵乡"],
            "金湖镇": {
                "id": 3001,
                "alias": []
            },
            "金宁乡": {
                "id": 3002,
                "alias": []
            },
            "金沙镇": {
                "id": 3003,
                "alias": []
            },
            "烈屿乡": {
                "id": 3004,
                "alias": []
            },
            "乌坵乡": {
                "id": 3005,
                "alias": []
            }
        },
        "连江县": {
            "id": 356,
            "alias": [],
            "北竿乡": {
                "id": 3006,
                "alias": []
            },
            "districts": ["北竿乡", "东引乡", "莒光乡", "南竿乡"],
            "东引乡": {
                "id": 3007,
                "alias": []
            },
            "莒光乡": {
                "id": 3008,
                "alias": []
            },
            "南竿乡": {
                "id": 3009,
                "alias": []
            }
        },
        "苗栗县": {
            "id": 357,
            "alias": [],
            "头屋乡": {
                "id": 3010,
                "alias": []
            },
            "districts": ["头屋乡", "西湖乡", "苑里镇", "造桥乡", "竹南镇", "卓兰镇", "大湖乡", "公馆乡", "后龙镇", "苗栗市", "南庄乡", "三湾乡", "三义乡", "狮潭乡", "泰安乡", "铜锣乡", "通霄镇", "头份市"],
            "西湖乡": {
                "id": 3011,
                "alias": []
            },
            "苑里镇": {
                "id": 3012,
                "alias": []
            },
            "造桥乡": {
                "id": 3013,
                "alias": []
            },
            "竹南镇": {
                "id": 3014,
                "alias": []
            },
            "卓兰镇": {
                "id": 3015,
                "alias": []
            },
            "大湖乡": {
                "id": 3016,
                "alias": []
            },
            "公馆乡": {
                "id": 3017,
                "alias": []
            },
            "后龙镇": {
                "id": 3018,
                "alias": []
            },
            "苗栗市": {
                "id": 3019,
                "alias": ["苗栗"]
            },
            "南庄乡": {
                "id": 3020,
                "alias": []
            },
            "三湾乡": {
                "id": 3021,
                "alias": []
            },
            "三义乡": {
                "id": 3022,
                "alias": []
            },
            "狮潭乡": {
                "id": 3023,
                "alias": []
            },
            "泰安乡": {
                "id": 3024,
                "alias": []
            },
            "铜锣乡": {
                "id": 3025,
                "alias": []
            },
            "通霄镇": {
                "id": 3026,
                "alias": []
            },
            "头份市": {
                "id": 3027,
                "alias": ["头份"]
            }
        },
        "南海岛": {
            "id": 358,
            "alias": [],
            "东沙群岛": {
                "id": 3028,
                "alias": []
            },
            "districts": ["东沙群岛", "南沙群岛"],
            "南沙群岛": {
                "id": 3029,
                "alias": []
            }
        },
        "南投县": {
            "id": 359,
            "alias": [],
            "草屯镇": {
                "id": 3030,
                "alias": []
            },
            "districts": ["草屯镇", "国姓乡", "集集镇", "鹿谷乡", "名间乡", "南投市", "埔里镇", "仁爱乡", "水里乡", "信义乡", "鱼池乡", "中寮乡", "竹山镇"],
            "国姓乡": {
                "id": 3031,
                "alias": []
            },
            "集集镇": {
                "id": 3032,
                "alias": []
            },
            "鹿谷乡": {
                "id": 3033,
                "alias": []
            },
            "名间乡": {
                "id": 3034,
                "alias": []
            },
            "南投市": {
                "id": 3035,
                "alias": ["南投"]
            },
            "埔里镇": {
                "id": 3036,
                "alias": []
            },
            "仁爱乡": {
                "id": 3037,
                "alias": []
            },
            "水里乡": {
                "id": 3038,
                "alias": []
            },
            "信义乡": {
                "id": 3039,
                "alias": []
            },
            "鱼池乡": {
                "id": 3040,
                "alias": []
            },
            "中寮乡": {
                "id": 3041,
                "alias": []
            },
            "竹山镇": {
                "id": 3042,
                "alias": []
            }
        },
        "新北市": {
            "id": 360,
            "alias": ["新北"],
            "八里区": {
                "id": 3043,
                "alias": ["八里"]
            },
            "districts": ["八里区", "板桥区", "贡寮区", "金山区", "林口区", "芦洲区", "坪林区", "平溪区", "瑞芳区", "三重区", "三峡区", "三芝区", "深坑区", "石碇区", "石门区", "双溪区", "树林区", "泰山区", "淡水区", "土城区", "万里区", "五股区", "乌来区", "新店区", "新庄区", "汐止区", "莺歌区", "永和区", "中和区"],
            "板桥区": {
                "id": 3044,
                "alias": ["板桥"]
            },
            "贡寮区": {
                "id": 3045,
                "alias": ["贡寮"]
            },
            "金山区": {
                "id": 3046,
                "alias": ["金山"]
            },
            "林口区": {
                "id": 3047,
                "alias": ["林口"]
            },
            "芦洲区": {
                "id": 3048,
                "alias": ["芦洲"]
            },
            "坪林区": {
                "id": 3049,
                "alias": ["坪林"]
            },
            "平溪区": {
                "id": 3050,
                "alias": ["平溪"]
            },
            "瑞芳区": {
                "id": 3051,
                "alias": ["瑞芳"]
            },
            "三重区": {
                "id": 3052,
                "alias": ["三重"]
            },
            "三峡区": {
                "id": 3053,
                "alias": ["三峡"]
            },
            "三芝区": {
                "id": 3054,
                "alias": ["三芝"]
            },
            "深坑区": {
                "id": 3055,
                "alias": ["深坑"]
            },
            "石碇区": {
                "id": 3056,
                "alias": ["石碇"]
            },
            "石门区": {
                "id": 3057,
                "alias": ["石门"]
            },
            "双溪区": {
                "id": 3058,
                "alias": ["双溪"]
            },
            "树林区": {
                "id": 3059,
                "alias": ["树林"]
            },
            "泰山区": {
                "id": 3060,
                "alias": ["泰山"]
            },
            "淡水区": {
                "id": 3061,
                "alias": ["淡水"]
            },
            "土城区": {
                "id": 3062,
                "alias": ["土城"]
            },
            "万里区": {
                "id": 3063,
                "alias": ["万里"]
            },
            "五股区": {
                "id": 3064,
                "alias": ["五股"]
            },
            "乌来区": {
                "id": 3065,
                "alias": ["乌来"]
            },
            "新店区": {
                "id": 3066,
                "alias": ["新店"]
            },
            "新庄区": {
                "id": 3067,
                "alias": ["新庄"]
            },
            "汐止区": {
                "id": 3068,
                "alias": ["汐止"]
            },
            "莺歌区": {
                "id": 3069,
                "alias": ["莺歌"]
            },
            "永和区": {
                "id": 3070,
                "alias": ["永和"]
            },
            "中和区": {
                "id": 3071,
                "alias": ["中和"]
            }
        },
        "澎湖县": {
            "id": 361,
            "alias": [],
            "白沙乡": {
                "id": 3072,
                "alias": []
            },
            "districts": ["白沙乡", "湖西乡", "马公市", "七美乡", "望安乡", "西屿乡"],
            "湖西乡": {
                "id": 3073,
                "alias": []
            },
            "马公市": {
                "id": 3074,
                "alias": ["马公"]
            },
            "七美乡": {
                "id": 3075,
                "alias": []
            },
            "望安乡": {
                "id": 3076,
                "alias": []
            },
            "西屿乡": {
                "id": 3077,
                "alias": []
            }
        },
        "屏东县": {
            "id": 362,
            "alias": [],
            "三地门乡": {
                "id": 3078,
                "alias": []
            },
            "districts": ["三地门乡", "狮子乡", "泰武乡", "万丹乡", "万峦乡", "雾台乡", "新埤乡", "新园乡", "盐埔乡", "竹田乡", "长治乡", "潮州镇", "车城乡", "春日乡", "东港镇", "枋寮乡", "枋山乡", "高树乡", "恆春镇", "佳冬乡", "九如乡", "崁顶乡", "来义乡", "里港乡", "林边乡", "麟洛乡", "琉球乡", "玛家乡", "满州乡", "牡丹乡", "南州乡", "内埔乡", "屏东市"],
            "狮子乡": {
                "id": 3079,
                "alias": []
            },
            "泰武乡": {
                "id": 3080,
                "alias": []
            },
            "万丹乡": {
                "id": 3081,
                "alias": []
            },
            "万峦乡": {
                "id": 3082,
                "alias": []
            },
            "雾台乡": {
                "id": 3083,
                "alias": []
            },
            "新埤乡": {
                "id": 3084,
                "alias": []
            },
            "新园乡": {
                "id": 3085,
                "alias": []
            },
            "盐埔乡": {
                "id": 3086,
                "alias": []
            },
            "竹田乡": {
                "id": 3087,
                "alias": []
            },
            "长治乡": {
                "id": 3088,
                "alias": []
            },
            "潮州镇": {
                "id": 3089,
                "alias": []
            },
            "车城乡": {
                "id": 3090,
                "alias": []
            },
            "春日乡": {
                "id": 3091,
                "alias": []
            },
            "东港镇": {
                "id": 3092,
                "alias": []
            },
            "枋寮乡": {
                "id": 3093,
                "alias": []
            },
            "枋山乡": {
                "id": 3094,
                "alias": []
            },
            "高树乡": {
                "id": 3095,
                "alias": []
            },
            "恆春镇": {
                "id": 3096,
                "alias": []
            },
            "佳冬乡": {
                "id": 3097,
                "alias": []
            },
            "九如乡": {
                "id": 3098,
                "alias": []
            },
            "崁顶乡": {
                "id": 3099,
                "alias": []
            },
            "来义乡": {
                "id": 3100,
                "alias": []
            },
            "里港乡": {
                "id": 3101,
                "alias": []
            },
            "林边乡": {
                "id": 3102,
                "alias": []
            },
            "麟洛乡": {
                "id": 3103,
                "alias": []
            },
            "琉球乡": {
                "id": 3104,
                "alias": []
            },
            "玛家乡": {
                "id": 3105,
                "alias": []
            },
            "满州乡": {
                "id": 3106,
                "alias": []
            },
            "牡丹乡": {
                "id": 3107,
                "alias": []
            },
            "南州乡": {
                "id": 3108,
                "alias": []
            },
            "内埔乡": {
                "id": 3109,
                "alias": []
            },
            "屏东市": {
                "id": 3110,
                "alias": ["屏东"]
            }
        },
        "台中市": {
            "id": 363,
            "alias": ["台中"],
            "梧栖区": {
                "id": 3111,
                "alias": ["梧栖"]
            },
            "districts": ["梧栖区", "乌日区", "新社区", "西屯区", "北屯区", "中区", "大肚区", "大甲区", "大里区", "大雅区", "大安区", "东势区", "东区", "丰原区", "和平区", "后里区", "龙井区", "南屯区", "北区", "清水区", "沙鹿区", "神冈区", "石冈区", "南区", "太平区", "潭子区", "外埔区", "西区", "雾峰区"],
            "乌日区": {
                "id": 3112,
                "alias": ["乌日"]
            },
            "新社区": {
                "id": 3113,
                "alias": ["新社"]
            },
            "西屯区": {
                "id": 3114,
                "alias": ["西屯"]
            },
            "北屯区": {
                "id": 3115,
                "alias": ["北屯"]
            },
            "中区": {
                "id": 3116,
                "alias": []
            },
            "大肚区": {
                "id": 3117,
                "alias": ["大肚"]
            },
            "大甲区": {
                "id": 3118,
                "alias": ["大甲"]
            },
            "大里区": {
                "id": 3119,
                "alias": ["大里"]
            },
            "大雅区": {
                "id": 3120,
                "alias": ["大雅"]
            },
            "大安区": {
                "id": 3121,
                "alias": ["大安"]
            },
            "东势区": {
                "id": 3122,
                "alias": ["东势"]
            },
            "东区": {
                "id": 3123,
                "alias": []
            },
            "丰原区": {
                "id": 3124,
                "alias": ["丰原"]
            },
            "和平区": {
                "id": 3125,
                "alias": ["和平"]
            },
            "后里区": {
                "id": 3126,
                "alias": ["后里"]
            },
            "龙井区": {
                "id": 3127,
                "alias": ["龙井"]
            },
            "南屯区": {
                "id": 3128,
                "alias": ["南屯"]
            },
            "北区": {
                "id": 3129,
                "alias": []
            },
            "清水区": {
                "id": 3130,
                "alias": ["清水"]
            },
            "沙鹿区": {
                "id": 3131,
                "alias": ["沙鹿"]
            },
            "神冈区": {
                "id": 3132,
                "alias": ["神冈"]
            },
            "石冈区": {
                "id": 3133,
                "alias": ["石冈"]
            },
            "南区": {
                "id": 3134,
                "alias": []
            },
            "太平区": {
                "id": 3135,
                "alias": ["太平"]
            },
            "潭子区": {
                "id": 3136,
                "alias": ["潭子"]
            },
            "外埔区": {
                "id": 3137,
                "alias": ["外埔"]
            },
            "西区": {
                "id": 3138,
                "alias": []
            },
            "雾峰区": {
                "id": 3139,
                "alias": ["雾峰"]
            }
        },
        "台南市": {
            "id": 364,
            "alias": ["台南"],
            "佳里区": {
                "id": 3140,
                "alias": ["佳里"]
            },
            "districts": ["佳里区", "将军区", "六甲区", "柳营区", "龙崎区", "麻豆区", "南化区", "楠西区", "北区", "七股区", "仁德区", "善化区", "山上区", "南区", "中西区", "下营区", "西港区", "新化区", "新市区", "新营区", "学甲区", "盐水区", "永康区", "玉井区", "左镇区", "安定区", "安南区", "安平区", "白河区", "北门区", "大内区", "东山区", "东区", "关庙区", "官田区", "归仁区", "后壁区"],
            "将军区": {
                "id": 3141,
                "alias": ["将军"]
            },
            "六甲区": {
                "id": 3142,
                "alias": ["六甲"]
            },
            "柳营区": {
                "id": 3143,
                "alias": ["柳营"]
            },
            "龙崎区": {
                "id": 3144,
                "alias": ["龙崎"]
            },
            "麻豆区": {
                "id": 3145,
                "alias": ["麻豆"]
            },
            "南化区": {
                "id": 3146,
                "alias": ["南化"]
            },
            "楠西区": {
                "id": 3147,
                "alias": ["楠西"]
            },
            "北区": {
                "id": 3148,
                "alias": []
            },
            "七股区": {
                "id": 3149,
                "alias": ["七股"]
            },
            "仁德区": {
                "id": 3150,
                "alias": ["仁德"]
            },
            "善化区": {
                "id": 3151,
                "alias": ["善化"]
            },
            "山上区": {
                "id": 3152,
                "alias": ["山上"]
            },
            "南区": {
                "id": 3153,
                "alias": []
            },
            "中西区": {
                "id": 3154,
                "alias": ["中西"]
            },
            "下营区": {
                "id": 3155,
                "alias": ["下营"]
            },
            "西港区": {
                "id": 3156,
                "alias": ["西港"]
            },
            "新化区": {
                "id": 3157,
                "alias": ["新化"]
            },
            "新市区": {
                "id": 3158,
                "alias": ["新市"]
            },
            "新营区": {
                "id": 3159,
                "alias": ["新营"]
            },
            "学甲区": {
                "id": 3160,
                "alias": ["学甲"]
            },
            "盐水区": {
                "id": 3161,
                "alias": ["盐水"]
            },
            "永康区": {
                "id": 3162,
                "alias": ["永康"]
            },
            "玉井区": {
                "id": 3163,
                "alias": ["玉井"]
            },
            "左镇区": {
                "id": 3164,
                "alias": ["左镇"]
            },
            "安定区": {
                "id": 3165,
                "alias": ["安定"]
            },
            "安南区": {
                "id": 3166,
                "alias": ["安南"]
            },
            "安平区": {
                "id": 3167,
                "alias": ["安平"]
            },
            "白河区": {
                "id": 3168,
                "alias": ["白河"]
            },
            "北门区": {
                "id": 3169,
                "alias": ["北门"]
            },
            "大内区": {
                "id": 3170,
                "alias": ["大内"]
            },
            "东山区": {
                "id": 3171,
                "alias": ["东山"]
            },
            "东区": {
                "id": 3172,
                "alias": []
            },
            "关庙区": {
                "id": 3173,
                "alias": ["关庙"]
            },
            "官田区": {
                "id": 3174,
                "alias": ["官田"]
            },
            "归仁区": {
                "id": 3175,
                "alias": ["归仁"]
            },
            "后壁区": {
                "id": 3176,
                "alias": ["后壁"]
            }
        },
        "台北市": {
            "id": 365,
            "alias": ["台北"],
            "北投区": {
                "id": 3177,
                "alias": ["北投"]
            },
            "districts": ["北投区", "大同区", "大安区", "南港区", "内湖区", "士林区", "松山区", "万华区", "文山区", "信义区", "中山区", "中正区"],
            "大同区": {
                "id": 3178,
                "alias": ["大同"]
            },
            "大安区": {
                "id": 3179,
                "alias": ["大安"]
            },
            "南港区": {
                "id": 3180,
                "alias": ["南港"]
            },
            "内湖区": {
                "id": 3181,
                "alias": ["内湖"]
            },
            "士林区": {
                "id": 3182,
                "alias": ["士林"]
            },
            "松山区": {
                "id": 3183,
                "alias": ["松山"]
            },
            "万华区": {
                "id": 3184,
                "alias": ["万华"]
            },
            "文山区": {
                "id": 3185,
                "alias": ["文山"]
            },
            "信义区": {
                "id": 3186,
                "alias": ["信义"]
            },
            "中山区": {
                "id": 3187,
                "alias": ["中山"]
            },
            "中正区": {
                "id": 3188,
                "alias": ["中正"]
            }
        },
        "台东县": {
            "id": 366,
            "alias": [],
            "卑南乡": {
                "id": 3189,
                "alias": []
            },
            "districts": ["卑南乡", "长滨乡", "成功镇", "池上乡", "达仁乡", "大武乡", "东河乡", "关山镇", "海端乡", "金峰乡", "兰屿乡", "绿岛乡", "鹿野乡", "太麻里乡", "台东市", "延平乡"],
            "长滨乡": {
                "id": 3190,
                "alias": []
            },
            "成功镇": {
                "id": 3191,
                "alias": []
            },
            "池上乡": {
                "id": 3192,
                "alias": []
            },
            "达仁乡": {
                "id": 3193,
                "alias": []
            },
            "大武乡": {
                "id": 3194,
                "alias": []
            },
            "东河乡": {
                "id": 3195,
                "alias": []
            },
            "关山镇": {
                "id": 3196,
                "alias": []
            },
            "海端乡": {
                "id": 3197,
                "alias": []
            },
            "金峰乡": {
                "id": 3198,
                "alias": []
            },
            "兰屿乡": {
                "id": 3199,
                "alias": []
            },
            "绿岛乡": {
                "id": 3200,
                "alias": []
            },
            "鹿野乡": {
                "id": 3201,
                "alias": []
            },
            "太麻里乡": {
                "id": 3202,
                "alias": []
            },
            "台东市": {
                "id": 3203,
                "alias": ["台东"]
            },
            "延平乡": {
                "id": 3204,
                "alias": []
            }
        },
        "桃园市": {
            "id": 367,
            "alias": ["桃园"],
            "八德区": {
                "id": 3205,
                "alias": ["八德"]
            },
            "districts": ["八德区", "大溪区", "大园区", "复兴区", "观音区", "龟山区", "龙潭区", "芦竹区", "平镇区", "桃园区", "新屋区", "杨梅区", "中坜区"],
            "大溪区": {
                "id": 3206,
                "alias": ["大溪"]
            },
            "大园区": {
                "id": 3207,
                "alias": ["大园"]
            },
            "复兴区": {
                "id": 3208,
                "alias": ["复兴"]
            },
            "观音区": {
                "id": 3209,
                "alias": ["观音"]
            },
            "龟山区": {
                "id": 3210,
                "alias": ["龟山"]
            },
            "龙潭区": {
                "id": 3211,
                "alias": ["龙潭"]
            },
            "芦竹区": {
                "id": 3212,
                "alias": ["芦竹"]
            },
            "平镇区": {
                "id": 3213,
                "alias": ["平镇"]
            },
            "桃园区": {
                "id": 3214,
                "alias": ["桃园"]
            },
            "新屋区": {
                "id": 3215,
                "alias": ["新屋"]
            },
            "杨梅区": {
                "id": 3216,
                "alias": ["杨梅"]
            },
            "中坜区": {
                "id": 3217,
                "alias": ["中坜"]
            }
        },
        "宜兰县": {
            "id": 368,
            "alias": [],
            "大同乡": {
                "id": 3218,
                "alias": []
            },
            "districts": ["大同乡", "钓鱼台", "冬山乡", "礁溪乡", "罗东镇", "南澳乡", "三星乡", "苏澳镇", "头城镇", "五结乡", "宜兰市", "员山乡", "壮围乡"],
            "钓鱼台": {
                "id": 3219,
                "alias": []
            },
            "冬山乡": {
                "id": 3220,
                "alias": []
            },
            "礁溪乡": {
                "id": 3221,
                "alias": []
            },
            "罗东镇": {
                "id": 3222,
                "alias": []
            },
            "南澳乡": {
                "id": 3223,
                "alias": []
            },
            "三星乡": {
                "id": 3224,
                "alias": []
            },
            "苏澳镇": {
                "id": 3225,
                "alias": []
            },
            "头城镇": {
                "id": 3226,
                "alias": []
            },
            "五结乡": {
                "id": 3227,
                "alias": []
            },
            "宜兰市": {
                "id": 3228,
                "alias": ["宜兰"]
            },
            "员山乡": {
                "id": 3229,
                "alias": []
            },
            "壮围乡": {
                "id": 3230,
                "alias": []
            }
        },
        "云林县": {
            "id": 369,
            "alias": [],
            "褒忠乡": {
                "id": 3231,
                "alias": []
            },
            "districts": ["褒忠乡", "北港镇", "莿桐乡", "大埤乡", "东势乡", "斗六市", "斗南镇", "二崙乡", "古坑乡", "虎尾镇", "口湖乡", "林内乡", "崙背乡", "麦寮乡", "水林乡", "四湖乡", "台西乡", "土库镇", "西螺镇", "元长乡"],
            "北港镇": {
                "id": 3232,
                "alias": []
            },
            "莿桐乡": {
                "id": 3233,
                "alias": []
            },
            "大埤乡": {
                "id": 3234,
                "alias": []
            },
            "东势乡": {
                "id": 3235,
                "alias": []
            },
            "斗六市": {
                "id": 3236,
                "alias": ["斗六"]
            },
            "斗南镇": {
                "id": 3237,
                "alias": []
            },
            "二崙乡": {
                "id": 3238,
                "alias": []
            },
            "古坑乡": {
                "id": 3239,
                "alias": []
            },
            "虎尾镇": {
                "id": 3240,
                "alias": []
            },
            "口湖乡": {
                "id": 3241,
                "alias": []
            },
            "林内乡": {
                "id": 3242,
                "alias": []
            },
            "崙背乡": {
                "id": 3243,
                "alias": []
            },
            "麦寮乡": {
                "id": 3244,
                "alias": []
            },
            "水林乡": {
                "id": 3245,
                "alias": []
            },
            "四湖乡": {
                "id": 3246,
                "alias": []
            },
            "台西乡": {
                "id": 3247,
                "alias": []
            },
            "土库镇": {
                "id": 3248,
                "alias": []
            },
            "西螺镇": {
                "id": 3249,
                "alias": []
            },
            "元长乡": {
                "id": 3250,
                "alias": []
            }
        }
    }
}

function getPhone(addr_input) {
    // var phones = [["name","position"]];
    var phone = [];
    var reg = /1[3456789]\d{9}/g;

    // do{
    var match = reg.exec(addr_input);
    if (match) {
        // phones.push([match[0],reg.lastIndex,match['index']]);
        phone = [match[0], match['index'], reg.lastIndex];
    }
    // }while(match)
    return phone;
}
function tryProvince(addr_input, addr_hash, level = 0) {
    // var provinces = [["name","match_name","position"]];
    var provinces_list = addr_hash['provinces'];
    var try_provinces = [];
    for (var i = 0; i < provinces_list.length; i++) {
        var province_name = provinces_list[i];
        var re = new RegExp(province_name, "gim");
        var matched = "";
        var bingo = false;
        // console.info("测试：",province_name);
        do {
            matched = re.exec(addr_input);
            if (matched) {
                try_provinces.push([provinces_list[i], province_name, matched['index'], re.lastIndex]);
                bingo = true;
                // console.info("匹配：",matched);
            }
        } while (matched)
        // 如果不存在就在检查缩写
        if (!bingo && level == 1 && addr_hash[province_name].hasOwnProperty('alias')) {
            for (var j = 0; j < addr_hash[province_name]['alias'].length; j++) {
                var nickname = addr_hash[province_name]['alias'][j];
                var re = new RegExp(nickname, "gim");
                var matched = "";
                // console.info("测试：",nickname);
                do {
                    matched = re.exec(addr_input);
                    if (matched) {
                        try_provinces.push([provinces_list[i], nickname, matched['index'], re.lastIndex]);
                    }
                } while (re.lastIndex)
                // console.info("匹配",matched);
            }
        }
    }
    return try_provinces;
}
function tryCity(addr_input, addr_hash, province_name, search_from = 0, max_gap = 3, level = 0) {
    var try_cities = [];
    var cities_list = addr_hash[province_name]['cities'];
    for (var i = 0; i < cities_list.length; i++) {
        var city_name = cities_list[i];
        var re = new RegExp(city_name, "gim");
        re.lastIndex = search_from;
        var matched = "";
        var bingo = false;
        do {
            matched = re.exec(addr_input);
            if (matched) {
                if (matched['index'] - search_from > max_gap)
                    continue;
                try_cities.push([cities_list[i], cities_list[i], matched['index'], re.lastIndex]);
                bingo = true;
            }
        } while (re.lastIndex)

        console.info(city_name, bingo, level == 1, addr_hash[province_name][city_name].hasOwnProperty('alias'));

        // 如果不存在就在检查缩写
        if (!bingo && level == 1 && addr_hash[province_name][city_name].hasOwnProperty('alias')) {
            for (var j = 0; j < addr_hash[province_name][city_name]['alias'].length; j++) {
                var nickname = addr_hash[province_name][city_name]['alias'][j];
                var re = new RegExp(nickname, "gim");
                re.lastIndex = search_from;
                var matched = "";
                console.info(province_name, nickname);
                do {
                    matched = re.exec(addr_input);
                    if (matched) {
                        if (matched['index'] - search_from > max_gap)
                            continue;
                        try_cities.push([cities_list[i], nickname, matched['index'], re.lastIndex]);
                    }
                } while (re.lastIndex)
            }
        }
    }
    return try_cities;
}

function tryDistrict(addr_input, addr_hash, province_name, city_name, search_from = 0, max_gap = 3, level = 0) {
    var try_districts = [];
    var districts_list = addr_hash[province_name][city_name]['districts'];
    for (var i = 0; i < districts_list.length; i++) {
        var district_name = districts_list[i];
        var re = new RegExp(district_name, "gim");
        re.lastIndex = search_from;
        var matched = "";
        var bingo = false;
        do {
            matched = re.exec(addr_input);
            if (matched) {
                if (matched['index'] - search_from > max_gap)
                    continue;
                try_districts.push([districts_list[i], districts_list[i], matched['index'], re.lastIndex]);
                bingo = true;
            }
        } while (re.lastIndex)

        // 如果不存在就在检查缩写
        if (!bingo && level == 1 && addr_hash[province_name][city_name][district_name].hasOwnProperty('alias')) {
            for (var j = 0; j < addr_hash[province_name][city_name][district_name]['alias'].length; j++) {
                var nickname = addr_hash[province_name][city_name][district_name]['alias'][j];
                var re = new RegExp(nickname, "gim");
                re.lastIndex = search_from;
                var matched = "";
                do {
                    matched = re.exec(addr_input);
                    if (matched) {
                        if (matched['index'] - search_from > max_gap)
                            continue;
                        try_districts.push([districts_list[i], nickname, matched['index'], re.lastIndex]);
                    }
                } while (re.lastIndex)
            }
        }
    }
    return try_districts;
}

function tryAddr(addr_input) {
    var try_addrs = [];
    var parse_addrs = [];
    addr_input = addr_input.trim();
    addr_input = addr_input.replace(/，|。|；|！|\t|　|,|;/g, " ").replace(/\s+/g, " ")
    try{

      var try_provinces = tryProvince(addr_input, addr_hash, 1);
      var max_gap = 3;
      console.info(try_provinces);
      if (try_provinces.length > 0) {
          for (var i = 0; i < try_provinces.length; i++) {
              var province_info = try_provinces[i];
              var province_name = province_info[0];
              // 如果是直辖市可以省掉二级的区域。
              var try_cities = tryCity(addr_input, addr_hash, province_name, province_info[3], max_gap, 1);
              if (try_cities.length == 0 && (province_name == "上海市" || province_name == "北京市" || province_name == "天津市")) {
                  //
                  try_cities = [province_info];
              }
              console.info(try_cities);
              if (try_cities.length > 0) {
                  for (var j = 0; j < try_cities.length; j++) {
                      var city_info = try_cities[j];
                      var city_name = city_info[0];
                      var try_districts = tryDistrict(addr_input, addr_hash, province_name, city_name, city_info[3], max_gap, 1);
                      // console.info(try_districts);

                      if (try_districts.length > 0) {
                          for (var k = 0; k < try_districts.length; k++) {
                              var district_info = try_districts[k];
                              var district_name = district_info[0];
                              //      区域信息 开始位置 结束位置 province_info[3],district_info[2]
                              try_addrs.push([province_name, city_name, district_name, province_info[2], district_info[3]]);
                          }
                      }
                  }
              } else {
                  // 当没有识别到地级市级别的名称时。将遍历各个地级市的名称，匹配的各个可能的三级地区名称
                  for (var di = 0; di < addr_hash[province_name]['cities'].length; di++) {
                      var deeptry_city_name = addr_hash[province_name]['cities'][di];

                      var deeptry_districts = tryDistrict(addr_input, addr_hash, province_name, deeptry_city_name, province_info[3], max_gap, 1);
                      console.info(deeptry_city_name, deeptry_districts);

                      if (deeptry_districts.length > 0) {
                          for (var k = 0; k < deeptry_districts.length; k++) {
                              var district_info = deeptry_districts[k];
                              var district_name = district_info[0];
                              //      区域信息 开始位置 结束位置 province_info[3],district_info[2]
                              try_addrs.push([province_name, deeptry_city_name, district_name, province_info[2], district_info[3]]);
                          }
                      }
                  }

              }
          }
      } else {
          // 如果没有识别到省级的名称，将遍历各个地级城市。
          for (var di = 0; di < addr_hash['provinces'].length; di++) {
              var deeptry_province_name = addr_hash['provinces'][di];

              var deeptry_cities = tryCity(addr_input, addr_hash, deeptry_province_name, 0, addr_input.length, 1);
              console.info(deeptry_province_name, deeptry_cities);

              if (deeptry_cities.length > 0) {
                  for (var k = 0; k < deeptry_cities.length; k++) {
                      var city_info = deeptry_cities[k];
                      var city_name = city_info[0];

                      var try_districts = tryDistrict(addr_input, addr_hash, deeptry_province_name, city_name, city_info[3], max_gap, 1);
                      // console.info(try_districts);

                      if (try_districts.length > 0) {
                          for (var k = 0; k < try_districts.length; k++) {
                              var district_info = try_districts[k];
                              var district_name = district_info[0];
                              //      区域信息 开始位置 结束位置 province_info[3],district_info[2]
                              try_addrs.push([deeptry_province_name, city_name, district_name, city_info[2], district_info[3]]);
                          }
                      }
                  }
              }
          }
      }

      console.info(try_addrs);
      var try_phone = getPhone(addr_input);

      // 判断  手机号 区域 地址 人名；  地址在区域的后面。 手机和姓名在一起
      // 如果手机号将地址和人名进行了分割。
      for (var ii = 0; ii < try_addrs.length; ii++) {
          var name = "";
          var phone = "";
          var addr_detail = "";
          if (try_phone.length != 0) {
              phone = try_phone[0];

              // 如果手机和姓名 在区域之前，
              if (try_phone[1] < try_addrs[ii][3]) {
                  // 区域前面的字符减去手机号的字符。
                  name = addr_input.substring(0, try_addrs[ii][3]).replace(try_phone[0], "").trim();
                  // 详细地址为区域后面的字符；
                  addr_detail = addr_input.substring(try_addrs[ii][4]).trim();
              } else {
                  // 如果手机和姓名在区域的后面
                  // 假定姓名在手机后面
                  name = addr_input.substring(try_phone[2]).trim();
                  // 详细地址在手机前面
                  addr_detail = addr_input.substring(try_addrs[ii][4], try_phone[1]).trim();

                  if (name.length == 0) {
                      // 可能详细地址与姓名混在一起了。尝试分隔符切割
                      var tmp = addr_detail.split(/ |;|；| |,|，/);
                      if (tmp.length > 1) {
                          name = tmp.pop();
                          addr_detail = addr_detail.substring(0, addr_detail.length - name.length);
                      }
                  }
              }
          } else {
              name = "";
              addr_detail = addr_input.substring(try_addrs[ii][4]).trim();
              if (try_addrs[ii][3] > 2) {
                  name = addr_input.substring(0, try_addrs[ii][3]).trim();
              } else {
                  var tmp = addr_detail.split(/ |;|；| |,|，/);
                  if (tmp.length > 1) {
                      name = tmp.pop();
                      addr_detail = addr_detail.substring(0, addr_detail.length - name.length);
                  }
              }
          }
          parse_addrs.push({
              'province': try_addrs[ii][0],
              'city': try_addrs[ii][1],
              'district': try_addrs[ii][2],
              'province_id': addr_hash[try_addrs[ii][0]]['id'],
              'city_id': addr_hash[try_addrs[ii][0]][try_addrs[ii][1]]['id'],
              'district_id': addr_hash[try_addrs[ii][0]][try_addrs[ii][1]][try_addrs[ii][2]]['id'],
              'addr_detail': addr_detail,
              'phone': phone,
              'name': name
          })
          try_addrs[ii].push(addr_detail, phone, name);
      }
    }catch(e){
    console.info(e);
    }
    console.info(parse_addrs)
    return parse_addrs;
}

function test(){
  var test_addr_list = [
  "李玲 13656136999 江苏省 镇江市 润州区 领城国际B座1318室",
  "江苏省 镇江市 润州区 领城国际B座1318室 李玲 13656136999",
  "江苏省 镇江市 润州区 领城国际B座1318室 13656136999 李玲 ",
  "13656136999 李玲 江苏省 镇江市 润州区 领城国际B座1318室",
  "13656136999 江苏省 镇江市 润州区 领城国际B座1318室",
  "13656136999 李玲 镇江 润州区 领城国际B座1318室",
  "13656136999 李玲 上海市 上海市 浦东新区 南汇新城镇海港大道1550号上海海事大学临港校区物流工程学院楼302",
  "13656136999 李玲 上海市 上海市 浦东新区 南汇新城镇海港大道1550号上海海事大学临港校区物流工程学院楼302",
  "13656136999 李玲 江苏 润州 领城国际B座1318室"
  ];
  
}
